Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
<?xml version="1.0" encoding="utf-8"?>

<!-- File naming: RL6955_ips.svd -->

<!--  Copyright (C) 2012-2025 Realsil Limited. All rights reserved.   -->

<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Realtek</vendor>
  <vendorID>RTK</vendorID>
  <name>RL6955_IP_SVD</name>
  <description>IP svd file</description>
  <peripherals>
    <peripheral>
      <name>PLL_REG</name>
      <baseAddress>0x41000500</baseAddress>
      <size>0x00000074</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000074</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_PLL_CTRL0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00003428</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_PREDIV</name>
              <description>对PLL输入参考频率ckin进行pre_divide:
00:ckin/1
01:ckin/2
10:ckin/4
11:ckin/8</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CMU_EN</name>
              <description>PLL的使能信号</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CCO_SEL</name>
              <description>控制选择CCO mode还是VCO mode
0: vco mode
1: cco mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BIG_CCO</name>
              <description>控制KVCO曲线斜率</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_ICP</name>
              <description>CP电流ICP选择:
00:ICP=5u
01:ICP=10u
10:ICP=15u
11:ICP=20u</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LPF_CP</name>
              <description>lpf小电容CS选择:
0:CS=1p
1:CS=2p</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LF_R</name>
              <description>lpf电阻RS选择:
000: 3.1KΩ ,    001: 6.1KΩ ,
010: 9.2KΩ ,    011: 12.2KΩ,
100: 15.2KΩ,   101: 18.2KΩ,
110: 21.3KΩ,   111: 24.3KΩ</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CMU_PI_ISEL</name>
              <description>选择PI电流ISEL的大小:
0000:ICP=3.125u      1000:ICP=28.125u
0001:ICP=6.25u        1001:ICP=31.25u
0010:ICP=9.375u      1010:ICP=34.375u
0011:ICP=12.5u        1011:ICP=37.5u
0100:ICP=15.625u    1100:ICP=40.625u
0101:ICP=18.75u      1101:ICP=43.75u
0110:ICP=21.875u    1110:ICP=46.875u
0111:ICP=25u           1111:ICP=50u</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TEST_EN</name>
              <description>DEBUG信号</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMU_DBG</name>
              <description></description>
              <bitRange>[22:20]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SSC_CTRL0</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000016</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NCODE_T_SCPU</name>
              <description>VCO target频率对应的 Ncode</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCODE_T_SCPU</name>
              <description>VCO target频率对应的 Fcode</description>
              <bitRange>[18:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SSC_CTRL1</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NCODE_SSC</name>
              <description>SSC低点频率对应的Ncode
SSC时,频率会在"target频率" 与 "SSC低点频率"之间以三角波形式变化.
Note: SSC低点 频率要小于target频率</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCODE_SSC</name>
              <description>SSC低点频率对应的Fcode
SSC时,频率会在"target频率" 与 "SSC低点频率"之间以三角波形式变化.
Note: SSC低点 频率要小于target频率</description>
              <bitRange>[18:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SSC_CTRL2</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>flag_initial</name>
              <description>线性超频控制信号
0: 不执行线性超频,OC_EN 0-&gt;1 toggle后,直接把NFcode 吃进来
1: 执行线性超频,OC_EN 0-&gt;1 toggle后,按设定的线性超频模式逐渐超频到target NF 值</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OC_EN</name>
              <description>OC_EN 0-&gt;1 toggle ,才会把NCODE_T_SCPU[7:0], FCODE_T_SCPU[12:0], NCODE_SSC[7:0], FCODE_SSC[12:0],GRAN_EST[20:0] load进来</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SEL_OC_MODE</name>
              <description>线性超频模式:
00: 以每次跳变REG_OC_STEP_SET[9:0]的方式线性超频到target值.
     a)如果 "当前NF 值" - "target NF 值" &gt; 与REG_SEL_OC_STEP_SET[9:0], 每次跳变REG_SEL_OC_STEP_SET[9:0]
     b) 如果 "当前NF 值" - "target NF 值" &lt;= 与REG_SEL_OC_STEP_SET[9:0], 直接超频到target NF 值
01: 先直接一步超频到 "target NF code" - delta,  然后按mode 00 方式继续超频. delta 大小由REG_HS_OC_STOP_DIFF[1:0] 设定
10: 先直接一步讲{Ncode[7:0], Fcode[12:6]}超频到 target值,然后按mode 00 方式继续超频
11: 同mode 10</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_OC_STEP_SET</name>
              <description>线性超频且超频mode=00时,每次跳变的step</description>
              <bitRange>[23:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HS_OC_STOP_DIFF</name>
              <description>线性超频mode01时,设定一步超频后离target NFcode的delta值</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_OC_DONE_delay</name>
              <description>OC_EN  1-&gt;0后,多久将SSCD送出的flag信号OC_DONE 置1
判断NFcode==target NF code后, delay REG_OC_DONE_delay[5:0]个CKXSTAL周期, OC_DONE 置1</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SSC_CTRL3</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x2A0056A1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_BYPASS_PI</name>
              <description>bypass PI
=0: 送给PLL Loop PI的phase selsect信号正常toggle
=1:送给PLL Loop PI的phase selsect==0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_SSC</name>
              <description>SSC enable:
=0: disable SSC
=1: enable SSC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SDM_ORDER</name>
              <description>Sigma-delta order:
=0: 1阶 sigma-delta
=1: 2阶 sigma-delta</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAN_EST</name>
              <description>SSC step (SSC depth&amp;frequence计算公式见ppt)</description>
              <bitRange>[22:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DOT_GRAN</name>
              <description>控制GRAN_EST[20:0]的小数点位置</description>
              <bitRange>[25:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GRAN_AUTO_RST</name>
              <description>SSC step auto reset control:
=0: not auto reset
=1: SSC step在三角波拐点处每次都 reset 到0, 然后再将GRAN_EST, REG_DOT_GRAN赋给SSC step</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_EN_WDOG</name>
              <description>PLL watchdog enable
=0: disable PLL watchdog
=1: enable PLL watchdog</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TIME0_CK</name>
              <description>PLL watchdog timer:
3'b000:  watchdog compare CKREF&amp;CKBK frequency Every 2 CKREF period
3'b001:  watchdog compare CKREF&amp;CKBK frequency Every 200 CKREF period
3'b010:  watchdog compare CKREF&amp;CKBK frequency Every 600 CKREF period
3'b011:  watchdog compare CKREF&amp;CKBK frequency Every 1200 CKREF period
3'b100:  watchdog compare CKREF&amp;CKBK frequency Every 3000 CKREF period
3'b101:  watchdog compare CKREF&amp;CKBK frequency Every 6400 CKREF period
3'b110:  watchdog compare CKREF&amp;CKBK frequency Every 12800 CKREF period
3'b111:  watchdog compare CKREF&amp;CKBK frequency Every 16000 CKREF period</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SSC_CTRL4</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_TIME_RDY_CKOUT</name>
              <description>output signal CLKRDY delay control</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_TIME2_RST_WIDTH</name>
              <description>PLL watchdog signal pulse width:
2'b00:  watchdog reset pulse width =2 CKREF period
2'b01:  watchdog reset pulse width =4 CKREF period
2'b01:  watchdog reset pulse width =8 CKREF period
2'b01:  watchdog reset pulse width =20 CKREF period</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FMOD</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OC_DONE</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKRDY</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NCODE_DEBUG</name>
              <description></description>
              <bitRange>[12:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FCODE_DEBUG</name>
              <description></description>
              <bitRange>[26:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fen_pll</name>
              <description>SSC global reset, at same time reset PLL also
when pll on , set it to 1 after PWC is enable
when pll off , set it to 0 at last</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWC_UALV_PLL</name>
              <description>keep UA10PC_EN for PLL</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWC_UAHV_PLL</name>
              <description>keep UA33PC_EN for PLL</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PLL_STATE</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000F0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ckrdy_pll</name>
              <description>PLL clock is ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DEBUG</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>adbg_aux</name>
              <description>dummy</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lpad_dummy</name>
              <description>dummy</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CLK_CALC</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ck_cal_start</name>
              <description>Start clk calibration . This bit will auto-set to 0 when cal done .</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ck_cal_sel</name>
              <description>Calibration clock selection . The refrence clock is xtal clock.
0: OSC4M
1: AON100K
2: AON128K for SDM</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ck_cal_rpt</name>
              <description>Clock calibration result</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_UPLL_CTRL0</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x14DA0018</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB2_DIGOTGPADEN</name>
              <description>1: usb otg pad used as digital IO pad</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTG_EN</name>
              <description>0: disable otg signals to usb mac</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USB2_DIGPADEN</name>
              <description>1: usb pad used as digital IO pad</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO_USBA_EN</name>
              <description>1: Enable isolation signal from USBPHY analog
0: disable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_PLL_EN</name>
              <description>uphy pll enable request, keep pll alive when usb entering suspend state
both usb_aphy_en and sys_pll_en should be set 0 to disable uphy pll</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_APHY_EN</name>
              <description>usb aphy power on reset, low active
this bit also controls uphy pll:
can only write 1 after xtal normal 40M is ready
write 0, uphy pll will be disabled
Note: when power on , HW pmc only set this bit to 1 , other using default value , and USB pll can power up</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DPHY_EN</name>
              <description>usb dphy power on reset, low active</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWC_UABG_EN</name>
              <description>1: enable USBPHY BG power cut</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWC_UAHV_ALIVE</name>
              <description>keep UA33PC_EN alive for usb suspend</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWC_UAPC_EN</name>
              <description>enable USBPHY power cut
UA33PC_EN = PWC_UAHV_ALIVE | PWC_UAPC_EN
UA10PC_EN = PWC_UAPC_EN</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_ANA_EN</name>
              <description>1: enable usb aphy lv2hv, hv2lv check for otg</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss_scaledown_mode</name>
              <description>use scaled-down timing values for usb, resulting in faster simulations</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>suspend_wak_msk</name>
              <description>set 0 to mask usb suspendm(keep 1) at normal state
after receiving usb suspend interrupt, set this bit to 1 to enable resume(from suspend) wake event</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>z0_tune_en</name>
              <description>Zo_Tune , 45Ωauto calibration(Port-1 only)
0: Zo_Tune disable
1: Zo_Tune enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ua_lv2hv_en</name>
              <description>enable usb comparator l2h level shifter</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwc_uahv_en</name>
              <description>enable usb comparator 3.3v power cut</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fs_comp_en</name>
              <description>enable usb full-speed differential comparator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
