Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_UPLL_CTRL1</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x801AAC16</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>upll_ckref_sel</name>
              <description>ECO, REG_CKREF_SEL for usbphy, reset default 1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upll_cmu_lf_r</name>
              <description>Resistance of loop filter, adjust for PLL bandwidth
000: 3.1KΩ ,    001: 6.1KΩ ,
010: 9.2KΩ ,    011: 12.2KΩ,
100: 15.2KΩ,   101: 18.2KΩ,
110: 21.3KΩ,   111: 24.3KΩ</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upll_cmu_icp</name>
              <description>Charge-Pump current, adjust for PLL bandwidth
00: 5uA
01: 10uA
10: 15uA
11: 20uA</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upll_cmu_big_kvco</name>
              <description>Control Kvco of CCO, adjust for bandwidth &amp; jitter
0: Smaller KVCO
1: Larger KVCO
Kvco(Hz/V): the frequency change per 1V of CCO</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upll_cmu_ckrdy</name>
              <description>PLL480M clock output after ∆T for waiting 480MHz clock ready, ∆T:
000: 21*TPLLCKIN,    001: 22*TPLLCKIN
010: 25*TPLLCKIN,    011: 27*TPLLCKIN
100: 210*TPLLCKIN,   101: 212*TPLLCKIN
110: 216*TPLLCKIN,   111: 3*216*TPLLCKIN
TPLLCKIN: period of PLLCKIN</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upll_cmu_ckrdy_bypass</name>
              <description>Bypass the time delay of CKRDY
1: Bypass CKRDY
0: PLL480M clock output after ∆T
∆T: delay time, refer to REG_CMU_CKRDY</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upll_cmu_div_cyc</name>
              <description>Pulse width of divider output clock, adjust for PI monotonic phase transfer
0: 3/480e6 cycle is logic 1
1: 6/480e6 cycle is logic 1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upll_cmu_cco_sel</name>
              <description>1: VCO mode
0: CCO mode</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upll_cmu_prediv</name>
              <description>Division-ratio of pre-divider for PLL clock in
11: fPLLCKIN pre-divided-by-8
10: fPLLCKIN pre-divided-by-4
01: fPLLCKIN pre-divided-by-2
00: fPLLCKIN pre-divided-by-1
fPLLCKIN: frequency of PLLCKIN</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upll_n_pll_top</name>
              <description>(n+2) divider's divisor</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DSS_CTRL</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dss_rstn</name>
              <description></description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dss_wire_sel</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dss_speed_en</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dss_ro_sel</name>
              <description></description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dss_data_in</name>
              <description></description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DSS_OUT</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dss_out_sel</name>
              <description>0: select lvt dss
1: select uhvt dss</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dss_wsort_go</name>
              <description></description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>dss_ready</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>dss_data_out</name>
              <description></description>
              <bitRange>[19:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PLL_CTRL1</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000D040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>opt_ign_pll_off_wlbt</name>
              <description>option for pll ignore wlbt req off , it always on</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>opt_ign_pll_off_sys</name>
              <description>option for pll ignore sys req off , it always on</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DIV_CYC</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CKRDY</name>
              <description></description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CKRDY_BYPASS</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_LPF_BG</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_POW_BG</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_ADC_CLK_EN</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_AFE_CLK_EN</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_CLK_EN</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SYS1_CLK_EN</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SYS0_CLK_EN</name>
              <description>Note,sys0 gating is in digital domain</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
