Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LDO_REG</name>
      <baseAddress>0x41000100</baseAddress>
      <size>0x00000080</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000080</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_TEST_KEY_REG</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ext_swr_gpio_pd_set</name>
              <description>Set extenal swr gpio pull dn</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ext_swr_gpio_pu_set</name>
              <description>Set extenal swr gpio pull up</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ext_swr_delay</name>
              <description>External swr power stable time
2'b00: 750us
2'b01: 1ms
2'b10: 1.5ms
2'b11: 2ms</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ext_swr_ct</name>
              <description>1: External swr can be controller by gpio
0: External swr has no controlled pin</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ldo_delay</name>
              <description>1:Internal core ldo will be enable after chip reset , delay 3ms
0:NO extra delay applied</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dcore_ext_swr</name>
              <description>1:use external swr for core power
0:use internal LDO for core power</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BG_CTRL</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000492</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_BG_R1_tune</name>
              <description></description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BG_R2_tune</name>
              <description></description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BG_VR1200_tune</name>
              <description></description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BG_CURRENT</name>
              <description></description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_2M_OSC_CTRL</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_POW_2MOSC_FASTSET</name>
              <description>// [RF][2MOSC] REG_CTRL: enable fastset control</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_POW_2MOSC</name>
              <description>// [RF][2MOSC] 1'b1 : enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_2MOSC_RCAL</name>
              <description>// [RF][2MOSC] adjust 2M osc frequency. Max freq:6'b111111</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AONLDO</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000BA870</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dmy_3</name>
              <description>// [REGU][AONLDO] dummy</description>
              <bitRange>[25:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POR_CORE_FORCE</name>
              <description>POR_CORE_FORCE</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_COREPOR</name>
              <description>EN_COREPOR</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POR_VD33_FORCE</name>
              <description>POR_VTH_FORCE</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_POR_VTH</name>
              <description>EN_POR_VTH</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POR33_BG_VTHLSEL</name>
              <description>POR33_BG_VTHLSEL; 1:VREF=2.2V; 0:VREF=2.0V</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POR33_BG_VTHHSEL</name>
              <description>POR33_BG_VTHHSEL; 1:VREF=2.5V; 0:VREF=2.3V</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POR33_BG_FORCE</name>
              <description>POR33_BG_FORCE</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_POR33_BG</name>
              <description>EN_POR33_BG</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POR_AON_FORCE</name>
              <description>POR_AON_FORCE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_AONPOR</name>
              <description>EN_AONPOR</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dmy_4</name>
              <description>// [REGU][AONLDO] dummy</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_sleep_l</name>
              <description>Enable LDO09H sleep mode
0 : disable (default)
1 : enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AONLDO_VOSEL_H</name>
              <description>AONLDO09 voltage select
vref=0.540V / 0.475V
---------------------------
0000: 0.631V 0.556V
0001: 0.681V 0.600V
0010: 0.713V 0.628V
0011: 0.749V 0.659V
0100: 0.788V 0.694V
0101: 0.809V 0.712V
0110: 0.831V 0.732V
0111: 0.855V 0.753V
1000: 0.880V 0.775V
1001: 0.906V 0.798V
1010: 0.935V 0.823V
1011: 0.965V 0.850V
1100: 0.997V 0.878V
1101: 1.031V 0.908V
1110: 1.068V 0.940V
1111: 1.107V 0.975V</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dmy_5</name>
              <description>// [REGU][AONLDO] dummy</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LV_POR_VREF_SEL</name>
              <description>LV_POR VREF
0 (default) VREF = 0P600V
1 VREF = 0P450V</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AONLDO_VREF_SEL</name>
              <description>AONLDO VREF_SEL
0 (default) VREF = 0P540V
1 VREF = 0P475V</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOD</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000B0F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_BOD_R_en</name>
              <description>// 0: disable BOD
// 1: enable BOD</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BOD_R</name>
              <description>00000:3.325
00001:3.305
00010:3.255
00011:3.215
00100:3.175
00101:3.115
00110:3.055
00111:3.005
01000:2.956
01001:2.906
01010:2.866
01011:2.816
01100:2.776
01101:2.716
01110:2.666
01111:2.616
10000:2.556
10001:2.507(Default)
10010:2.457
10011:2.407
10100:2.357
10101:2.307
10110:2.267
10111:2.207
11000:2.148
11001:2.098
11010:2.048
11011:1.998
11100:1.948
11101:1.889
11110:1.829
11111:1.65</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BOD_F_d</name>
              <description>// dummy</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BOD_F</name>
              <description>00000:3.325
00001:3.305
00010:3.255
00011:3.215
00100:3.175
00101:3.115
00110:3.055
00111:3.005
01000:2.956
01001:2.906
01010:2.866
01011:2.816
01100:2.776
01101:2.716
01110:2.666
01111:2.616
10000:2.556
10001:2.507
10010:2.457
10011:2.407
10100:2.357
10101:2.307
10110:2.267
10111:2.207
11000:2.148
11001:2.098
11010:2.048
11011:1.998(Default)
11100:1.948
11101:1.889
11110:1.829
11111:1.65</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LDO_CORE</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000143E2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>reg_dmy_ldo_L</name>
              <description>// [REGU][LDO] REG_CTRL
//Dummy reg</description>
              <bitRange>[19:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_feedback_select</name>
              <description>0: feedback from AVDD_0P9H_LDO_OUTPUT_PAD
1: feedback from AVDD_0P9H_LDO_VOFB</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_ssok_L</name>
              <description>// [REGU][LDO] REG_CTRL
// soft-start PWRMOS control
// 0: medium PWRMOS (default)
// 1: large PWRMOS</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_diode3_L</name>
              <description>// [REGU][LDO] REG_CTRL
// PGATE diode3 clamp
// 0: disable
// 1: enable (default)</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_diode_L</name>
              <description>// [REGU][LDO] REG_CTRL
// PGATE diode2 clamp
// 0: disable (default)
// 1: enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_buffertype_sel_L</name>
              <description>// [REGU][LDO] REG_CTRL
// Buffer type select
// 0: P-type buffer for 3.3V PWR (default)
// 1: N-type buffer for 1.8V PWR</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dmy_load</name>
              <description>// [REGU][LDO] REG_CTRL
// LDO dmy load controll
// [1]dmy load
// 1: enable 
// 0: disable (default)
// [0] light dmy load
// 1: enable 
// 0: disable (default)</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_itail_half_en_L</name>
              <description>// [REGU][LDO] REG_CTRL
// Half tail current controll
// 0: normal tail current (default)
// 1: half tail current</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_standby_L</name>
              <description>// [REGU][LDO] REG_CTRL
// [0] Iq controll
// 0: Normal Iq (default)
// 1: Standby Iq
// [1] pwrmos controll
// 0: Normal pwrmos (default)
// 1: Standby pwrmos</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_diode_L</name>
              <description>// [REGU][LDO] REG_CTRL
// PGATE diode1 clamp
//0:disable
//1:enable (default)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>voadj_L</name>
              <description>// [REGU][LDO] REG_CTRL
// LDO VOSEL
// 0000, 0001, 0010, 0011: 648.2mV, 681.2mV, 714.0mV, 745.9mV
// 0100, 0101, 0110, 0111: 776.2mV, 809.1mV, 839.6mV, 872.5mV
// 1000 (default), 1001, 1010, 1011: 901.9mV, 933.4mV, 967.2mV, 996.1mV
// 1100, 1101, 1110, 1111: 1026.7mV, 1059.2mV, 1085.0mV, 1112.1mV</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pd_regu_L</name>
              <description>// [REGU][LDO_UART] REG_CTRL
// PowerDown CTRL
// 0: normal-Mode(default)
// 1: power-down Mode 
Note: 
This field is also controlled by syson pmc .
When mldo_tmode is assert , pmc controller is not active</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_pc_bt_L</name>
              <description>// [REGU][LDO] REG_CTRL
// PWRCUT enable
// 0: LDO-Mode (default)
// 1: PWRCUT-Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_CTRL</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_DMY_L</name>
              <description>bit[8:7] -- 00: POR_AON; 01: RSTB_BOD_RESET; 10: RSTB_LV; 11:POR_OFF
bit[6]    -- 1: select CLK_OSC2M, CLK_OSC32K, CLK_OSC128K
  (watch REG_MUX_SEL_128K, REG_MUX_SEL_OSC)
  0: select POR_AON, RSTB_BOD_RESET, RSTB_LV,POR_OFF</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_APMC_STA</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cur_sts_val</name>
              <description>current regu status</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cur_instr</name>
              <description>regu pmc current instruction code</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_APMC_VEC</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cur_vec</name>
              <description>regu pmc all intr vector</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_APMC_ISR</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cur_isr</name>
              <description>regu pmc current processing isr, one hot</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ALDO_SYS_CTRL</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x72802200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>volt_code1_aldo</name>
              <description>Aon LDO code1 , which indicate 0.8v</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>volt_code0_aldo</name>
              <description>Aon LDO code0 , which indicate 0.7v</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>volt_code0_mldo</name>
              <description>Mem LDO code0 , which indicate 1.8v</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vdec_step</name>
              <description>volt decrease step , unit in 100K cycle, acture value is this value + 1
Note: this is common for all LDO and SWR</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vinc_step</name>
              <description>volt decrease step , unit in 100K cycle, acture value is this value + 1
Note: this is common for all LDO and SWR</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>volt_pwm_abn</name>
              <description>pwm volt adject abnormal statue .
When happen , it is means current voltage is higher than request in a rising commond, same as falling case.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>volt_pfm_abn</name>
              <description>same as [7]</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>volt_cldo_abn</name>
              <description>same as [7]</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>volt_aldo_abn</name>
              <description>same as [7]</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CLDO_VOLT_CTRL</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000B830</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>volt_code3_cldo</name>
              <description>Core LDO code3 , which indicate 1.0v</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>volt_code2_cldo</name>
              <description>Core LDO code2 , which indicate 0.9v</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>volt_code1_cldo</name>
              <description>Core LDO code1 , which indicate 0.8v</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>volt_code0_cldo</name>
              <description>Core LDO code0 , which indicate 0.7v , used in power cut mode(not used)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_REGU_PMC_SP_UP</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00383535</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>apmc_sp2</name>
              <description>Start Point for ST6 up</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>apmc_sp1</name>
              <description>Start Point for ST5 up</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>apmc_sp0</name>
              <description>Start Point for ST3/ST4 up (ST3 not support)</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
