Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_REGU_PMC_SP_DN</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00514D49</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>apmc_sp5</name>
              <description>Start Point for ST2 dn  , noused</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>apmc_sp4</name>
              <description>Start Point for ST4/ST3 dn</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>apmc_sp3</name>
              <description>Start Point for ST5 dn</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DEBUG</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>adbg_regu</name>
              <description>REGU interface debug</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x7E016803</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_opt_dmy</name>
              <description></description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[27:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>por_off_dbc_fen</name>
              <description>Enable POR_OFF debounce</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>por_off_dbc_cyc</name>
              <description>POR_OFF debounce cycle , base in 100K clock period</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_prg_dly</name>
              <description>regu_pmc programmable delay value
0: 100us
1: 500us
2: 1ms
3: 2ms
4: 10ms
5: 50ms
6: 100ms
7: 200ms</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mldo_stl</name>
              <description>mem LDO power on stable wait time
00: 200us
01: 500us
10: 1ms
11: 2ms</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cldo_force_dml_off</name>
              <description>Force core ldo dummy load off , used when pc mode
1: force CLDO dummy load off , regu pmc will wirte this when enter pc mode
0: release</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tmode_mldo</name>
              <description>3318 LDO enter testmode , and register setting will not controlled by pmc</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>opt_por_dis</name>
              <description>option to disable POR for power saving when enter DSLP
[0]: BOD , 1:disable when DSLP , 0:enable
[1]: CORE_POR
[2]: V33_POR_BG
[3]: V33_POR_VTH</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>osc4m_ign_volt</name>
              <description>Options if osc4m can auto require voltage , disable it may speedup reponse time when system never goto 0.7v
0. osc4m will send volt areq when osc4m enable or disable
1. osc4m never req volt change , make sure , system voltage will never goto 0.7v
Note: RL6973 never goto 0.7v, fix 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>opt_en_slp_dummy</name>
              <description>option for enable swr dummy load to speed up when pfm voltage falling.
Default not enable , using a programmble delay to wait</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>opt_en_wak_dummy</name>
              <description>option for enable swr dummy load to speed up when pfm -&gt; pwm.
if opt_wait_mode is 0 , this bit has no use</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>opt_ign_mode</name>
              <description>option for ignore regu mode_l wait when pfm -&gt; pwm.
default not wait as usual</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SWR_REG</name>
      <baseAddress>0x41000180</baseAddress>
      <size>0x00000080</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000080</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_ANAPARSW_MAC_ON_0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x94ED98D5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PFMCMP_IQ</name>
              <description>PFM comparator bias,
0: 50nA 1:250nA</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_HLOAD</name>
              <description>Enable Heavy load counter</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OFF_END_SEL</name>
              <description>COT off time controlled by,
0: ZCD 1: min off time</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_MINOFF_L</name>
              <description>0:normal current
1:increase OCP cmp current</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COT_I_L</name>
              <description>COT ON Current
00:150nA
01:150nA+100nA
10:150nA+150nA
11:150nA+250nA</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREFPFM_L</name>
              <description>SWR/LDO
SEL &lt;93&gt;=0 &lt;93&gt;=1
0000 0.495 0.458
0001 0.654 0.610
0010 0.707 0.662
0011 0.760 0.712
0100 0.795 0.746
0101 0.848 0.797
0110 0.883 0.831
0111 0.954 0.899
1000 1.042 0.984
1001 1.131 1.069
1010 1.219 1.153
1011 1.255 1.188
1100 1.308 1.238
1101 1.343 1.272
1110 1.414 1.340
1111 1.503 1.425</description>
              <bitRange>[25:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Force_ZCD_Bias</name>
              <description>0:ZCD bias on after SS
1:ZCD bias on when ZCD enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZCD_SDZ_L</name>
              <description>Increase ZCD delay cell</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_zcdc_H</name>
              <description>00:0.1u
01:0.2u(PFM)
10:0.7u(PWM)
11:0.8u</description>
              <bitRange>[18:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>POW_ZCD_L</name>
              <description>Enable ZCD</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCP_L1</name>
              <description>PWM current
(A)                PFM
current
(A)                mP   
000    0.533                          0.105                               
001    0.580                          0.145                               
010    0.630                          0.185                               
011    0.680                          0.223                               
100    0.730                          0.263                               
101    0.780                          0.303                               
110    0.830                          0.342                               
111    0.890                          0.290(VIN/10)</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POWOCP_L1</name>
              <description>POWOCP_L1=1=&gt; enable over current protection</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAW_FREQ_L</name>
              <description>0000     458.0k       
0001     680.2k       
0010     898.9k       
0011     1.113M       
0100     1.321M       
0101     1.522M       
0110     1.716M       
0111     1.902M       
1000     2.087M       
1001     2.258M       
1010     2.426M       
1011     2.582M       
1100     2.743M       
1101     2.888M       
1110     3.035M       
1111     3.165M</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>reg_bypass_L</name>
              <description>1:bypass SSR latch</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPWM_L1</name>
              <description>FPWM_L1 = 1 =&gt;
force PWM
FPWM_L1 = 0 =&gt;
force PFM</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STD_L1</name>
              <description>STD_L1&lt;1:0&gt;  time
750u
1.5m
10   3m
11   6m</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VOL_L1</name>
              <description>VREF 0.6 0.635 0.835 0.865
Code VOUT VOUT VOUT VOUT
1111 1.028571 1.088571 1.431429 1.482857
1110 1 1.058333 1.391667 1.441667
1101 0.972973 1.02973 1.354054 1.402703
1100 0.947368 1.002632 1.318421 1.365789
1011 0.935065 0.98961 1.301299 1.348052
1010 0.923077 0.976923 1.284615 1.330769
1001 0.911392 0.964557 1.268354 1.313924
1000 0.9 0.9525 1.2525 1.2975
0111 0.888889 0.940741 1.237037 1.281481
0110 0.878049 0.929268 1.221951 1.265854
0101 0.86747 0.918072 1.207229 1.250602
0100 0.847059 0.896471 1.178824 1.221176
0011 0.827586 0.875862 1.151724 1.193103
0010 0.808989 0.85618 1.125843 1.166292
0001 0.791209 0.837363 1.101099 1.140659
0000 0.774194 0.819355 1.077419 1.116129</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ANAPARSW_MAC_ON_1</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x888966A0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SN_N_L</name>
              <description>NGATE NMOS driving</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP_N_L</name>
              <description>NGATE PMOS driving</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SN_P_L</name>
              <description>PGATE NMOS driving</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP_P_L</name>
              <description>PGATE PMOS driving</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vo_dischg_pwm_h</name>
              <description>`</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_mode_predriver</name>
              <description>1:3 level predriver</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_adjsldo_L</name>
              <description>0000     1.043       
0001     1.075       
0010     1.108       
0011     1.143       
0100     1.180       
0101     1.220       
0110     1.263       
0111     1.286       
1000     1.309       
1001     1.333       
1010     1.359       
1011     1.385       
1100     1.412       
1101     1.444       
1110     1.469       
1111     1.500</description>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_ldor_L</name>
              <description>1:ldos res short</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_Force</name>
              <description>0: PWM bias enabled only at PWM mode
1: Force PWM bias enable when in PWM/PFM mode</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PFM_PD_RST</name>
              <description>1: When leave PFM mode, COT logic is reset</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_PFM_RSTB</name>
              <description>When into PFM, VC is,
0: clamped (bit 40 also =1) 1. floating</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PFM_IN_SEL</name>
              <description>Power MOS into PFM when PFM CTRL,
0: rising 1: falling</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_RSTB</name>
              <description>Before SS VC is, 0: pulled low 1: floating</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPWMDELAY</name>
              <description>1:PFM&lt;=&gt;PWM
PFM/PWM change by using DFF(CKMOD)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENFPWMDELAY_H</name>
              <description>1:PFM=&gt;PWM delay
PWM enable and wait one clock cycle then PFM off</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_mos_half_L</name>
              <description>1:power mos half</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Current_Sense_MOS</name>
              <description>1: current sensing MOS for large OC current</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ANAPARSW_MAC_ON_2</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00924F5B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HLOAD_CUNT_SEL</name>
              <description>Dummy</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HLOAD_PLUS</name>
              <description>Dummy</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDIV_PFM_SEL</name>
              <description>Dummy</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VOFB_SEL</name>
              <description>0:Feedback from REGU Internal PAD for 1.25V/1.35V
1:Feedback from External PAD for 0.9V/1.0V</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_VREF_SEL</name>
              <description>00:VREF=0.600
01:VREF=0.635
10:VREF=0.835
11:VREF=0.865</description>
              <bitRange>[27:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_SWR_ZCD_CTRL</name>
              <description>// SWR ZCD CTRL control
&lt;1&gt;1:double current 
&lt;0&gt;1'b1: force in CCM/DCM boundary mode(default), 1'b0 : no boundary</description>
              <bitRange>[25:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BG_VR1200_tune</name>
              <description>BG電壓調整</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_R2_tuen</name>
              <description>BG R2電阻調整</description>
              <bitRange>[20:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_R1_tune</name>
              <description>BG R1電阻調整</description>
              <bitRange>[17:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZCD_Ioffset_b</name>
              <description>00=&gt;+600nA
01=&gt;+400nA
10=&gt;+200nA
11=&gt;0nA</description>
              <bitRange>[14:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>reg_prss_H</name>
              <description>0:default
1:res+cap improve psrr</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R2_L1</name>
              <description>00 =&gt; 0.4M
01 =&gt; 0.3M
10 =&gt; 0.2M
11 =&gt; 0.1M</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3_L1</name>
              <description>00 =&gt; 1.59p
01 =&gt; 3.2p
10 =&gt; 4.76p
11 =&gt; 6.34p</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1_L1</name>
              <description>00 =&gt; 1.03p
01 =&gt; 2.06p
10 =&gt; 3.1p
11 =&gt; 4.12p</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>External_clk_sel</name>
              <description>0:internal clock
1:external clock</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_bg_current_L</name>
              <description>00:23.9n
01:54.6n
10:117.8n</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BG_ANA_L</name>
              <description>1:External SWR BG switch on</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_BG_DIG_L</name>
              <description>1:Local SWR BG switch on</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_VC_CLAMP_SEL_L</name>
              <description>0:unity gain feedback clamp VC=VREF                1.orignal clamp(roll back option)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ANAPARSW_MAC_ON_3</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x001FD8F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>null0</name>
              <description>NO use in RL6973</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD1_VL_SEL</name>
              <description>NO use in RL6973</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD1_VH_SEL</name>
              <description>NO use in RL6973</description>
              <bitRange>[18:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD0_VL_SEL</name>
              <description>dummy</description>
              <bitRange>[13:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD0_VH_SEL</name>
              <description>dummy</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BOD</name>
              <description>dummy</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
