Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_ANAPARSW_MAC_ON_4</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>null1</name>
              <description>NO use in RL6973</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ANAPARSW_MAC_ON_5</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>null2</name>
              <description>NO use in RL6973</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ANAPARSW_MAC_OFF_0</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x4274FAAA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDZN_L</name>
              <description>Nonoverlap delay cell for NMOS</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_autozcd_L</name>
              <description>0:register 1:10000</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_vofb_sel</name>
              <description>0:vo15
1:LX_SPS</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TBOX_L1</name>
              <description>TBOX_L1&lt;1:0&gt; output
00    CKOVER/RAMPOVER
01
NI/PI
10      CKSS/SSOVER
11
i/NIOFF_H</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENOCPMUX_L</name>
              <description>1:OCP signal control by MUX
0:OCP signal control by I</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Force_LDOS</name>
              <description>1:LDOS force on</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VO_DISCHG</name>
              <description>1:VO with 1mA discharge</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_OC_clamp</name>
              <description>0:OC clamp with P/NMOS
1:OC clamp with PMOS</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MINOFF_LIQ</name>
              <description>0:Min. off circuit always on
1:Min. off circuit pulse on</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MINON_LIQ</name>
              <description>0:Min. on circuit always on
1:Min. on circuit pulse on</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_AUTO_L</name>
              <description>1:auto PFM/PWM
0:register control</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ARENB_H</name>
              <description>1:off
0:on</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NO_OFFTIME_L</name>
              <description>0:from min OFF time(PFM COT)
1:always on</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_ON_END_L</name>
              <description>1:EN min OFF time (PFM COT)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCOT_L</name>
              <description>1:PFM COT</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_clk_sel</name>
              <description>00:out of phase CKSS
01:out of phase PWM_CTRIL
10:ckout
11:HG</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_type_L</name>
              <description>1:type3 0:type2</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>R3_L1</name>
              <description>00 =&gt; 36k
01 =&gt; 30k
10 =&gt; 24k
11 =&gt; 24k</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>null7</name>
              <description></description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>R1_L1</name>
              <description>00 =&gt; 900k
01 =&gt; 720k
10 =&gt; 900k
11 =&gt; 1080k</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>null6</name>
              <description></description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C2_L1</name>
              <description>00 =&gt; 13f
01 =&gt; 26f
10 =&gt; 39f
11 =&gt; 41f</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>null5</name>
              <description></description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ANAPARSW_MAC_OFF_1</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000C0C5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>null9</name>
              <description>dummy</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>null8</name>
              <description>dummy</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_nmos_off_L</name>
              <description>0:normal
1:NMOS always off</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>reg_mux_PI_L</name>
              <description>1:PI (original)
0:i</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_PWM_CTRL_L</name>
              <description>0:internal PWM
1:external PWM</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENSR_L</name>
              <description>1:with SSR latch</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDZP_L</name>
              <description>Nonoverlap delay cell for PMOS</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SWR_DIG_OCP</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPS_DIG_OCP_CKE</name>
              <description>SPS OCP clock enable,used as function enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPS_DIG_OCP_THD</name>
              <description>SPS OCP event threshold</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPS_DIG_OCP_WND</name>
              <description>SPS OCP time window</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SWR_DIG_ZCD</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000110</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPS_DIG_ZCD_FEN</name>
              <description>zcd function enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPS_DIG_ZCD_DBG</name>
              <description>The acture zcd code used for SPS core</description>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPS_DIG_ZCD_MODE</name>
              <description>SPS ZCD SW mode enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPS_DIG_ZCD_AUTO</name>
              <description>SPS HW ZCD code auto count function enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPS_DIG_ZCD_CODE</name>
              <description>SPS_DIG_ZCD_CODE,this is used for SW mode</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SWR_CTRL</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pwm_load</name>
              <description>SWR pwm loading(scan value is 0)
1:heavy
0:light</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>swr_mode_src</name>
              <description>Select SWR mode ctrl source to determine SWR parameter
1: from Analog mode flag , which is 0x50[0]
0: from D-&gt;A mode control bit (Note , scan value is 1:PWM)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCORE_MODE_L</name>
              <description>SWR mode flag
1: PWM
0: PFM</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PARAM_PFM</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00002808</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>reg_zcdc_H_pfm</name>
              <description>00:0.1u
01:0.2u(PFM)
10:0.7u(PWM)
11:0.8u</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAW_FREQ_L_pfm</name>
              <description>0000     458.0k       
0001     680.2k       
0010     898.9k       
0011     1.113M       
0100     1.321M       
0101     1.522M       
0110     1.716M       
0111     1.902M       
1000     2.087M       
1001     2.258M       
1010     2.426M       
1011     2.582M       
1100     2.743M       
1101     2.888M       
1110     3.035M       
1111     3.165M</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_mos_half_L_pfm</name>
              <description>1:power mos half</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SWR_ZCD_CTRL_pfm</name>
              <description>// SWR ZCD CTRL control
&lt;1&gt;1:double current 
&lt;0&gt;1'b1: force in CCM/DCM boundary mode(default), 1'b0 : no boundary</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZCD_Ioffset_b_pfm</name>
              <description>00=&gt;+600nA
01=&gt;+400nA
10=&gt;+200nA
11=&gt;0nA</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_prss_H_pfm</name>
              <description>0:default
1:res+cap improve psrr</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_nmos_off_L_pfm</name>
              <description>0:normal
1:NMOS always off</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PARAM_PWML</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00002808</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>reg_zcdc_H_pwml</name>
              <description>00:0.1u
01:0.2u(PFM)
10:0.7u(PWM)
11:0.8u</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAW_FREQ_L_pwml</name>
              <description>0000     458.0k       
0001     680.2k       
0010     898.9k       
0011     1.113M       
0100     1.321M       
0101     1.522M       
0110     1.716M       
0111     1.902M       
1000     2.087M       
1001     2.258M       
1010     2.426M       
1011     2.582M       
1100     2.743M       
1101     2.888M       
1110     3.035M       
1111     3.165M</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_mos_half_L_pwml</name>
              <description>1:power mos half</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SWR_ZCD_CTRL_pwml</name>
              <description>// SWR ZCD CTRL control
&lt;1&gt;1:double current 
&lt;0&gt;1'b1: force in CCM/DCM boundary mode(default), 1'b0 : no boundary</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZCD_Ioffset_b_pwml</name>
              <description>00=&gt;+600nA
01=&gt;+400nA
10=&gt;+200nA
11=&gt;0nA</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_prss_H_pwml</name>
              <description>0:default
1:res+cap improve psrr</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_nmos_off_L_pwml</name>
              <description>0:normal
1:NMOS always off</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PARAM_PWMH</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00002808</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>reg_zcdc_H_pwmh</name>
              <description>00:0.1u
01:0.2u(PFM)
10:0.7u(PWM)
11:0.8u</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAW_FREQ_L_pwmh</name>
              <description>0000     458.0k       
0001     680.2k       
0010     898.9k       
0011     1.113M       
0100     1.321M       
0101     1.522M       
0110     1.716M       
0111     1.902M       
1000     2.087M       
1001     2.258M       
1010     2.426M       
1011     2.582M       
1100     2.743M       
1101     2.888M       
1110     3.035M       
1111     3.165M</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_mos_half_L_pwmh</name>
              <description>1:power mos half</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SWR_ZCD_CTRL_pwmh</name>
              <description>// SWR ZCD CTRL control
&lt;1&gt;1:double current 
&lt;0&gt;1'b1: force in CCM/DCM boundary mode(default), 1'b0 : no boundary</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZCD_Ioffset_b_pwmh</name>
              <description>00=&gt;+600nA
01=&gt;+400nA
10=&gt;+200nA
11=&gt;0nA</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_prss_H_pwmh</name>
              <description>0:default
1:res+cap improve psrr</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_nmos_off_L_pwmh</name>
              <description>0:normal
1:NMOS always off</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PWM_VREF</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pwm_vref_sel_snoz</name>
              <description>For snooze mode power , it use pwm 0.8v and CLDO pc mode , to select PWM 0.8v , it must change vref</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwm_vref_sel_norm</name>
              <description>PWM default vref</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ZCD_ITUNE</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>zcd_itune_sel</name>
              <description>Select itune code source
1: from software config
0: auto by regu self</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_zcd_itune</name>
              <description>Software config zcd itune code</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>zcd_itune_out_l</name>
              <description>SWR output ZCD itune code</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
