Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WLAFE_REG</name>
      <baseAddress>0x40801480</baseAddress>
      <size>0x00000070</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000070</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_ANAPAR_POW_MAC_0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000C80</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wl_bt_req_pll_on</name>
              <description>1:enable pll 320m</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wlafe_pof_sel</name>
              <description>Option to power off WLAFE
1: enable ,power off wlafe when bt&amp;wl request off
0: disable ,keep wlafe power on when  bt&amp;wl request off</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wlafe_iso_sel</name>
              <description>Option to enable isolation of wlafe when power off WLAFE
1: enable ,0x00[7]will be written 1 when wlafe power off
0: disable ,0x00[7]will keep 0 when wlafe power off
hw tie1 in RL6955</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hw_en_wlafe_2regu</name>
              <description>control 3.3V power reset of wl afe, need level shift to 3.3V by regu
no use in RL6955</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hw_en_wlafe</name>
              <description>core power reset of wl afe
no use in RL6955</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO_WLAFE</name>
              <description>isolation signal</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hw_en_wlrf_2regu</name>
              <description>control 3.3V power reset of wl rf, need level shift to 3.3V by regu</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hw_en_wlrf</name>
              <description>core power reset of wl rf</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pow_ldo_rssi_adc</name>
              <description>Power on ldo for rssi adc</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pow_ldo_adc</name>
              <description>Power on ldo for adc</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pow_ldo_dac</name>
              <description>Power on ldo for dac</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pow_pll</name>
              <description>Power on pll</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pow_ldo</name>
              <description>Power on AFE power cut and pll ldo</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ANAPAR_MAC_2</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x08000055</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>r_WLAFE_LDO_ST</name>
              <description>stable time select for WLAFE LDO
2'b00:10us, 2'b01:20us, 2'b10:100us, 2'b11:200us</description>
              <bitRange>[28:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_DBG_SEL_AFE_SDM</name>
              <description>SDM debug selection</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_LDO2PWRCUT_DA</name>
              <description>1 power cut mode 0 ldo mode (DA LDO)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_LDO_DA</name>
              <description>Ldo voltage
00/01/10/11: 0.875V/0.9V/0.95V/1V (DAC LDO)</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VPLUSE_LDO_DA</name>
              <description>For DAC(WL DAC LDO)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_LDO2PWRCUT_AD</name>
              <description>1 power cut mode 0 ldo mode (AD LDO)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_LDO_AD</name>
              <description>Ldo voltage
00/01/10/11: 0.875V/0.9V/0.95V/1V (ADC LDO)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VPLUSE_LDO_AD</name>
              <description>For ADC(WL ADC LDO)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DBG_WLAFE_PMC</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dbg_wlafe_pmc</name>
              <description>debug signal of wlafe_pmc
[31]:pmc_rdy
[30]:powon_req
[29]:powoff_ref
[28]:wlafe_is_power_on
[27]:first_pon_flag
[26]:pmc_timer_en
[25]:|pmc_wem
[24]:|pmc_wd
[23:18]:0
[17]syspll_rdy
[16]:wlafe_en_osc4m
[15]:pmc_wr
[14]:pmc_timer_out
[13]:pmc_wr_done
[12]:wl_power_flag
[11]:bt_power_flag
[10]:wl_pon_gnt
[9]:bt_pon_gnt
[8]:wlbt_pll_rdy
[7]:en_xtal_frv_afe
[6:0]pmc_state</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DBG_WLAFE</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dbg_wlafe_reg</name>
              <description>debug signal of wlafe_reg</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>HW used only , these are for reserved.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ANAPAR_RFC</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000208C7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wlbb_adc_sel</name>
              <description>1:if gnt bt is high,send 0x200 to wlbb as adc data
0:send adc data form afe out directly to wlbb</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_FUNEN_WLRF_SEL</name>
              <description>1: select ANAPOW_RFC_NM as ANAPAR_RFC[7:0],used when RFAFE is active
0: select ANAPOW_RFC_LPS as ANAPAR_RFC[7:0],,used when RFAFE is power off</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAPOW_RFC_LPS</name>
              <description>wlan power rf control</description>
              <bitRange>[18:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>r_rfafe_VIO1833_sel</name>
              <description>IND_VIO1833 output decided by:
1: 1.8V 
0: 3.3V</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAPOW_RFC_NM</name>
              <description>wlan power rf control</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LDO_VPLUSE_SEL</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00020013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>vpluse_sel</name>
              <description>vpluse_ldo output decided by:
1: power on ldo 
0: ctrl reg</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vpluse_cnt</name>
              <description>vpluse_ldo high output delay cycle after pll_ldo set high,default:3(1.5us)</description>
              <bitRange>[16:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vpluse_wait_mcycle</name>
              <description>1: vpluse_ldo_dac and vpluse_ldo_adc pull low should wait more cycle after ldo pull high</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WLRFC_CTRL</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001016</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wlrfc_pwc_en</name>
              <description>1: gen request of wlan rfc power cut
0: gen request of turn off wlan rfc power cut</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iso_wlrfc_en</name>
              <description>Isolation control for wlan rfc
1: isolation
0: attach</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wlrfc_retain_en_type_1</name>
              <description>1 to 0:gen req to restore register in power on flow
0 to 1:gen req to backup register in power on flow
default should be 1,otherwise there be unexpected leakage power when VCC is power off and VCCG is still on</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wlrfc_pwc_sel</name>
              <description>Option to turn off wlrfc pwr cut
1: enable 
0: disable
RL6955: RFC without retention FF. default is 0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wlafe_ckrfc_en</name>
              <description>1: enable WLRFC clock; 0: gated</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wlrfc_save_en_type_2</name>
              <description>enable saving value of retention DFF when wlmac power off or pg,should be assert when reset is high</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>wlrfc_restore_en_type_2</name>
              <description>enable restoring value of retention DFF when wlmac power on,should be assert when reset is high</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>wlrfc_retention_cell_sel</name>
              <description>1:choose retention cell type I(U22 ULP),which is controlled by 0x28[2]
0:choose retention cell type II(RTKM),which is controlled by 0x28[9:8]</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dis_wlbb_ckrfc_en</name>
              <description>the gating control of rfc clk is pta_ckrfc_en|wlbb_ckrfc_en|wlafe_ckrfc_en,and wlbb_ckrfc_en can not be control by register directly in RL6678,add option for top to control wlbb_ckrfc_en
1: disable wlbb_ckrfc_en; 0: enable wlbb_ckrfc_en</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFC_CLK_SEL</name>
              <description>11/10:40M
01:80M
00:160M</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_RFC_PHASE</name>
              <description>80M WLRFC clock phase control</description>
              <bitRange>[17:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_CKDIV_SYNC_1SHOT</name>
              <description>1: sync 40M/80M clock  phase with PLL</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AFE_PMC_PATCH_0</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_dst_state1</name>
              <description>destination pmc state1 for state jump</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_src_state1</name>
              <description>source pmc state1 for state jump</description>
              <bitRange>[23:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_state_jump_en1</name>
              <description>1: when current afe pmc state hit pmc_src_state1, next pmc state will jump to pmc_dst_state1;  0:afe pmc follow old flow</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_dst_state0</name>
              <description>destination pmc state0 for state jump</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_src_state0</name>
              <description>source pmc state0 for state jump</description>
              <bitRange>[7:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_state_jump_en0</name>
              <description>1: when current afe pmc state hit pmc_src_state0, next pmc state will jump to pmc_dst_state0;  0:afe pmc follow old flow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AFE_PMC_PATCH_1</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_dst_state3</name>
              <description>destination pmc state3 for state jump</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_src_state3</name>
              <description>source pmc state3 for state jump</description>
              <bitRange>[23:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_state_jump_en3</name>
              <description>1: when current afe pmc state hit pmc_src_state3, next pmc state will jump to pmc_dst_state3;  0:afe pmc follow old flow</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_dst_state2</name>
              <description>destination pmc state2 for state jump</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_src_state2</name>
              <description>source pmc state2 for state jump</description>
              <bitRange>[7:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_state_jump_en2</name>
              <description>1: when current afe pmc state hit pmc_src_state2, next pmc state will jump to pmc_dst_state2;  0:afe pmc follow old flow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AFE_PMC_PATCH_2</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_dst_state5</name>
              <description>destination pmc state5 for state jump</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_src_state5</name>
              <description>source pmc state5 for state jump</description>
              <bitRange>[23:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_state_jump_en5</name>
              <description>1: when current afe pmc state hit pmc_src_state5, next pmc state will jump to pmc_dst_state5;  0:afe pmc follow old flow</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_dst_state4</name>
              <description>destination pmc state4 for state jump</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_src_state4</name>
              <description>source pmc state4 for state jump</description>
              <bitRange>[7:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_state_jump_en4</name>
              <description>1: when current afe pmc state hit pmc_src_state4, next pmc state will jump to pmc_dst_state4;  0:afe pmc follow old flow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AFE_PMC_PATCH_3</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_dst_state7</name>
              <description>destination pmc state7 for state jump</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_src_state7</name>
              <description>source pmc state7 for state jump</description>
              <bitRange>[23:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_state_jump_en7</name>
              <description>1: when current afe pmc state hit pmc_src_state7, next pmc state will jump to pmc_dst_state7;  0:afe pmc follow old flow</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_dst_state6</name>
              <description>destination pmc state6 for state jump</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_src_state6</name>
              <description>source pmc state6 for state jump</description>
              <bitRange>[7:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_state_jump_en6</name>
              <description>1: when current afe pmc state hit pmc_src_state6, next pmc state will jump to pmc_dst_state6;  0:afe pmc follow old flow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
