Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_AFE_PMC_PATCH_4</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00030003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>patch_state1_cmd_info</name>
              <description>*for write command:
[30]:write value [29:25]:write address bit select [24:20]: write address dword select
*for delay command:
[30:20]: delay time, unit is 1 cycle
*for poll command:
[25]:poll value  [24:20]: poll address bit select,poll 0x10
*for jump command:
do nothing</description>
              <bitRange>[30:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state1_rsm_bypass</name>
              <description>bypass the state command for resume flow</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state1_pon_bypass</name>
              <description>bypass the state command for pon flow</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state1_cmd_type</name>
              <description>2'b00: write command;  2'b01:delay command; 2'b10:poll command;2'b11:jump to next state</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state0_cmd_info</name>
              <description>*for write command:
[14]:write value [13:9]:write address bit select [8:4]: write address dword select
*for delay command:
[14:4]: delay time, unit is 1 cycle
*for poll command:
[9]:poll value  [8:4]: poll address bit select,poll 0x10
*for jump command:
do nothing</description>
              <bitRange>[14:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state0_rsm_bypass</name>
              <description>bypass the state command for resume flow</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state0_pon_bypass</name>
              <description>bypass the state command for pon flow</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state0_cmd_type</name>
              <description>2'b00: write command;  2'b01:delay command; 2'b10:poll command;2'b11:jump to next state</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AFE_PMC_PATCH_5</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00030003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>patch_state3_cmd_info</name>
              <description>*for write command:
[30]:write value [29:25]:write address bit select [24:20]: write address dword select
*for delay command:
[30:20]: delay time, unit is 1 cycle
*for poll command:
[25]:poll value  [24:20]: poll address bit select,poll 0x10
*for jump command:
do nothing</description>
              <bitRange>[30:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state3_rsm_bypass</name>
              <description>bypass the state command for resume flow</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state3_pon_bypass</name>
              <description>bypass the state command for pon flow</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state3_cmd_type</name>
              <description>2'b00: write command;  2'b01:delay command; 2'b10:poll command;2'b11:jump to next state</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state2_cmd_info</name>
              <description>*for write command:
[14]:write value [13:9]:write address bit select [8:4]: write address dword select
*for delay command:
[14:4]: delay time, unit is 1 cycle
*for poll command:
[9]:poll value  [8:4]: poll address bit select,poll 0x10
*for jump command:
do nothing</description>
              <bitRange>[14:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state2_rsm_bypass</name>
              <description>bypass the state command for resume flow</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state2_pon_bypass</name>
              <description>bypass the state command for pon flow</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state2_cmd_type</name>
              <description>2'b00: write command;  2'b01:delay command; 2'b10:poll command;2'b11:jump to next state</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AFE_PMC_PATCH_6</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00030003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>patch_state5_cmd_info</name>
              <description>*for write command:
[30]:write value [29:25]:write address bit select [24:20]: write address dword select
*for delay command:
[30:20]: delay time, unit is 1 cycle
*for poll command:
[25]:poll value  [24:20]: poll address bit select,poll 0x10
*for jump command:
do nothing</description>
              <bitRange>[30:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state5_rsm_bypass</name>
              <description>bypass the state command for resume flow</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state5_pon_bypass</name>
              <description>bypass the state command for pon flow</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state5_cmd_type</name>
              <description>2'b00: write command;  2'b01:delay command; 2'b10:poll command;2'b11:jump to next state</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state4_cmd_info</name>
              <description>*for write command:
[14]:write value [13:9]:write address bit select [8:4]: write address dword select
*for delay command:
[14:4]: delay time, unit is 1 cycle
*for poll command:
[9]:poll value  [8:4]: poll address bit select,poll 0x10
*for jump command:
do nothing</description>
              <bitRange>[14:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state4_rsm_bypass</name>
              <description>bypass the state command for resume flow</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state4_pon_bypass</name>
              <description>bypass the state command for pon flow</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state4_cmd_type</name>
              <description>2'b00: write command;  2'b01:delay command; 2'b10:poll command;2'b11:jump to next state</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AFE_PMC_PATCH_7</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00030003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>patch_state7_cmd_info</name>
              <description>*for write command:
[30]:write value [29:25]:write address bit select [24:20]: write address dword select
*for delay command:
[30:20]: delay time, unit is 1 cycle
*for poll command:
[25]:poll value  [24:20]: poll address bit select,poll 0x10
*for jump command:
do nothing</description>
              <bitRange>[30:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state7_rsm_bypass</name>
              <description>bypass the state command for resume flow</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state7_pon_bypass</name>
              <description>bypass the state command for pon flow</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state7_cmd_type</name>
              <description>2'b00: write command;  2'b01:delay command; 2'b10:poll command;2'b11:jump to next state</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state6_cmd_info</name>
              <description>*for write command:
[14]:write value [13:9]:write address bit select [8:4]: write address dword select
*for delay command:
[14:4]: delay time, unit is 1 cycle
*for poll command:
[9]:poll value  [8:4]: poll address bit select,poll 0x10
*for jump command:
do nothing</description>
              <bitRange>[14:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state6_rsm_bypass</name>
              <description>bypass the state command for resume flow</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state6_pon_bypass</name>
              <description>bypass the state command for pon flow</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>patch_state6_cmd_type</name>
              <description>2'b00: write command;  2'b01:delay command; 2'b10:poll command;2'b11:jump to next state</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
