Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>XTAL_REG</name>
      <baseAddress>0x40801400</baseAddress>
      <size>0x00000050</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000050</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANAPAR_POW_XTAL_0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00490000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xtal_bg2hpmod_cyc</name>
              <description>XTAL arb bandgap enable to hp mode delay cycle @4M</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>xmd_done</name>
              <description>xmd change ok status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>xtal_ckrdy</name>
              <description>xtal clock ready status</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>xtal_state</name>
              <description>0 to 1 Enable xtal</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>POW_XTAL</name>
              <description>0 to 1 Enable xtal</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>POW_BG</name>
              <description>Enable BG  (BG for xtal and AFE)  (有option關)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_ON_0</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x008100E7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_SC_INIT</name>
              <description>0: reduce cap, 1: increase cap. (220fF per unit)
[efuse for BT only ] 有外掛電容設全0</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_SC_XO</name>
              <description>1: reduce cap, 0: increase cap. (220fF per unit)
[efuse for BT only ]</description>
              <bitRange>[23:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_SC_XI</name>
              <description>1: reduce cap, 0: increase cap. (220fF per unit)
[efuse for BT only ]</description>
              <bitRange>[16:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_GMN</name>
              <description>GMN: 0~31</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_GMP</name>
              <description>GMP: 0~31</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_ON_1</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFC399C80</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xtal_dummy2</name>
              <description>Reserved for future use.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_AAC_OPCUR</name>
              <description>00: 200nA , 200n/step  
For AAC robust 11</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_VREF_SEL</name>
              <description>Analog AAC VREF, 390mV~700mV, 10mV/step
11000: Vpp 500mV</description>
              <bitRange>[27:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_LPS_DIVISOR</name>
              <description>XTAL LPS clock divider 
0: XTAL/128(40M), 1: XTAL/64</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_CKDIGI_SEL</name>
              <description>1: DIGI CLK from self-bias
0: DIGI CLK from Schmitt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_LPS_CLK</name>
              <description>1: enable XTAL LPS clock 
與anapar_xtal_on[43]都是312.5KHz enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_SCHMITT</name>
              <description>1: enable XTAL SCHMITT</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_LDO_VREF</name>
              <description>(起震前)
111: 1.1V  110: 1.05V  101:1V  100:0.95V
011: 0.9V  010: 0.85V   001: 0.8V  000: 0.75V</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_SEL_TOK</name>
              <description>xtal起振过程
reg value: cycles / 40MHz / 26MHz
000: 2^10 / 0.025m / 0.05
001: 2^11 / 0.05m / 0.1m
010: 2^12 / 0.1m / 0.2m
011: 2^13 / 0.2m / 0.3m
100: 2^14 / 0.4m / 0.6m
101: 2^15 / 0.8m / 1.2m
110: 2^16 / 1.6m / 2.5m
111: 2^17 / 3.2m / 4.9m
xtal mode switch过程
reg value: cycles / 40MHz / 26MHz
000: 2^10 / 0.0125m / 0.025
001: 2^11 / 0.025m / 0.05m
010: 2^12 / 0.05m / 0.1m
011: 2^13 / 0.1m / 0.2m
100: 2^14 / 0.2m / 0.3m
101: 2^15 / 0.4m / 0.6m
110: 2^16 / 0.8m / 1.25m
111: 2^17 / 1.6m / 2.45m</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_DRV_LPS</name>
              <description>LPS enable clock source control, 1:enable, 0: gated
與anapar_xtal_on[51]都是312.5KHz enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_DRV_DIGI</name>
              <description>DIGI enable clock source control, 1:enable, 0: gated</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_DRV_USB</name>
              <description>USB enable clock source control, 1:enable, 0: gated</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_DRV_AFE</name>
              <description>AFE enable clock source control, 1:enable, 0: gated
(for WL AFE PLL)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_DRV_RF2</name>
              <description>RF2 enable clock source control, 1:enable, 0: gated (for BT)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_DRV_RF1</name>
              <description>RF1 enable clock source control, 1:enable, 0: gated (for WL SYN)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_SC_LPS</name>
              <description>0: reduce cap, 1: increase cap. (160fF per unit)
[efuse for BT only ] 若有頻偏再修改</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_ON_2</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000008E9</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_SEL_TOK_FST</name>
              <description>used for HP2NM or NM2HP
xtal起振过程
reg value: cycles / 40MHz / 26MHz
000: 2^10 / 0.025m / 0.05
001: 2^11 / 0.05m / 0.1m
010: 2^12 / 0.1m / 0.2m
011: 2^13 / 0.2m / 0.3m
100: 2^14 / 0.4m / 0.6m
101: 2^15 / 0.8m / 1.2m
110: 2^16 / 1.6m / 2.5m
111: 2^17 / 3.2m / 4.9m
xtal mode switch过程
reg value: cycles / 40MHz / 26MHz
000: 2^10 / 0.0125m / 0.025
001: 2^11 / 0.025m / 0.05m
010: 2^12 / 0.05m / 0.1m
011: 2^13 / 0.1m / 0.2m
100: 2^14 / 0.2m / 0.3m
101: 2^15 / 0.4m / 0.6m
110: 2^16 / 0.8m / 1.25m
111: 2^17 / 1.6m / 2.45m</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BK_BG</name>
              <description>RFTOP BG的 BK开关</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TESTMUX_BG</name>
              <description>RFTOP BG的温度参数设定</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DUMMY</name>
              <description>Dummy control bits</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_BDRF</name>
              <description>Balance dynamic RF for duty cycle</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GM_MANUAL</name>
              <description>Gm manual at EN_XTAL_AAC_DIGI=0</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_AAC_GM</name>
              <description>1: enable xtal aac gm control</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_DRV_IQK_BCN</name>
              <description>IQKPLL enable clock source control, 1:enable, 0: gate</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_DRV_DIGI_DIV2</name>
              <description>IQKPLL enable clock source control, 1:enable, 0: gate</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AAC_MODE</name>
              <description>AAC_MODE for LPS
00: all XOXI cap off
01: cap from XTAL_SC_LPS
10: cap from XTAL_SC_INIT
11: cap from XTAL_SC_XI/XO</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_OFF_0</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xCC0FFF90</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_PDCK_OK_MANU</name>
              <description>1: force PDCK_OK=1 for PDCK manual</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_PDCK_VREF</name>
              <description>1: analog AAC VREF from PDCK digital circuit
0: analog AAC VREF from XTAL_VREF_SEL for BT only mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_SEL_PWR</name>
              <description>1: external 0.9V, 0: internal 0.9V (FIB)</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_PK_SEL_OFFSET</name>
              <description>1: XI Vpk-to-Vpk offset to
00: 0.4V  01: 0.5V  10: 0.6V  11: 0.7V</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_MANU_PK_SEL</name>
              <description>XI Vpk-to-Vpk
00: 0.7V  01: 0.8V  10: 0.9V  11: 1V</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_AACK_PK_MANU</name>
              <description>1: manual for peak detector peak selection</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_AAC_PKDET</name>
              <description>1: enable xtal aac peak detector</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_LDO_OPVB_SEL</name>
              <description>0: OP bias from IBG, 1: OP bias from Res divider</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_LDO_NC</name>
              <description>1: low current normal mode (22C)
0:high current normal mode
(此pin要拉給BT控制)</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_LPMODE</name>
              <description>1: low power mode enable 
22C turn off replica path, RF1 no CLK
RF2 sweep to LPS buf</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DELAY_DIGI</name>
              <description>1: turn on XI/XO Cfix, single side 8pF</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DELAY_USB</name>
              <description>0: short, 1:long</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DELAY_AFE</name>
              <description>0: short, 1:long</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DRV_DIGI</name>
              <description>Driving control of DIGI/LPS clock buffer, 11:large current, 00: small current</description>
              <bitRange>[16:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DRV_USB</name>
              <description>Driving control of USB clock buffer, 11:large current, 00: small current</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DRV_AFE</name>
              <description>Driving control of AFE clock buffer, 11:large current, 00: small current</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DRV_RF2</name>
              <description>Driving control of RF2 clock buffer, 11:large current, 00: small current</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DRV_RF1</name>
              <description>Dummy
由RFC控制</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DRV_RF_LATCH</name>
              <description>1: latch enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_GM_SEP</name>
              <description>0: GMP=GMN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XQSEL_RF_AWAKE</name>
              <description>0: Schmitt trigger, 1:replica INV(for OK0=1)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XQSEL_RF_INITIAL</name>
              <description>0: Schmitt trigger, 1:replica INV(for OK0=0)
22C OK0=0, RF no CLK</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XQSEL</name>
              <description>0: Schmitt trigger, 1:replica INV(for AFE)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GATED_XTAL_OK0</name>
              <description>1:Gated xtal OK0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_OFF_1</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000068</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_EN_LNBUF</name>
              <description>0: separate bias buffer (lower current higher noise)
1: self-bias (higher current lower noise)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_AAC_TIE_MID</name>
              <description>XTAL_ AAC_TIE_MID=1 &amp; EN_XTAL_PDCK_VREF=0 &amp;
using XTAL_VREF_SEL&lt;4:0&gt; for lock detect</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_AAC_IOFFSET</name>
              <description>Analog AAC IOFFSET current
00: off, 01:2uA, 10:4uA, 11:6uA</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_AAC_CAP</name>
              <description>Analog AAC domain pole cap 3pF/step
00: no cap,11: max cap</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_PDSW</name>
              <description>XTAL analog AAC peak detector source follower size, 00: small 11: large</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_LPS_BUF_VB</name>
              <description>00: small current, 11: large current</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_PDCK_MANU</name>
              <description>1: open analog AAC loop for PDCK manual</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_OFF_2</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xtal_off_dummy1</name>
              <description>HW used only</description>
              <bitRange>[9:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_T_OPTION</name>
              <description>BG options</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>xtal_off_dummy0</name>
              <description>HW used only</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL_FEN</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>fen_xmddc</name>
              <description>1:enable xmddc
0:reset xmddc module</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fen_xaack</name>
              <description>1:enable AACK 
0:reset AACK module</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fen_xpdck</name>
              <description>1:enable PDCK 
0:reset PDCK module</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
