Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>ANAPAR_XTAL_PDCK</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x002539D0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDCK_STATE</name>
              <description>PDCK state for debug</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PDCK_LPOW</name>
              <description>PDCK low power mode, 1:gating input clk
Set to 1 when PDCK finished</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XPDCK_VREF_SEL</name>
              <description>PDCK calibrated result +offset 
For AAC robust +3</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_PDCK_UNIT</name>
              <description>PDCK settling cycles (4M CLK)
00: 4us
01: 8us 
10: 16us 
11: 32us</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF_INIT</name>
              <description>PDCK VREF initial setting</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF_MANUAL</name>
              <description>VREF manual at EN_XTAL_PDCK_DIGI=0
When pdck done, it will auto set this value to pdck result</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDCK_WAIT_CYC</name>
              <description>Enable PDCK waiting (4M CLK)
00: 64us
01:128us 
10:256us 
11:512us</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDCK_SEARCH_MODE</name>
              <description>0: binary search, 1: full search from 31</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_PDCK_DIGI</name>
              <description>Default set 0 due to POW_XTAL will 1 before do PDCK</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reset_n_pdck</name>
              <description>PDCK digital circuit reset (low to high),not used</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_AAC</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xC00E4E04</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XAACK_AAC_MODE</name>
              <description>11: XTAL_AACK_PK_SEL=&lt;11&gt;'s XTAL_GM_OUT3
10: XTAL_AACK_PK_SEL=&lt;10&gt;'s XTAL_GM_OUT2
01: XTAL_AACK_PK_SEL=&lt;01&gt;'s XTAL_GM_OUT1
00: XTAL_AACK_PK_SEL=&lt;00&gt;'s XTAL_GM_OUT0</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_AAC_TRIG</name>
              <description>MAC內部訊號(目前floating)
Set by pmc and clr by HW finish calibration</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_AAC</name>
              <description>MAC內部訊號(目前floating)
0: 不做AAC (default), 1: power on 做AAC</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XTAL_AAC_DIGI</name>
              <description>1:enable aac digital circuit</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GM_STUP</name>
              <description>aac gm start up setting (pkdet=0時,回到最大gm)</description>
              <bitRange>[21:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_CK_SET</name>
              <description>aac settling cycles (4M CLK)
000:  64us
001:  128us
010:  256us
011:  512us
100:  1024us
101:  2048us
110:  4096us
111:  8192us</description>
              <bitRange>[16:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GM_INIT</name>
              <description>aac gm initial setting</description>
              <bitRange>[13:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GM_STEP</name>
              <description>aac gm searching step. 0:step 1, 1:step 2</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XAAC_GM_OFFSET</name>
              <description>aac calibrated gm result +/- offset</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_PLUS</name>
              <description>0: aac calibrated gm result -offset , 1:aac calibrated gm result + offset</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reset_n_aac</name>
              <description>AAC digital circuit reset (low to high)
Default=0, 有EN_AAC 才會放開 (not used)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_AAC_ON_1</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000003C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XAAC_DONE</name>
              <description>for XAAC debug</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XAAC_STATE</name>
              <description>for XAAC debug</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XAAC_DBG</name>
              <description>for XAAC debug</description>
              <bitRange>[11:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XAAC_BUSY</name>
              <description>for XAAC debug</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PK_END_AR</name>
              <description>AAC peak sel end (star&gt;end)</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PK_START_AR</name>
              <description>AACK peak sel start (star&gt;end)</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XAAC_LUT_MANUAL_EN</name>
              <description>1: enable LUT
data: GM_MANUAL&lt;4:0&gt; , sel: AAC_MODE&lt;1:0&gt;</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XAAC_LPOW</name>
              <description>AACK low power mode, 1:gating input clk</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_MODE_DEC_ON_0</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x980924E2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_LPS_CAP_STEP</name>
              <description>00:1 step/01:2 step/10:4 step /11:8 step
一次降幾檔Cap</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_LPS_CAP_CYC</name>
              <description>00:8u/01:16u/10:32u/11:64u
多久降一次Cap step</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XMD_SEL</name>
              <description>00:100K/01:500K/10:4M/11:12M
隨著系統頻率變化,需要改變此reg</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_MODE_XMD</name>
              <description>1:scan mode</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_LDO_LPS</name>
              <description>(起震後, 進入LPS時)
111: 1.1V  110: 1.05V  101:1V  100:0.95V
011: 0.9V  010: 0.85V   001: 0.8V  000: 0.75V</description>
              <bitRange>[24:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_WAIT_CYC</name>
              <description>Next state wait cycle, 83ns/unit</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_LDO_OK</name>
              <description>(起震後)
111: 1.1V  110: 1.05V  101:1V  100:0.95V
011: 0.9V  010: 0.85V   001: 0.8V  000: 0.75V</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_MD_LPOW</name>
              <description>XTAL mode decoder low power mode
1: gated input clock</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_OV_RATIO</name>
              <description>overlap unit times (4M CLK)
00:  128us
01:  256us
10:  512us
11:  1024us</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_OV_UNIT</name>
              <description>overlap time settling cycles (4M CLK) 
000: 10us
001: 20us 
010: 40us
011: 80us
100: 160us
101: 320us
110: 640us
111: 1280us</description>
              <bitRange>[9:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_MODE_MANUAL</name>
              <description>01: LPS mode
10: Normal mode
11: high performance mode
[efuse for power on ]</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_MANU_SEL</name>
              <description>1: enable xtal mode manual
[efuse for power on ]</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_XTAL_LPS</name>
              <description>POW_XTAL_LPS</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL_MODE</name>
              <description>22C xtal mode define:
{POW_XTAL, XTAL_MODE, POW_XTAL_LPS}
[efuse for power on ]</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_n_xmd</name>
              <description>Decoder digital circuit reset (low to high)
Default 1&amp;POR 再給reset_n. (not used)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAPAR_XTAL_MODE_DEC_ON_1</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_OV_RATIO_FST</name>
              <description>overlap unit times (4M CLK), used for HP2NM or NM2HP
00:  128us
01:  256us
10:  512us
11:  1024us</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>xmd_state</name>
              <description>for xmd debug</description>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>xtal_mode_dec</name>
              <description>for xmd debug
10:NM
01: LPS
11: HP</description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL_LPS_CAP_CTRL</name>
              <description>1:cap step control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL_DEBUG</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x71C00002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xtal_tout</name>
              <description>xtal arbiter wait feedback signal timeout delay cycle, if this valua is max, arbiter will disable timeout function. Time unit is xtal_tutime</description>
              <bitRange>[31:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XAAC_PK_SEL</name>
              <description>XAAC_PK_SEL(AAC calibration address)</description>
              <bitRange>[20:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XAAC_READY</name>
              <description>signal for xtal</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL_GM_OUT</name>
              <description>AACK digital calculate result for ANA comparator</description>
              <bitRange>[17:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XPDCK_BUSY</name>
              <description>signal for xtal</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XPDCK_READY</name>
              <description>signal for xtal</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XPDCK_VREF_OUT</name>
              <description>PDCK digital calculate result for ANA comparator</description>
              <bitRange>[10:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>manu_pow_bg</name>
              <description>manual mode POW_BG</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>manu_xtal_mode</name>
              <description>manual mode XTAL_MODE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>manu_pow_xtal_lps</name>
              <description>manual mode POW_XTAL_LPS</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>manu_pow_xtal</name>
              <description>manual mode POW_XTAL</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>xtal_auto_pdck</name>
              <description>Auto PDCK enable signal. If set this bit, arbiter will do PDCK before XTAL enter LPS mode.
Once PDCK done , this bit will auto set 0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>xtal_arb_manual_en</name>
              <description>Aribter manual mode enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL_ART_CKON_TIM</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>HW used only</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL_LPS_FREQ_NM</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0004C4B4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xtal_clk_freq_nm</name>
              <description>xtal 312.5K freq in normal mode , all cap are valid , it is exactly 312.5K.</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL_LPS_FREQ_LPS</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0004C4B4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xtal_clk_freq_lps</name>
              <description>xtal 312.5K freq in lps mode , cap maybe disable for power save , maximumly , freq will be 312.5K + 250ppm</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL_LPS_SDM0</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00018000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xtal_sdm0_en</name>
              <description>xtal lps sdm0 output enable
Note : sdm0 used for system and wifi, default is 32768Hz.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>xtal_sdm0_freq</name>
              <description>xtal lps sdm0 output frequency, unit is Hz.
Note : sdm0 used for system and wifi, default is 32768Hz.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL_LPS_SDM1</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00017D00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xtal_sdm1_en</name>
              <description>xtal lps sdm1 output enable
Note : sdm1 used for bt, default is 32000Hz.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>xtal_sdm1_freq</name>
              <description>xtal lps sdm1 output frequency, unit is Hz.
Note : sdm1 used for system and wifi, default is 32000Hz.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
