Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSTEM_MEM_CTRL</name>
      <baseAddress>0x41000600</baseAddress>
      <size>0x000001FC</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000001FC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MBIST_CTRL_ALL</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>MEMx MBIST control and status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mbist_sta</name>
              <description>Total mbist status
[16] MBIST DRF_START_PAUSE
[17] MBIST NRML_DONE_ALL
[18] MBIST NRML_FAIL_ALL
[19] MBIST DRF_DONE_ALL
[20] MBIST DRF_FAIL_ALL</description>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>mbist_ctrl</name>
              <description>Total mbist control
[0] MBIST_CLK_EN_ALL
    BIS_CLK enable of all system memory groups.
[1] MBIST_RSTB_ALL
    Reset controll mbist circuit of all system memory groups.
[3:2]MBIST_MSEL_ALL 
    mbist method selection of all memory groups:
    2'b01: enable normal mode mbist
    2'b10: enable DRF mode mbist 
    2'b11: enable normal&amp;DRF mode mbist
[4]MBIST_RESUME
[5]MBIST_RESUME_PS
[6]MBIST_DYN_READ_EN
   If MBIST_MSEL_ALL[1]=1 &amp; MBIST_DYN_READ_EN=1, run VDDR mode mbist.
7]MBIST_PHYCLK_STOP</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_GRP_EN_CTRL0</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Used to on-off mbist of memory block in a group.</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>grp_en_km4ns_cache_e0</name>
              <description></description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_km4tz_itcm_e0</name>
              <description></description>
              <bitRange>[27:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_km4tz_cache_e0</name>
              <description></description>
              <bitRange>[24:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_bt_e0</name>
              <description></description>
              <bitRange>[20:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_wpoff_e0</name>
              <description></description>
              <bitRange>[17:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_sdio_e0</name>
              <description></description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_aonpmc_e0</name>
              <description></description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_hsys_e0</name>
              <description></description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_GRP_EN_CTRL1</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>Used to on-off mbist of memory block in a group.</description>
          <resetValue>0x07FFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>grp_en_ppe_e1</name>
              <description></description>
              <bitRange>[26:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_ppe_e0</name>
              <description></description>
              <bitRange>[18:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_can_e0</name>
              <description></description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_en_mjpeg_e2</name>
              <description></description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_GRP_EN_BT_VIR_E00</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000FFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_vir_e0_bist_en_19_0</name>
              <description></description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_DONE_STA0</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mbist_done_26_0</name>
              <description></description>
              <bitRange>[26:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_START_PULSE0</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mbist_start_pause_26_0</name>
              <description></description>
              <bitRange>[26:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_NORM_FAIL0</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mbist_norm_fail_31_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_NORM_FAIL1</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mbist_norm_fail_63_32</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_NORM_FAIL2</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mbist_norm_fail_78_64</name>
              <description></description>
              <bitRange>[14:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_DRF_FAIL0</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mbist_drf_fail_31_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_DRF_FAIL1</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mbist_drf_fail_63_32</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIST_DRF_FAIL2</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mbist_drf_fail_78_64</name>
              <description></description>
              <bitRange>[14:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_VIR_E0_BIST_DONE0</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_vir_e0_mbist_done_19_0</name>
              <description></description>
              <bitRange>[19:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_VIR_E0_BIST_FAIL0</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_vir_e0_mbist_fail_19_0</name>
              <description></description>
              <bitRange>[19:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_VIR_E0_BIST_DRF_PAUSE0</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_vir_e0_mbist_drf_pause_19_0</name>
              <description></description>
              <bitRange>[19:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_VIR_E0_BIST_RPT</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_vir_e0_bist_rpt_dout</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_VIR_E0_RPT_SEL</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_vir_e0_rpt_sel</name>
              <description>Select which rom's misr_dataout or bist_status of each memory can be read from bt_vir_e0_bist_rpt</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISR_DOUT_SEL</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4tz_itcm_e0_misr_sel</name>
              <description></description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>aonpmc_e0_misr_sel</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSPMC_E0_ROM_MISR0</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lspmc_e0_misr_dout_31_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSPMC_E0_ROM_MISR1</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lspmc_e0_misr_dout_35_32</name>
              <description></description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AONPMC_E0_ROM_MISR1</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aonpmc_e0_misr_dout_31_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AONPMC_E0_ROM_MISR2</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aonpmc_e0_misr_dout_35_32</name>
              <description></description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM4TZ_ITCM_E0_ROM_MISR2</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4tz_itcm_e0_misr_dout_31_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM4TZ_ITCM_E0_ROM_MISR3</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4tz_itcm_e0_misr_dout_63_32</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM4NS_ITCM_E0_ROM_MISR3</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4ns_itcm_e0_misr_dout_31_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM4NS_ITCM_E0_ROM_MISR4</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4ns_itcm_e0_misr_dout_63_32</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKE_E1_ROM_MISR4</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pke_e1_misr_dout_31_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKE_E1_ROM_MISR5</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pke_e1_misr_dout_63_32</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_PWR_MSK0</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x1FFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>grp_pmsk_bt_e0</name>
              <description></description>
              <bitRange>[28:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_wpon_e1</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_wpon_e0</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_wpoff_e2</name>
              <description></description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_wpoff_e1</name>
              <description></description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_wpoff_e0</name>
              <description></description>
              <bitRange>[20:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_usb_e0</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_sdio_e0</name>
              <description></description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_aonpmc_e0</name>
              <description></description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_lspmc_e0</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_lret_e0</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_hsys_e0</name>
              <description></description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
