Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>GRP_PWR_MSK1</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>grp_pmsk_pke_e0</name>
              <description></description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_can_e0</name>
              <description></description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_gmac_e0</name>
              <description></description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_mjpeg_e2</name>
              <description></description>
              <bitRange>[25:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_mjpeg_e1</name>
              <description></description>
              <bitRange>[16:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_mjpeg_e0</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_lcdc_e0</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_km4ns_itcm_e0</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_km4ns_cache_e0</name>
              <description></description>
              <bitRange>[10:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_km4tz_itcm_e0</name>
              <description></description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_km4tz_cache_e0</name>
              <description></description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_PWR_MSK2</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0001FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>grp_pmsk_ppe_e1</name>
              <description></description>
              <bitRange>[16:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_ppe_e0</name>
              <description></description>
              <bitRange>[8:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pmsk_pke_e1</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_HSYS_E0_CTRL</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00010F10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>hsys_e0_ds_k</name>
              <description>DS_K</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hsys_e0_tmck</name>
              <description>TMCK</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hsys_e0_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hsys_e0_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_hsys_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_hsys_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_hsys_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_hsys_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_LRET_E0_CTRL</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x002F0B10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lret_e0_waem</name>
              <description>WAEM</description>
              <bitRange>[21:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lret_e0_wae</name>
              <description>WAE</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lret_e0_rae</name>
              <description>RAE</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lret_e0_tmck</name>
              <description>TMCK</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lret_e0_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lret_e0_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lret_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lret_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lret_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lret_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_LSPMC_E0_CTRL</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001B10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lspmc_e0_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lspmc_e0_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lspmc_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lspmc_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lspmc_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lspmc_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_AONPMC_E0_CTRL</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001B10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aonpmc_e0_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>aonpmc_e0_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_aonpmc_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_aonpmc_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_aonpmc_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_aonpmc_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_SDIO_E0_CTRL</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sdio_e0_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sdio_e0_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sdio_e0_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_sdio_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_sdio_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_sdio_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_sdio_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_USB_E0_CTRL</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>usb_e0_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>usb_e0_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>usb_e0_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_usb_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_usb_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_usb_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_usb_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_WPOFF_E0_CTRL</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wpoff_e0_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpoff_e0_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpoff_e0_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpoff_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpoff_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_WPOFF_E1_CTRL</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wpoff_e1_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpoff_e1_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpoff_e1_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpoff_e1_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpoff_e1_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
