Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>GRP_WPOFF_E2_CTRL</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00022300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wpoff_e2_test1b</name>
              <description>TEST1B</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpoff_e2_test1a</name>
              <description>TEST1A</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpoff_e2_rmb</name>
              <description>RMB</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpoff_e2_rma</name>
              <description>RMA</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpoff_e2_rmeb</name>
              <description>RMEB</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpoff_e2_rmea</name>
              <description>RMEA</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpoff_e2_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpoff_e2_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_WPON_E0_CTRL</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00270B00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wpon_e0_waem</name>
              <description>WAEM</description>
              <bitRange>[21:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e0_wae</name>
              <description>WAE</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e0_rae</name>
              <description>RAE</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e0_tmck</name>
              <description>TMCK</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e0_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e0_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpon_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpon_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_WPON_E1_CTRL</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00270B00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wpon_e1_waem</name>
              <description>WAEM</description>
              <bitRange>[21:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e1_wae</name>
              <description>WAE</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e1_rae</name>
              <description>RAE</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e1_tmck</name>
              <description>TMCK</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e1_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wpon_e1_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpon_e1_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpon_e1_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_BT_E0_CTRL</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x002B0B10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_e0_waem</name>
              <description>WAEM</description>
              <bitRange>[21:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_e0_wae</name>
              <description>WAE</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_e0_rae</name>
              <description>RAE</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_e0_tmck</name>
              <description>TMCK</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_e0_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_e0_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_bt_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_bt_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_bt_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_bt_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_KM4TZ_CACHE_E0_CTRL</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4tz_cache_e0_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4tz_cache_e0_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4tz_cache_e0_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_cache_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_cache_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_cache_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_cache_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_KM4TZ_ITCM_E0_CTRL</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00002B10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4tz_itcm_e0_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4tz_itcm_e0_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_itcm_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_itcm_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_itcm_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_itcm_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_KM4NS_CACHE_E0_CTRL</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4ns_cache_e0_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4ns_cache_e0_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4ns_cache_e0_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_cache_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_cache_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_cache_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_cache_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_KM4NS_ITCM_E0_CTRL</name>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00002B10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4ns_itcm_e0_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4ns_itcm_e0_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_itcm_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_itcm_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_itcm_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_itcm_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_LCDC_E0_CTRL</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00022310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lcdc_e0_test1b</name>
              <description>TEST1B</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcdc_e0_test1a</name>
              <description>TEST1A</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcdc_e0_rmb</name>
              <description>RMB</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcdc_e0_rma</name>
              <description>RMA</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcdc_e0_rmeb</name>
              <description>RMEB</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcdc_e0_rmea</name>
              <description>RMEA</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lcdc_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lcdc_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lcdc_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lcdc_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
