Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>GRP_MJPEG_E0_CTRL</name>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00022310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mjpeg_e0_test1b</name>
              <description>TEST1B</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e0_test1a</name>
              <description>TEST1A</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e0_rmb</name>
              <description>RMB</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e0_rma</name>
              <description>RMA</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e0_rmeb</name>
              <description>RMEB</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e0_rmea</name>
              <description>RMEA</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_MJPEG_E1_CTRL</name>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00022310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mjpeg_e1_test1b</name>
              <description>TEST1B</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e1_test1a</name>
              <description>TEST1A</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e1_rmb</name>
              <description>RMB</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e1_rma</name>
              <description>RMA</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e1_rmeb</name>
              <description>RMEB</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e1_rmea</name>
              <description>RMEA</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e1_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e1_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e1_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e1_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_MJPEG_E2_CTRL</name>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mjpeg_e2_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e2_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mjpeg_e2_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e2_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e2_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e2_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e2_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_GMAC_E0_CTRL</name>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00022310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>gmac_e0_test1b</name>
              <description>TEST1B</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gmac_e0_test1a</name>
              <description>TEST1A</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gmac_e0_rmb</name>
              <description>RMB</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gmac_e0_rma</name>
              <description>RMA</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gmac_e0_rmeb</name>
              <description>RMEB</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gmac_e0_rmea</name>
              <description>RMEA</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_gmac_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_gmac_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_gmac_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_gmac_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_CAN_E0_CTRL</name>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_e0_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_e0_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_e0_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_can_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_can_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_can_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_can_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_PKE_E0_CTRL</name>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00022310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pke_e0_test1b</name>
              <description>TEST1B</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pke_e0_test1a</name>
              <description>TEST1A</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pke_e0_rmb</name>
              <description>RMB</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pke_e0_rma</name>
              <description>RMA</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pke_e0_rmeb</name>
              <description>RMEB</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pke_e0_rmea</name>
              <description>RMEA</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_PKE_E1_CTRL</name>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00002B10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pke_e1_dvs</name>
              <description>DVS</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pke_e1_dvse</name>
              <description>DVSE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e1_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e1_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e1_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e1_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_PPE_E0_CTRL</name>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ppe_e0_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppe_e0_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppe_e0_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_ppe_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_ppe_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_ppe_e0_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_ppe_e0_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
