Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>GRP_PPE_E1_CTRL</name>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ppe_e1_test1</name>
              <description>TEST1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppe_e1_rm</name>
              <description>RM</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppe_e1_rme</name>
              <description>RME</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_ppe_e1_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_ppe_e1_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_ppe_e1_pwr_lps</name>
              <description>Reserved for grp_@_pwr_lps for memory groups power controlled by SYSPMC.
Setted before chip goes to SLEEP.Used to controll power mode of this memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_ppe_e1_pwr_act</name>
              <description>Used to controll power mode of this memory group when chip is ACTIVE.
For FTC_ULP mem, pwr_act[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_act[2:0] map to {SD,DS,LS}.
*000 - active
*001 - light sleep
*010 - deep sleep
*100 - shut down</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_BT_VIR_E0_CTRL</name>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000340</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>grp_bt_vir_e0_msel</name>
              <description>*01 - This memory group can do normal mbist;
*10 - This memory group can do DRF mbist;
*11 - This memory group can do normal &amp; DRF mbist</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_bt_vir_e0_loop_mode</name>
              <description>*0 - Assist loop mode;
*1 - Don't assist loop mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_bt_vir_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP_RSTN</name>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x03FFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>grp_ppe_e1_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_ppe_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e1_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_pke_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_can_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_gmac_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e2_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e1_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_mjpeg_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lcdc_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_itcm_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4ns_cache_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_itcm_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_km4tz_cache_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_bt_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpon_e1_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpon_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpoff_e2_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpoff_e1_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_wpoff_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_usb_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_sdio_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_aonpmc_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lspmc_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_lret_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>grp_hsys_e0_rstn</name>
              <description>*0 - Reset mbist circuit of this memory group;
*1 - Release mbist circuit of this memory group.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_MODE_SEL</name>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pg_ret_sel</name>
              <description>change all pg ram group power mode to ret</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>nopg_ls_sel</name>
              <description>change all nopg ram group power mode to ls</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pg_rom_sel</name>
              <description>change all rom group power mode to slp</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Dummy</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy1</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_FTC_MEM_CTRL</name>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0002AD8C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_DS_ALL</name>
              <description>1 - All BT memory switch to Deep Sleep mode
0 - Power mode of BT memory are controlled by BTPMC</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_LVDRF_CLKDIS</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_TMCK_ALL</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_ROM_DVSE</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_ROM_DVS</name>
              <description>FSNOU_A_SPNN</description>
              <bitRange>[18:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_1PSR_DVSE</name>
              <description>Not used in Lite</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_1PSR_DVS</name>
              <description>Not used in Lite</description>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_1PRF1_DVSE</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_1PRF1_DVS</name>
              <description>FSNOU_A_SYNL</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_1PRF0_DVSE</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_1PRF0_DVS</name>
              <description>FSNOU_A_SYNL</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAN_OCC_CTRL0</name>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCAN_OCC_DBG_EN_I3C</name>
              <description>scan occ dbg en i3c</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_MAC</name>
              <description>scan occ dbg en mac</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_PLL_CTRL_MPHY</name>
              <description>scan pll ctrl mipiphy</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_PLL_CTRL_UPHY</name>
              <description>scan pll ctrl uphy</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_WPHY</name>
              <description>scan occ dbg en wphy</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_SEC</name>
              <description>scan occ dbg en sec</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_PSRAM</name>
              <description>scan occ dbg en psram</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_SPIC</name>
              <description>scan occ dbg en spic</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_UPHY</name>
              <description>scan occ dbg en uphy</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_HP</name>
              <description>scan occ dbg en hp</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAN_CTRL0</name>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCAN_PLL_OUT_SEL</name>
              <description>scan pll out sel</description>
              <bitRange>[14:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_RET_EN</name>
              <description>scan retention test enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_FT1</name>
              <description>scan ft mode1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_FT0</name>
              <description>scan ft mode0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_CP</name>
              <description>scan cp mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_SPC_DISABLE</name>
              <description>scan spc disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_PLL_BYPASS</name>
              <description>scan pll bypass</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_COMPRESS</name>
              <description>scan compress</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_PAR_LATPS</name>
              <description>Used as scan latch enable bit .
If want to change scan par from func setting , set this bit to 1 first , then write func register will also effect scan shadow register .</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_MODE_SETPS</name>
              <description>scan mode enable .
It is a level signal , write 1 will trigger into scan mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
