Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>SCAN_OCC_CTRL1</name>
          <addressOffset>0x000001F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCAN_OCC_DBG_EN_SDIO</name>
              <description></description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_AC</name>
              <description></description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_CAN</name>
              <description></description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_VO</name>
              <description></description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_SHPERI</name>
              <description></description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_SPORT</name>
              <description></description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_LPERI</name>
              <description></description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_IRDA</name>
              <description></description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_HPERI</name>
              <description></description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAN_OCC_CTRL2</name>
          <addressOffset>0x000001F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCAN_OCC_DBG_EN_USB</name>
              <description></description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_AON4M</name>
              <description></description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_WL</name>
              <description></description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_UART_T</name>
              <description></description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_SIC</name>
              <description></description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_SDMX</name>
              <description></description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_OTPC</name>
              <description></description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_LPON</name>
              <description></description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_LOGUART</name>
              <description></description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_HTIM</name>
              <description></description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_GPIO</name>
              <description></description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_BT</name>
              <description></description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_AUX40M</name>
              <description></description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_ADCC</name>
              <description></description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAN_OCC_CTRL3</name>
          <addressOffset>0x000001F8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCAN_OCC_DBG_EN_DVP</name>
              <description></description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_LTIM_5</name>
              <description></description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_LTIM_4</name>
              <description></description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_LTIM_3</name>
              <description></description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_LTIM_2</name>
              <description></description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_LTIM_1</name>
              <description></description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_LTIM_0</name>
              <description></description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_UART_R_3</name>
              <description></description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_UART_R_2</name>
              <description></description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_UART_R_1</name>
              <description></description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_DBG_EN_UART_R_0</name>
              <description></description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
