Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_PA18</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pA18_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA18_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA18_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA18_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA18_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA18_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA18_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA18_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PA19</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pA19_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA19_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA19_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA19_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA19_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA19_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA19_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA19_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PA20</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pA20_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA20_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA20_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA20_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA20_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA20_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA20_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA20_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PA21</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pA21_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA21_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA21_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA21_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA21_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA21_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA21_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA21_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PA22</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pA22_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA22_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA22_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA22_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA22_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA22_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA22_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA22_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PA23</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pA23_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA23_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA23_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA23_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA23_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA23_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA23_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA23_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PA24</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pA24_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA24_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA24_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA24_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA24_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA24_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA24_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA24_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PA25</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pA25_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA25_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA25_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA25_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA25_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA25_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA25_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA25_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PA26</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pA26_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA26_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA26_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA26_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA26_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA26_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA26_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pA26_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
