Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_PB4</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB4_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB4_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB4_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB4_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB4_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB4_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB4_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB4_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB5</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB5_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB5_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB5_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB5_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB5_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB5_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB5_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB5_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB6</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB6_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB6_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB6_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB6_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB6_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB6_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB6_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB6_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB7</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB7_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB7_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB7_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB7_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB7_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB7_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB7_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB7_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB8</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB8_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB8_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB8_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB8_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB8_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB8_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB8_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB8_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB9</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB9_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB9_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB9_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB9_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB9_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB9_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB9_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB9_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB10</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB10_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB10_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB10_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB10_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB10_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB10_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB10_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB10_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB11</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB11_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB11_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB11_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB11_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB11_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB11_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB11_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB11_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB12</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB12_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB12_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB12_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB12_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB12_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB12_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB12_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB12_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
