Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_PB22</name>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB22_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB22_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB22_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB22_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB22_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB22_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB22_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB22_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB23</name>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB23_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB23_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB23_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB23_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB23_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB23_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB23_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB23_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB24</name>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB24_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB24_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB24_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB24_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB24_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB24_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB24_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB24_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB25</name>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB25_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB25_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB25_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB25_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB25_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB25_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB25_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB25_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB26</name>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB26_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB26_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB26_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB26_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB26_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB26_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB26_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB26_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB27</name>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB27_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB27_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB27_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB27_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB27_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB27_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB27_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB27_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB28</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB28_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB28_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB28_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB28_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB28_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB28_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB28_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB28_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB29</name>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB29_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB29_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB29_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB29_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB29_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB29_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB29_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB29_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PB30</name>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pB30_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB30_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB30_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB30_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB30_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB30_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB30_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pB30_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
