Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_PC8</name>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pC8_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC8_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC8_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC8_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC8_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC8_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC8_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC8_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PC9</name>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pC9_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC9_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC9_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC9_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC9_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC9_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC9_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC9_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PC10</name>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pC10_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC10_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC10_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC10_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC10_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC10_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC10_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC10_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PC11</name>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pC11_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC11_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC11_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC11_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC11_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC11_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC11_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC11_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PC12</name>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pC12_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC12_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC12_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC12_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC12_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC12_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC12_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC12_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PC13</name>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pC13_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC13_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC13_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC13_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC13_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC13_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC13_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC13_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PC14</name>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pC14_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC14_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC14_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC14_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC14_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC14_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC14_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC14_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PC15</name>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pC15_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC15_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC15_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC15_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC15_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC15_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC15_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC15_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PC16</name>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pC16_dis</name>
              <description>PAD shutdown, only when the whole group's dis signals are all 1, the PAD SHDN will pull down to shutdown the group pad.
1. disable pad
0. enable pad</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC16_e3</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC16_sr</name>
              <description>PAD slew rate control.
1: slow
0: fast</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC16_smt</name>
              <description>PAD Schmit control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC16_e2</name>
              <description>PAD driving ability control.
0: low
1: high 
The actual driving current is depend on pad type.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC16_pupdc</name>
              <description>Some pad may have two type of PU/PD resistor, this bit can select it.
1: small resistor
0: big resistor</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC16_ie</name>
              <description>PAD input enable control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pC16_sel</name>
              <description>PAD pinmux function ID selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PU_1</name>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x40004020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pa_pu</name>
              <description>PAD pull up enable when system is in active.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PU_2</name>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pb_pu</name>
              <description>PAD pull up enable when system is in active.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
