Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>PAD_PU_3</name>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00007000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pc_pu</name>
              <description>PAD pull up enable when system is in active.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PD_1</name>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pa_pd</name>
              <description>PAD pull down enable when system is in active.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PD_2</name>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pb_pd</name>
              <description>PAD pull down enable when system is in active.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PD_3</name>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pc_pd</name>
              <description>PAD pull down enable when system is in active.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PU_SLP_1</name>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x40004020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pa_pu_slp</name>
              <description>PAD pull up enable when system is in sleep.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PU_SLP_2</name>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pb_pu_slp</name>
              <description>PAD pull up enable when system is in sleep.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PU_SLP_3</name>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00007000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pc_pu_slp</name>
              <description>PAD pull up enable when system is in sleep.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PD_SLP_1</name>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pa_pd_slp</name>
              <description>PAD pull down enable when system is in sleep.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PD_SLP_2</name>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pb_pd_slp</name>
              <description>PAD pull down enable when system is in sleep.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_PD_SLP_3</name>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pc_pd_slp</name>
              <description>PAD pull down enable when system is in sleep.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_AON_CTRL</name>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001E20</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pad_pupd_slp_mode</name>
              <description>pad pupd sleep mode seletion . 
Note:this bit used in pmc , don't change this addr</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_swr_en_mask</name>
              <description>Regu pmc will set one of aon pin to pullup/pulldn to control external SWR.
5'b00001: PC10
5'b00010: PC11
5'b00100: PC12
5'b01000: PC13
5'b10000: PC14</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[15:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_SYSON_CTRL</name>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x1F770000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>vprob_syson_oe</name>
              <description>vprob source select, msut one-hot
[0]: AON_OTP  power
[1]: SOC  power 
[2]: BT power
[3]: RSVD</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vprob_en0</name>
              <description>pad vprob function enable</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iq_sw_en</name>
              <description>rfafe 5v sw enable, active 1
[0]: G3 group sw
[1]: G7 group sw</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>g2_h5L3318_lv</name>
              <description>VDDPST=5V
  H533L18 = 1
  H518L33 = 1
  H5L3318 = 1
VDDPST=3.3V
  H533L18 = 1
  H518L33 = 0
  H5L3318 = 0
VDDPST=1.8V
  H533L18 = 0
  H518L33 = 1
  H5L3318 = 0
when PAD SHUTDOWN, pad will ISO this three value to 111 for safety .</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>g2_h533l18_lv</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>g2_h518l33_lv</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>g3_h5L3318_lv</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>g3_h533l18_lv</name>
              <description></description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>g3_h518l33_lv</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>g7_h5L3318_lv</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>g7_h533l18_lv</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>g7_h518l33_lv</name>
              <description></description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_TEST_MUX</name>
          <addressOffset>0x000001D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lp_adc_ch_num</name>
              <description>sw select adc test channel</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lp_adc_mode</name>
              <description>sw_select adc mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lp_adc_force</name>
              <description>force sw select instead of pinmux input when adc test mode
1:using [5:0] for adc channel / mode select
0:using io input for adc channel / mode</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_I2S_CTRL</name>
          <addressOffset>0x000001E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SP1_DIO3_MUXSEL</name>
              <description>SPORT1 DIO3 function mux
0: DIN_3 func
1: DOUT_0 func</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP1_DIO2_MUXSEL</name>
              <description>SPORT1 DIO2 function mux
0: DIN_2 func
1: DOUT_1 func</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP1_DIO1_MUXSEL</name>
              <description>SPORT1 DIO1 function mux
0: DIN_1 func
1: DOUT_2 func</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP1_DIO0_MUXSEL</name>
              <description>SPORT1 DIO0 function mux
0: DIN_0 func
1: DOUT_3 func</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP0_DIO3_MUXSEL</name>
              <description>SPORT0 DIO3 function mux
0: DIN_3 func
1: DOUT_0 func</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP0_DIO2_MUXSEL</name>
              <description>SPORT0 DIO2 function mux
0: DIN_2 func
1: DOUT_1 func</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP0_DIO1_MUXSEL</name>
              <description>SPORT0 DIO1 function mux
0: DIN_1 func
1: DOUT_2 func</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP0_DIO0_MUXSEL</name>
              <description>SPORT0 DIO0 function mux
0: DIN_0 func
1: DOUT_3 func</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_PORT_CTRL</name>
          <addressOffset>0x000001E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dbg_port_en</name>
              <description></description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dbg_port_en2</name>
              <description></description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dbg_port_sel</name>
              <description></description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_GPIO_MAP_0</name>
          <addressOffset>0x000001E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x03020100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>gpio_dmux_sel3</name>
              <description></description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_dmux_sel2</name>
              <description></description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_dmux_sel1</name>
              <description></description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_dmux_sel0</name>
              <description></description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_GPIO_MAP_1</name>
          <addressOffset>0x000001EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x07060504</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>gpio_dmux_sel7</name>
              <description></description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_dmux_sel6</name>
              <description></description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_dmux_sel5</name>
              <description></description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_dmux_sel4</name>
              <description></description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PINMUX_SUB_CTRL</name>
          <addressOffset>0x000001F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dbg_clk_force</name>
              <description>Force debug clock divider enable if testmode in clock debug ICFG.
This maybe used when EXT_CLK_OUT was used.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dbg_clk1_sel</name>
              <description>debug clock1  in CLOCK testmode 
0: xtal 40M
1: xtal 20M
2: xtal 2M
3: xtal lps 312.5K
4: sdm_32.768k
5: sdm_1Hz
6.usb pll div
7.sys pll div
8: osc131k
9: osc4M
10: osc100K
11: RMII gmac 50M</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dbg_clk0_sel</name>
              <description>debug clock1  in CLOCK testmode 
0: xtal 40M
1: xtal 20M
2: xtal 2M
3: xtal lps 312.5K
4: sdm_32.768k
5: sdm_1Hz
6.usb pll div
7.sys pll div
8: osc131k
9: osc4M
10: osc100K
11: RMII gmac 50M</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_SDD_CTRL</name>
          <addressOffset>0x000001F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000109</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>kscan_pupd_ctrl</name>
              <description>enable kscan pupd hw control logic, active 1</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4_swd_sel</name>
              <description>Toggle this bit will switch shared SWD port, this bit only accessed by KM4.
Default is KM4 SWD, if km4 toggle this bit , SWD port will switch to KR4</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWD_PMUX_EN</name>
              <description>1: Force enable share SWD pinmux  function
0: Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_REG_DUMMY_0</name>
          <addressOffset>0x000001FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>HW used only , these are for reserved.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
