Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC</name>
      <baseAddress>0x41000300</baseAddress>
      <size>0x00000094</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000094</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_WAK_STATUS0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wak_evt0_sta_29_0</name>
              <description>Acoording chip_arch spec</description>
              <bitRange>[29:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WAK_STATUS1</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wak_evt0_sta_59_30</name>
              <description>Acoording chip_arch spec</description>
              <bitRange>[29:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WAK_MASK0_NP</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wak_np_imr_29_0</name>
              <description>1:mask enable for wake NP, this used to wak pmc</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WAK_MASK1_NP</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wak_np_imr_59_30</name>
              <description>1:mask enable for wake NP, this used to wak pmc</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WAK_MASK0_AP</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wak_ap_imr_29_0</name>
              <description>1:mask enable for wake AP</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WAK_MASK1_AP</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wak_ap_imr_59_30</name>
              <description>1:mask enable for wake AP</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WLPMC_ISR</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_OFF_IMR</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_ON_IMR</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_OFF_ISR</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WL_ON_ISR</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WLAN_PWRCTL</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_CLR_RDY2ACT</name>
              <description>System infrom WLAN ready to active</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_SET_RDY2ACT</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_RDY2ACT</name>
              <description>System infrom WLAN ready to active</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WL_REQ2ACT</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WL_HW_RESP_FEN</name>
              <description>1: enable HW auto response</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SYSPMC_CTRL</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0E0F0110</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu_is_np</name>
              <description>This bit indicate if current cpu who read this bit is used as NP
1: is NP
0: is AP</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field protection="s">
              <name>np_cpu_id</name>
              <description>0:cpu0(km4tz) used as NP, pmc will enable it after system wake
1:cpu1(km4ns) used as NP.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PMC_STL_PDSOC</name>
              <description>timer wait for core power power-cut power stable .
000:8us * 2^1
001:8us * 2^2
010:8us * 2^3  // 64us
011:8us * 2^4
100:8us * 2^5
101:8us * 2^6  
110:8us * 2^7  // pon default
111:8us * 2^8</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PMC_TUTIME</name>
              <description>PMC timeunit setting,  in cycles of osc2M 
e.g, default 0xF,  timeunit = 8us</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>CPU0_NMI_MASK</name>
              <description>Interrupt mask for CPU0 NVIC[0]: plfm1 reset
1.mask interrupt
0:enable interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PMC_PLL_POF</name>
              <description>1: Request PLL pof by software,plfm and system cpu will auto select to pll path . Which one pll will be active is determined by pst_cksl_sys_cpu and pst_cksl_sys_hperi. 
This bit auto clear to 0 after by HW PMC
Note: HW will pof one pll or two if cpu pll and hperi cpu are different after arbitration with bt .</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PMC_PLL_PON</name>
              <description>1: Request PLL pon by software,plfm and system cpu will auto select to pll path . Which one pll will be active is determined by pst_cksl_sys_cpu and pst_cksl_sys_hperi. 
This bit auto clear to 0 after by HW PMC
Note: HW will pon one pll or two if cpu pll and hperi cpu are different</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>pmc_mem_slp_mode</name>
              <description>Select memory parameter option
1: sleep setting
0: normal setting
Note:defautl set to sleep setting to save power when snooze</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PMC_POF_WAIT_SLEP</name>
              <description>1.when SW set pmen_slep or pmen_dslp , hw pmc will wait cpu0 enter sleep mode , then begin to pof seq
0.Not wait cpu sleep</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PST_SLEP_WDML</name>
              <description>normal setting for WMAC request Core LDO dummy load selection
1: enable dummy load when PMC enter into sleep mode
0: disable dummy load when PMC enter into sleep mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>CPU0_IRQ_MASK</name>
              <description>1.mask all KM4 interrupt
0:release all KM4 interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PMC_PMEN_SLEP</name>
              <description>1: Request PMC to enter sleep state,
auto clear to 0 after PMC finishes</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PMC_PMEN_DSLP</name>
              <description>1: Request PMC to enter deep-sleep state,
auto clear to 0 after PMC finishes</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SYSPMC_OPT</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x070000C0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cke_xtal40m_slep</name>
              <description>when pmc is sleep status, this bit control u_ckg_xtal40m_slep
1:Enable xtal40m_slep
0:Disable
Note:when pmc is not sleep, u_ckg_xtal40m_slep will be enabled whether value this bit is
Remove to lp_pmc option register</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_CHG_BDML</name>
              <description>normal setting for BT request Core LDO dummy load selection
1: enable dummy load during BT PMC change to sleep mode / normal mode
0: disable dummy load during BT PMC change to sleep mode / normal mode</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_G4_USE_MLDO</name>
              <description>1: G0 pad use MLDO 1.8v IO power
0: G0 pad use external power and can't shutdown by pmc</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_G5_USE_MLDO</name>
              <description>1: G1 pad use MLDO 1.8v IO power(psram only)
0: G1 pad use external power and can't shutdown by pmc</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU1_IRQ_MASK</name>
              <description>1.mask all CPU1 interrupt
0:release all CPU1 interrupt</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_SLEP_BDML</name>
              <description>normal setting for BT request Core LDO dummy load selection
1: enable dummy load when PMC enter into sleep mode
0: disable dummy load when PMC enter into sleep mode</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_SLEP_SDML</name>
              <description>normal setting for system request Core LDO dummy load selection
1: enable dummy load when PMC enter into sleep mode
0: disable dummy load when PMC enter into sleep mode</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_NORM_WDML</name>
              <description>normal setting for WMAC request Core LDO dummy load selection
1: enable dummy load when PMC enter into normal mode
0: disable dummy load when PMC enter into normal mode</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_NORM_BDML</name>
              <description>normal setting for BT request Core LDO dummy load selection
1: enable dummy load when PMC enter into normal mode
0: disable dummy load when PMC enter into normal mode</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_NORM_SDML</name>
              <description>normal setting for system request Core LDO dummy load selection
1: enable dummy load when PMC enter into normal mode
0: disable dummy load when PMC enter into normal mode</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_SLEP_G4PD</name>
              <description>1: G0 pad used for 1.8v IO power , and will shutdown when LDO3318 off in slep, when dslp , it will always shutoff
0: G1 pad not used as 1.8v IO power</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_SLEP_G5PD</name>
              <description>1: G1 pad used for 1.8v IO power , and will shutdown when LDO3318 off in slep,, when dslp , it will always shutoff
0: G2 pad not used as 1.8v IO power</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_SLEP_ERCK</name>
              <description>1: Enable lpon clock when PMC enter into sleep mode
0: Gate lpon clock when PMC enter into sleep mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_SLEP_ESOC</name>
              <description>1: power enable SOC platform when PMC enter into sleep mode (clock-gating)
0: power off SoC domain when PMC enter into sleep mode (power-gating)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_LOAD_CTRL</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYS_DMYL_SLP</name>
              <description>this bit means the dummy load state when KM4 is sleep
0: disable
1: enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_DMYL_ACT</name>
              <description>this bit means the dummy load state when KM4 is active
0: disable
1: enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_DMYL_MNL</name>
              <description>system use this bit to switch core ldo dummy load control path manually
0: dummy load control is decided by LS/BT/WL PMC arbitration
1: dummy load control is decided by KM4 sleep state</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP0_0</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP0_INSTR1_5_0</name>
              <description>instruction1 of  LSYSON PMC patch group0,bit[5:0]</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP0_INSTR0</name>
              <description>instruction0 of  LSYSON PMC patch group0</description>
              <bitRange>[25:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP0_SADDR</name>
              <description>Start address of the first instruction of  LSYSON PMC patch group0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP0_1</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP0_INSTR2</name>
              <description>instruction2 of  LSYSON PMC patch group0</description>
              <bitRange>[29:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP0_INSTR1_17_6</name>
              <description>instruction1 of  LSYSON PMC patch group0,bit[17:6]</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP1_0</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP1_INSTR1_5_0</name>
              <description>instruction1 of  LSYSON PMC patch group1,bit[5:0]</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP1_INSTR0</name>
              <description>instruction0 of  LSYSON PMC patch group1</description>
              <bitRange>[25:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP1_SADDR</name>
              <description>Start address of the first instruction of  LSYSON PMC patch group1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP1_1</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP1_INSTR2</name>
              <description>instruction2 of  LSYSON PMC patch group1</description>
              <bitRange>[29:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP1_INSTR1_17_6</name>
              <description>instruction1 of  LSYSON PMC patch group1,bit[17:6]</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP2_0</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP2_INSTR1_5_0</name>
              <description>instruction1 of  LSYSON PMC patch group2,bit[5:0]</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP2_INSTR0</name>
              <description>instruction0 of  LSYSON PMC patch group2</description>
              <bitRange>[25:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP2_SADDR</name>
              <description>Start address of the first instruction of  LSYSON PMC patch group2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP2_1</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP2_INSTR2</name>
              <description>instruction2 of  LSYSON PMC patch group2</description>
              <bitRange>[29:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP2_INSTR1_17_6</name>
              <description>instruction1 of  LSYSON PMC patch group2,bit[17:6]</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
