Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_PMC_PATCH_GRP3_0</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP3_INSTR1_5_0</name>
              <description>instruction1 of  LSYSON PMC patch group3,bit[5:0]</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP3_INSTR0</name>
              <description>instruction0 of  LSYSON PMC patch group3</description>
              <bitRange>[25:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP3_SADDR</name>
              <description>Start address of the first instruction of  LSYSON PMC patch group3</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP3_1</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP3_INSTR2</name>
              <description>instruction2 of  LSYSON PMC patch group3</description>
              <bitRange>[29:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP3_INSTR1_17_6</name>
              <description>instruction1 of  LSYSON PMC patch group3,bit[17:6]</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP4_0</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP4_INSTR1_5_0</name>
              <description>instruction1 of  LSYSON PMC patch group4,bit[5:0]</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP4_INSTR0</name>
              <description>instruction0 of  LSYSON PMC patch group4</description>
              <bitRange>[25:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP4_SADDR</name>
              <description>Start address of the first instruction of  LSYSON PMC patch group4</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP4_1</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP4_INSTR2</name>
              <description>instruction2 of  LSYSON PMC patch group4</description>
              <bitRange>[29:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP4_INSTR1_17_6</name>
              <description>instruction1 of  LSYSON PMC patch group4,bit[17:6]</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP5_0</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP5_INSTR1_5_0</name>
              <description>instruction1 of  LSYSON PMC patch group5,bit[5:0]</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP5_INSTR0</name>
              <description>instruction0 of  LSYSON PMC patch group5</description>
              <bitRange>[25:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP5_SADDR</name>
              <description>Start address of the first instruction of  LSYSON PMC patch group5</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP5_1</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATCH_GRP5_INSTR2</name>
              <description>instruction2 of  LSYSON PMC patch group5</description>
              <bitRange>[29:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATCH_GRP5_INSTR1_17_6</name>
              <description>instruction1 of  LSYSON PMC patch group5,bit[17:6]</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_DBG_FLAG</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lpon_pmc_flag_pc</name>
              <description>PMC will raise a debug flag if hw pmc pc value hit this value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_ADDR45</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00F000F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_patch_addr0</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_patch_addr1</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_ADDR67</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00F000F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_patch_addr2</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_patch_addr3</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AIP_TRIGGER</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x02161600</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sys_pwm_h</name>
              <description>Set pwm in heavy loading by system (SWR current &gt; 200mA)
1:Heavy
0:Light</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sys_mldo_slp</name>
              <description>mem ldo mode slep option 
00:off
01:sleep (wo dummy)
10:normal-0 (wi dummy)
10:normal-1 (wo dummy)</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sys_mldo_norm</name>
              <description>mem ldo mode normal option 
00:off
01:sleep (wo dummy)
10:normal-0 (wi dummy)
10:normal-1 (wo dummy)</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sys_xtal_slp</name>
              <description>00: OFF    001: LPS wo 40M   010: LPS with 40M , 011: NORM     100: HP</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sys_xtal_norm</name>
              <description>00: OFF    001: LPS wo 40M   010: LPS with 40M , 011: NORM     100: HP</description>
              <bitRange>[19:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sys_mldo_rdy</name>
              <description>Ready signal for system mldo req. Software write trg register and sts different value will lead this bit set to 0 by hardware. When HW finish the flow, this bit will be set to 1 by hardware.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sys_xmd_rdy</name>
              <description>Ready signal for system xmd state. Software write trg register and sts different value will lead this bit set to 0 by hardware. When HW finish the flow, this bit will be set to 1 by hardware.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sys_regu_sts_rdy</name>
              <description>Ready signal for system regu state. Software write trg register and sts different value will lead this bit set to 0 by hardware. When REGU PMC finish the flow, this bit will be set to 1 by hardware.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sys_regu_sts_slp</name>
              <description>000: RSVD     001: state1   010: state2   011: state3
100: state4    101: state5   110: state6   111: RSVD</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sys_regu_sts_norm</name>
              <description>000: RSVD     
001: state1  0.7/PC/PFM
010: state2  0.8/PC/PFM 
011: state3  0.9/PC/PFM
100: state4  0.9(1.0)/SLP/PFM  
101: state5  0.9(1.0)/SLP/PWM 
110: state6  0.9(1.0)/NORM/PWM 
111: RSVD</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sys_pll_req</name>
              <description>require pll by system .
pll ready can polling 0xA8 SYSTEM_CFG0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trg_sys_mldo</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>trg_sys_xtal</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>trg_sys_regu_sts</name>
              <description>write 1 to trigger sys_regu_sts_norm value to take effect</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ARB_DBC0</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0015018F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dbc_cnt_xmd</name>
              <description>xmd debounce counter , cycle based in OSC4M</description>
              <bitRange>[28:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dbc_en_xmd</name>
              <description>xtal mode arbit debounce enable
0:disable
1:enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dbc_cnt_regu_sts</name>
              <description>regu sts debounce counter , cycle based in OSC4M
for 4M sync to 100K, it must wait 40us for async handshake</description>
              <bitRange>[12:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dbc_en_regu_sts</name>
              <description>regu sts arbit debounce enable
0:disable
1:enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ARB_DBC1</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000018F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dbc_cnt_mldo</name>
              <description>mldo debounce counter , cycle based in OSC4M
for 4M sync to 100K, it must wait 40us for async handshake</description>
              <bitRange>[12:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dbc_en_mldo</name>
              <description>mldo arbit debounce enable
0:disable
1:enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ARB_VTH</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iagt_vthd_xmd</name>
              <description>This field used for xmd arb control.</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iagt_vthd_mldo</name>
              <description>This field used for mldo arb control.</description>
              <bitRange>[14:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iagt_vthd_regu_sts</name>
              <description>This field used for regu sts arb control.</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AON_BUS_ST</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rtc_resp_timeout</name>
              <description>This flag indicate system access rtc domain timeout , access maybe failed.
Active 1.
Write 1 will clear the status.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>aon_resp_timeout</name>
              <description>This flag indicate system access aon domain timeout , access maybe failed.
Active 1.
Write 1 will clear the status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CLK_FORCE</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_opt_dmy</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sys_pll_div3_force</name>
              <description>force to enable sys pll div3
1:sys pll div3 clock always enable
0:sys pll div3 clock always auto gate when no IP use it</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>usb_pll_div3_force</name>
              <description>force to enable usb pll div3
1:usb pll div3 clock always enable
0:usb pll div3 clock always auto gate when no IP use it</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
