Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_AON</name>
      <baseAddress>0x41000000</baseAddress>
      <size>0x00000100</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_PWC</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x04FFFF10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPPAD_SHDN_CORE</name>
              <description>1: Release LP PAD SHDN CORE
0: Global Assert LP PAD RSTB33
Note:G5 is aon pad, when all LP pad's IO power is ready , aon pmc will release this bit , only in power on init seq .</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPAD_RSTB</name>
              <description>1: Release LP PAD RSTB33 (except G5)
0: Global Assert LP PAD RSTB33
Note: aon pmc will auto release this bit in power on init seq</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPAD_SHDN</name>
              <description>1: Global Enable LP PAD (except G5)
0: Shutdown LP PAD
Note: aon pmc will auto release this bit in power on init seq</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G7_PAD_RSTB</name>
              <description>1: Enable G7  group pad
0: Reset PAD</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G6_PAD_RSTB</name>
              <description>1: Enable G6  group pad
0: Reset PAD</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G5_PAD_RSTB</name>
              <description>1: Enable G5  group pad
0: Reset PAD</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G4_PAD_RSTB</name>
              <description>1: Enable G4  group pad
0: Reset PAD</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G3_PAD_RSTB</name>
              <description>1: Enable G3 group pad
0: Reset PAD</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G2_PAD_RSTB</name>
              <description>1: Enable G2 group pad
0: Reset PAD</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G1_PAD_RSTB</name>
              <description>1: Enable G1 group pad
0: Reset PAD</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G0_PAD_RSTB</name>
              <description>1: Enable G0 group pad
0: Reset PAD</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G7_PAD_SHDN</name>
              <description>1: Enable G7 group pad
0: Shutdown PAD</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G6_PAD_SHDN</name>
              <description>1: Enable G6 group pad
0: Shutdown PAD</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G5_PAD_SHDN</name>
              <description>1: Enable G5 group pad
0: Shutdown PAD</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G4_PAD_SHDN</name>
              <description>1: Enable G4 group pad
0: Shutdown PAD</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G3_PAD_SHDN</name>
              <description>1: Enable G3 group pad
0: Shutdown PAD</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G2_PAD_SHDN</name>
              <description>1: Enable G2 group pad
0: Shutdown PAD</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G1_PAD_SHDN</name>
              <description>1: Enable G1 group pad
0: Shutdown PAD</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G0_PAD_SHDN</name>
              <description>1: Enable G0 group pad
0: Shutdown PAD</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dual_mode</name>
              <description>1: CPU0/CPU1 work separate
0: default mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pc_step</name>
              <description>power cut enable time step.
0: not valid
1: 10us
2: 20us
3: 30us</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>psw_out_aon_otp</name>
              <description>aon otp domain power switch status
1: power on
0: power off</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pwc_aon_otp</name>
              <description>OTP power cut enable for core power, high active.
1:enable 
0:disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ISO</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0A03FF03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>G9_PAD_RSTB</name>
              <description>1: Enable G9  group pad
0: Reset PAD</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G8_PAD_RSTB</name>
              <description>1: Enable G8  group pad
0: Reset PAD
Note: This is AON pad group,
 aon pmc will auto release this bit in power on init seq</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G9_PAD_SHDN</name>
              <description>1: Enable G9 group pad
0: Shutdown PAD</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G8_PAD_SHDN</name>
              <description>1: Enable G8 group pad
0: Shutdown PAD
Note: This is AON pad group,
 aon pmc will auto release this bit in power on init seq</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G9_PAD_SHDN_CORE</name>
              <description>1: Enable G9 group pad
0: Shutdown PAD</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G8_PAD_SHDN_CORE</name>
              <description>1: Enable G8 group pad
0: Shutdown PAD</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G7_PAD_SHDN_CORE</name>
              <description>1: Enable G7 group pad
0: Shutdown PAD</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G6_PAD_SHDN_CORE</name>
              <description>1: Enable G6 group pad
0: Shutdown PAD</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G5_PAD_SHDN_CORE</name>
              <description>1: Enable G5 group pad
0: Shutdown PAD</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G4_PAD_SHDN_CORE</name>
              <description>1: Enable G4 group pad
0: Shutdown PAD</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G3_PAD_SHDN_CORE</name>
              <description>1: Enable G3 group pad
0: Shutdown PAD</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G2_PAD_SHDN_CORE</name>
              <description>1: Enable G2 group pad
0: Shutdown PAD</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G1_PAD_SHDN_CORE</name>
              <description>1: Enable G1 group pad
0: Shutdown PAD</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>G0_PAD_SHDN_CORE</name>
              <description>1: Enable G0 group pad
0: Shutdown PAD</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iso_aon_otp</name>
              <description>1: ISO signals from otp core power domain
0: Release</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iso_lpon</name>
              <description>When LDO core power on, PD_LPON is on.
1: ISO signal of LPON power domain
0: Release</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FEN</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>fen_lpon</name>
              <description>LS global reset
1: Enable LS function
0: Disable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_px</name>
              <description>1: Enable pad interface function
0: Disable
Note: this module is in syson power domain</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_ledc</name>
              <description>1: Enable led display function
0: Disable
Note: this module is in syson power domain</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sdm</name>
              <description>1: Enable 32.768K SDM function
0: Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_rtc</name>
              <description>1: Enable RTC function
0: Disable
Move to rtc reg block</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_atim</name>
              <description>1: Enable AON timer
0: Reset AON timer
Note: AON timer starts to run only when event happens.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_iwdg</name>
              <description>1: Enable IWDG by HW autoload.
Once enabled, IWDG can't be disabled unless por asserts.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_bor</name>
              <description>Enable bor reset function, default is 0 when power on</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CLK</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000035</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>cke_ledc</name>
              <description>1: Enable ledc module's clock
0: Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_iwdg</name>
              <description>1: Enable iwdg bus clock
0: Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_sdm</name>
              <description>1: Enable 32.768K SDM module's clock
0: Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_rtc</name>
              <description>1: Enable RTC clock
0: Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_atim</name>
              <description>1: Enable AON timer clock
0: Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_aon</name>
              <description>if 0, aon reg(except this bit) , swr/ldo reg will be gated.
Note: AON clock can't be shutdown as analog need.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOOT_REASON_HW</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rstf_plfm1</name>
              <description>This bit will be set to 1 when plfm1 resets . Write 1 to clear.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_thm</name>
              <description>This bit will be set to 1 when Thermal resets the system. Write 1 to clear.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_wdg2_cpu</name>
              <description>This bit will be set to 1 when WDG resets local CPU only. Write 1 to clear.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_wdg1_cpu</name>
              <description>This bit will be set to 1 when WDG resets local CPU only. Write 1 to clear.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_wdg0_cpu</name>
              <description>This bit will be set to 1 when WDG resets local CPU only. Write 1 to clear.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_sys1_cpu</name>
              <description>This bit will be set to 1 when cpu1 resets local CPU. Write 1 to clear.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_sys0_cpu</name>
              <description>This bit will be set to 1 when cpu0 resets local CPU. Write 1 to clear.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_ocp</name>
              <description>This bit will be set to 1 when OCP happen, it will let system enter dslp mode.
 Write 1 to clear.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_warm_km4ns</name>
              <description>This bit will be set to 1 when kr4 warm  resets the system. Write 1 to clear.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_warm_km4tz</name>
              <description>This bit will be set to 1 when km4 warm  resets the system. Write 1 to clear.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_wdg2_glb</name>
              <description>This bit will be set to 1 when WDG resets the system. Write 1 to clear.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_wdg1_glb</name>
              <description>This bit will be set to 1 when WDG resets the system. Write 1 to clear.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_wdg0_glb</name>
              <description>This bit will be set to 1 when WDG resets the system. Write 1 to clear.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_iwdg</name>
              <description>This bit will be set to 1 when WDG resets the system. Write 1 to clear.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_sys1_glb</name>
              <description>This bit will be set to 1 when cpu1 resets the system. Write 1 to clear.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_sys0_glb</name>
              <description>This bit will be set to 1 when cpu0 resets the system. Write 1 to clear.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_dslp</name>
              <description>This is boot reason for dslp exit, clear by SW write to 1.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rstf_bor</name>
              <description>This bit will be set to 1 when BOR resets the system. Write 1 to clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
