Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_AON_WAK_EVT</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rtc_isr_evt</name>
              <description>RTC function interrupt  wake event occurs.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio_pin3_wakdet_evt</name>
              <description>Wake event for wake pin3
1: wake event detected
0: no wake event
Note: aon gpio only used to wake hw pmc, to interrupt SW, it must enable GPIO interrupt in LP GPIO IP, and the poly must be same as AON GPIO setting.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio_pin2_wakdet_evt</name>
              <description>Wake event for wake pin2
1: wake event detected
0: no wake event
Note: aon gpio only used to wake hw pmc, to interrupt SW, it must enable GPIO interrupt in LP GPIO IP, and the poly must be same as AON GPIO setting.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio_pin1_wakdet_evt</name>
              <description>Wake event for wake pin1
1: wake event detected
0: no wake event
Note: aon gpio only used to wake hw pmc, to interrupt SW, it must enable GPIO interrupt in LP GPIO IP, and the poly must be same as AON GPIO setting.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio_pin0_wakdet_evt</name>
              <description>Wake event for wake pin0
1: wake event detected
0: no wake event
Note: aon gpio only used to wake hw pmc, to interrupt SW, it must enable GPIO interrupt in LP GPIO IP, and the poly must be same as AON GPIO setting.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>aon_tim_isr_evt</name>
              <description>AON timer interrupt event occurs.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bor_isr_evt</name>
              <description>bor interrupt event occurs.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chipen_lp_isr_evt</name>
              <description>Chipen long press interrupt event occurs.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chipen_sp_isr_evt</name>
              <description>Chipen short press interrupt event occurs.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TESTING_CFG</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x02000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>icfg_sw</name>
              <description>icfg configured by SIC/SW</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>icfg_sel</name>
              <description>If 1, using icfg_sw to replace trapped icfg value.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>boot_sw</name>
              <description>boot from internal MCM flash</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>boot_nor</name>
              <description>boot from external</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iboot_sw</name>
              <description>iboot configured by SIC/SW</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iboot_sel</name>
              <description>If 1, using iboot_sw to replace trapped iboot value.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TIM_CNT</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aon_tim_cnt_cur</name>
              <description>Aon timer current count value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TIM_SET</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aon_tim_cnt_set</name>
              <description>Set aon time a countdown value, when timer count down, it will trigger a aon_tim event.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TIM_IER</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AON_TIM_IE</name>
              <description>Timer interrupt enable
0:disable
1:enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TIM_ISR</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AON_TIM_ISR</name>
              <description>Timer interrupt status
0:no interrupt
1:interrupt occurs</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GPIO_CTRL</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_WAK_SEL</name>
              <description>Wake pin0 selection
0: PC10 (default)
1: PC11
2: PC12
3: PC13
4: PC14</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_WAKDET_POLY</name>
              <description>Wake pin polarity
0: low active
1: high active
bit1: wake pin1 polarity
bit0: wake pin0 polarity
Note: once a wake pin is set, the pads PU/PD will be force by this poly value, and soft config have no use.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_DBNC_CYC</name>
              <description>The GPIO signal will be filtered by the number of debounce cycles of specified in this register. (100k/128k)</description>
              <bitRange>[22:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_DBNC_FEN</name>
              <description>1: Enable gpio debouncer function
0: Disable
Default disable for simualtion issue</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_WAKE_FEN</name>
              <description>1: Enable wake pin function
0: Disable
Every GPIO has its own enable. 
When aon pmc is not in DSLP, wake pins will not effect PMC state althrougth this bit is set.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GPIO_WAKE_ISR</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_PIN3_WAKE_ISR</name>
              <description>Wake pin3 interrupt status
0:no interrupt
1:interrupt occurs</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_PIN2_WAKE_ISR</name>
              <description>Wake pin2 interrupt status
0:no interrupt
1:interrupt occurs</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_PIN1_WAKE_ISR</name>
              <description>Wake pin1 interrupt status
0:no interrupt
1:interrupt occurs</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_PIN0_WAKE_ISR</name>
              <description>Wake pin0 interrupt status
0:no interrupt
1:interrupt occurs</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CHIPEN_CTRL</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>chipen_st</name>
              <description>CHIP_EN pin status
0: logic '0' on CHIP_EN pin
1: logic '1' on CHIP_EN pin</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chipen_intr_mode</name>
              <description>Chipen operation mode.
00: reset mode. When chipen pad low, hw will reset all chip
01: interrup mode. It will enable short/long press function.
1X: pulse reset mode. The transation from other value to 2'd2 will gen a posedge to set RST_PULSE_EN in HV domain.
Once in pulse reset mode , this field can't be modified again , and always read out 2'b11</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>chipen_tack</name>
              <description>00: 50ms
01: 100ms
10: 200ms
11: 400ms</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>chipen_tlp</name>
              <description>000: 1000ms
001: 1500ms
010: 2000ms
011: 2500ms
100: 3000ms
101: 3500ms
110: 4000ms
111: 4500ms</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>chipen_tsp</name>
              <description>000: 0ms
001: 50ms
010: 100ms
011: 150ms
100: 200ms
101: 250ms
110: 300ms
111: 350ms</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>chipen_tdbc</name>
              <description>000: 0us
001: 100us
010: 500us
011: 1000us
100: 2000us
101: 4000us
110: 8000us
111: 16000us</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CHIPEN_ISR</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHIPEN_LP_ISR</name>
              <description>chipen long press interrupt status
0:no interrupt
1:interrupt occurs</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHIPEN_SP_ISR</name>
              <description>chipen short press interrupt status
0:no interrupt
1:interrupt occurs</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOR_CTRL</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bor_intr_mode</name>
              <description>BOR operation mode.
0: reset mode. When analog detect bor, hw will trigger a bor reset.
1: interrup mode. It will raise an interrup first. If this bit set to 0, then trigger a bor reset.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bor_tdbc</name>
              <description>000: 0us
001: 100us
010: 500us
011: 1000us
100: 2000us
101: 4000us
110: 8000us
111: 16000us</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOR_ISR</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOR_ISR</name>
              <description>BOR interrupt status
0:no interrupt
1:interrupt occurs</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_CTRL</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMC_STL_CLDO</name>
              <description>wait time for core LDO stable
0: 8*T  (T = 10us)
1: 16*T
2: 32*T
3: 64*T</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMC_STL_SWR</name>
              <description>wait time for SWR stable
0: 64*T  (T = 10us)
1: 128*T
2: 256*T
3: 512*T</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_OPT</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0F000070</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>thm_resume_cnt</name>
              <description>After thermal reset happen , it will wait a timer then reboot itself . 
This count unit in 0.65ms</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>aon_ret_en</name>
              <description>Option if aon enter retention mode when DSLP, to save more power
1: when enter to DSLP , aon pmc will shutdown more power
0: as before</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_xtal_mode</name>
              <description>Select xtal mode when xtal used for adc/ctc/comp.
1: Normal
0: LPS</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>snooze_pdck</name>
              <description>Select xtal auto pdck function for sdm calibration use xtal lps mode
1:Enable
0:Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sdm_xtal_mode</name>
              <description>Select xtal mode when xtal used for sdm calibration.
1: Normal
0: LPS</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_WAIT_XTAL</name>
              <description>1: When POF , polling xtal invalid signal and then run forward
0: not polling xtal invalid</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_DSLP_ESCK</name>
              <description>1: Enable all sdm132k/rtc32k clock  when PMC enter deep-sleep mode 
0: Gating part of sdm132k/rtc32k to save power when enter deep sleep</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_DSLP_ERCK</name>
              <description>1: Enable 100K clock for AON register access when PMC enter deep-sleep mode 
0: Disable
Note: Default not used , pmc patch may use it</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PST_DSLP_LDHM</name>
              <description>1: Enable AON LDO enter into sleep mode when  PMC enter deep-sleep mode
0: Disable
Note: Default not used , pmc patch may use it</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_OTP_POWUP_CFG</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>otp_pclk_period</name>
              <description>it is used for otp PCLK period when read operation. it need &gt;=25ns.it is timed by cnt under otp clk. 
for example .
when otp_clk is 4MHz:
0:250ns,meet the require
1:500ns,meet the require</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>otp_powup_sel</name>
              <description>select otp pow up flow is inside control or outside control
0: inside
1: outside</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>otp_powup_cfg</name>
              <description>[0] : penvddr2
[1]: pldo
[2]: pdstb
[3]: ptrim
[4]: pce</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RSVD_FOR_SW1</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_INIC_NP_READY</name>
              <description>Wi-Fi NP initialization ready flag</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AON_RSVD_SW1</name>
              <description></description>
              <bitRange>[30:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP0_1</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR1_G0_3_0</name>
              <description>Instruction1 of AON PMC patch group0</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR0_G0</name>
              <description>Instruction0 of AON PMC patch group0</description>
              <bitRange>[27:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDR_G0</name>
              <description>Start address of the first instruction of AON PMC patch group0</description>
              <bitRange>[9:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_PMC_G0</name>
              <description>Select PMC for this patch group 
0:aon pmc
1:regu pmc</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP0_2</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR2_G0_17_0</name>
              <description>Instruction2 of AON PMC patch group0</description>
              <bitRange>[31:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR1_G0_17_4</name>
              <description>Instruction1 of AON PMC patch group0</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
