Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_PMC_PATCH_GRP1_1</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR1_G1_3_0</name>
              <description>Instruction1 of AON PMC patch group1</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR0_G1</name>
              <description>Instruction0 of AON PMC patch group1</description>
              <bitRange>[27:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDR_G1</name>
              <description>Start address of the first instruction of AON PMC patch group0</description>
              <bitRange>[9:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_PMC_G1</name>
              <description>Select PMC for this patch group 
0:aon pmc
1:regu pmc</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP1_2</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR2_G1_17_0</name>
              <description>Instruction2 of AON PMC patch group1</description>
              <bitRange>[31:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR1_G1_17_4</name>
              <description>Instruction1 of AON PMC patch group1</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP2_1</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR1_G2_3_0</name>
              <description>Instruction1 of AON PMC patch group2</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR0_G2</name>
              <description>Instruction0 of AON PMC patch group2</description>
              <bitRange>[27:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDR_G2</name>
              <description>Start address of the first instruction of AON PMC patch group0</description>
              <bitRange>[9:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_PMC_G2</name>
              <description>Select PMC for this patch group 
0:aon pmc
1:regu pmc</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP2_2</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR2_G2_17_0</name>
              <description>Instruction2 of AON PMC patch group2</description>
              <bitRange>[31:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR1_G2_17_4</name>
              <description>Instruction1 of AON PMC patch group2</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP3_1</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR1_G3_3_0</name>
              <description>Instruction1 of AON PMC patch group3</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR0_G3</name>
              <description>Instruction0 of AON PMC patch group3</description>
              <bitRange>[27:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDR_G3</name>
              <description>Start address of the first instruction of AON PMC patch group0</description>
              <bitRange>[9:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_PMC_G3</name>
              <description>Select PMC for this patch group 
0:aon pmc
1:regu pmc</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP3_2</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR2_G3_17_0</name>
              <description>Instruction2 of AON PMC patch group3</description>
              <bitRange>[31:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR1_G3_17_4</name>
              <description>Instruction1 of AON PMC patch group3</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP4_1</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR1_G4_3_0</name>
              <description>Instruction1 of AON PMC patch group4</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR0_G4</name>
              <description>Instruction0 of AON PMC patch group4</description>
              <bitRange>[27:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDR_G4</name>
              <description>Start address of the first instruction of AON PMC patch group0</description>
              <bitRange>[9:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_PMC_G4</name>
              <description>Select PMC for this patch group 
0:aon pmc
1:regu pmc</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP4_2</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR2_G4_17_0</name>
              <description>Instruction2 of AON PMC patch group4</description>
              <bitRange>[31:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR1_G4_17_4</name>
              <description>Instruction1 of AON PMC patch group4</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP5_1</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR1_G5_3_0</name>
              <description>Instruction1 of AON PMC patch group5</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR0_G5</name>
              <description>Instruction0 of AON PMC patch group5</description>
              <bitRange>[27:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDR_G5</name>
              <description>Start address of the first instruction of AON PMC patch group0</description>
              <bitRange>[9:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_PMC_G5</name>
              <description>Select PMC for this patch group 
0:aon pmc
1:regu pmc</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_PATCH_GRP5_2</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INSTR2_G5_17_0</name>
              <description>HW used only , these are for pmc patch
Note: regu reg 0xF0 must not be used</description>
              <bitRange>[31:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTR1_G5_17_4</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_ADDR01</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00F000F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_patch_addr0</name>
              <description>used for BOD enable addr</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_patch_addr1</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_ADDR23</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00F000F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_patch_addr2</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_patch_addr3</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMC_DBG_FLAG</name>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>regu_pmc_flag_pc</name>
              <description>PMC will raise a debug flag if hw pmc pc value hit this value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SYSRST_MSK</name>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wdg0_rst_opt</name>
              <description>0:by default , km4ns wdg reset only reset syson1 and plfm1
1:km4ns wdg reset will reset syson all</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sysrst_msk_px</name>
              <description>Peri global reset
1: mask pinmux and led pro reset when sys reset happen 
0: reset by sys reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>sysrst_msk_lpon</name>
              <description>Lpon global reset
1: mask LS reset when sys reset happen 
0: reset by sys reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AON_BACKUP0</name>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aon_bk0</name>
              <description>Note , those bits are shared for RTC domain test
used as shift in pattern</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AON_BACKUP1</name>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aon_bk1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AON_BACKUP2</name>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aon_bk2</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AON_BACKUP3</name>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aon_bk3</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOUNDARY_CHK</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xBDC00512</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>HW used only .
Used for access boundary check, AON is 256B which is 000-FF</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_AIP_CTRL0</name>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pmc_opt_dmy</name>
              <description>HW used only , these are for pmc patch</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmc_opt_srst</name>
              <description>1:soft reset(wdg/sys) will trigger aon pmc</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>osc4m_req_force</name>
              <description>force to request osc4m
1:osc4m will never shutdown
0:osc4m will auto shutdown when no IP use it</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>aip_ctrl_rsvd0</name>
              <description>reserved for aip control</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_AIP_INFO0</name>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aip_info_rsvd0</name>
              <description>reserved for aip info indication</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
