Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_CHIP_INFO</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00006955</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>chip_info_en</name>
              <description>Enable Internal Chip Information display.(Don't move 0x74 address , for code is not auto-gen)
0xA: enable.
Others: disable.
Note: CHIP_INFO can be read only if CHIP_INFO_EN[3:0]=0xA, otherwise the read result will return 0x0.</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rl_ver</name>
              <description>CHIP cut verison :
0:  A-cut
1:  B-cut
...</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rl_no</name>
              <description>CHIP RL NUMBER :  0x6955
Note: this field also used by FPGA or Simulation .
0xFFFF: FPGA 
0XFFFE: PXP
0xFFF0: IMG Simulation 0 (when simulation , disable loguart for speedup, disable calibration)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SW_SWD_CTRL</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_swd_spniden</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_swd_spiden</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_swd_niden</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_swd_dbgen</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FPGA_CLK_INFO</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPGA_KM4TZ_CLK</name>
              <description>FPGA KM4TZ clock</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPGA_KM4NS_CLK</name>
              <description>FPGA KM4NS clock</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPGA_PSRAM_CLK</name>
              <description>FPGA PSRAM clock</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPGA_SPIC_CLK</name>
              <description>FPGA SPIC clock</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KM4_XO_CTRL0</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>init_xo_base</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KM4_XO_CTRL1</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>init_xo_top</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SEC_BPC_CTRL</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFBFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bpc_bor</name>
              <description>Select IP controller source : bor
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_chipen</name>
              <description>Select IP controller source : chipen
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_rtc</name>
              <description>Select IP controller source : rtc
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_atim</name>
              <description>Select IP controller source : atim
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_ledc</name>
              <description>Select IP controller source : ledc
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_audio</name>
              <description>Select IP controller source : audio
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_can</name>
              <description>Select IP controller source : can
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_gmac</name>
              <description>Select IP controller source : gmac
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_loguart</name>
              <description>Select IP controller source : loguart
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_uart</name>
              <description>Select IP controller source : uart
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_adc</name>
              <description>Select IP controller source : adc4m
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_dtim</name>
              <description>Select IP controller source : dtim
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_ipc</name>
              <description>Select IP controller source : ipc
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_wdg</name>
              <description>Select IP controller source : wdg
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_gpio</name>
              <description>Select IP controller source : gpio
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_ptim</name>
              <description>Select IP controller source : ptim
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_i2c</name>
              <description>Select IP controller source : i2c
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_spi</name>
              <description>Select IP controller source : spi
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_i3c</name>
              <description>Select IP controller source : irda
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_otpc</name>
              <description>Select IP controller source : otpc
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_ppe</name>
              <description>Select IP controller source : ppe
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_mjpeg</name>
              <description>Select IP controller source : mjpeg
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_lcdc</name>
              <description>Select IP controller source : lcdc
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_pke</name>
              <description>Select IP controller source : pke
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_trng</name>
              <description>Select IP controller source : trng
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_crypto</name>
              <description>Select IP controller source : crypto
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_pwm</name>
              <description>Select IP controller source : pwm
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_ltim</name>
              <description>Select IP controller source : ltim
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_dmac</name>
              <description>Select IP controller source : dmac
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_sdio</name>
              <description>Select IP controller source : sdio
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_usb</name>
              <description>Select IP controller source : usb
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SEC_PPC_CTRL</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFF80FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bpc_bt</name>
              <description>Select IP controller source : bt
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_wl</name>
              <description>Select IP controller source : wl
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_psram</name>
              <description>Select IP controller source : psram
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_spic</name>
              <description>Select IP controller source : spic
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_cpu1</name>
              <description>Select IP controller source : cpu1
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_cpu0</name>
              <description>Select IP controller source : cpu0
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_swrst</name>
              <description>Select IP controller source : rst
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_pmc</name>
              <description>Select IP controller source : pmc
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bpc_qspi</name>
              <description>Select IP controller source : qspi
1:control by nonsec zone
0:control by secure zone</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pcr_prot_k3</name>
              <description>Retention Mem last forth 256 bit protect
0: read and write , 
1 : read only</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pcr_prot_k2</name>
              <description>Retention Mem last third 256 bit protect
0: read and write , 
1 : read only</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pcr_prot_k1</name>
              <description>Retention Mem last second 256 bit protect
0: read and write , 
1 : read only</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pcr_prot_k0</name>
              <description>Retention Mem last 256 bit protect (located in last 256bit of retention memory)
0: read and write , 
1 : read only</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppc_aret</name>
              <description>IP slave port R/W secure ctrl
[0]: wr prot ctrl ,   0: secure only , 1: both
[1]: rd prot ctrl , 0:secure only , 1:both</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppc_wdg</name>
              <description>IP slave port R/W secure ctrl
[0]: wr prot ctrl ,   0: secure only , 1: both
[1]: rd prot ctrl , 0:secure only , 1:both</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppc_mmu</name>
              <description>IP slave port R/W secure ctrl
[0]: wr prot ctrl ,   0: secure only , 1: both
[1]: rd prot ctrl , 0:secure only , 1:both</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppc_mem</name>
              <description>IP slave port R/W secure ctrl
[0]: wr prot ctrl ,   0: secure only , 1: both
[1]: rd prot ctrl , 0:secure only , 1:both</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppc_pad</name>
              <description>IP slave port R/W secure ctrl
[0]: wr prot ctrl ,   0: secure only , 1: both
[1]: rd prot ctrl , 0:secure only , 1:both
Note:this control both of pinmux and ledc, for they are in same reset domain.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppc_rtc</name>
              <description>IP slave port R/W secure ctrl
[0]: wr prot ctrl ,   0: secure only , 1: both
[1]: rd prot ctrl , 0:secure only , 1:both</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppc_sdm</name>
              <description>IP slave port R/W secure ctrl
[0]: wr prot ctrl ,   0: secure only , 1: both
[1]: rd prot ctrl , 0:secure only , 1:both</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppc_aip</name>
              <description>IP slave port R/W secure ctrl
[0]: wr prot ctrl ,   0: secure only , 1: both
[1]: rd prot ctrl , 0:secure only , 1:both</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CPU0_PC</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4tz_dbg_pc</name>
              <description>cpu0 pc value for debug which is pc[31:2]</description>
              <bitRange>[31:2]</bitRange>
              <access>read-only</access>
            </field>
            <field protection="s">
              <name>km4tz_dbg_pc_en</name>
              <description>debug enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CPU1_PC</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>km4ns_dbg_pc</name>
              <description>cpu1 pc value for debug which is pc[31:2]</description>
              <bitRange>[31:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>km4ns_dbg_pc_en</name>
              <description>debug enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
