Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_PLAT_CTRL</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000208</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>crypto_clk_opt</name>
              <description>1X: always ON
01: always OFF
00: controlled by internal ICG</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4ns_sev_in</name>
              <description>cpu1 sev input, posedge of this bit will trig cpu1 event</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4tz_sev_in</name>
              <description>cpu0 sev input, posedge of this bit will trig CPU0 event</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>SPI1_MST</name>
              <description>1: SPI1 used as master
0: SPI1 used as slaver</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>SPI0_MST</name>
              <description>1: SPI0 used as master
0: SPI0 used as slaver</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIC_SPDUP_SIM</name>
              <description>1: SPIC will wait 256 spic_clk cycles before ready
0: SPIC will wait 2^16 spic_clk  cycles before ready</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>psram_spdup_sim</name>
              <description>psramc simulatin speedup enable.
Nouse because config form not specified .</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>qspi_spdup_sim</name>
              <description>qspi simulation speedup enable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gdma0_ccm</name>
              <description>GDMA0 clock control mode</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppe_glb_sus</name>
              <description>Assert this bit to suspend PPE, active high</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARE_BT_MEM</name>
              <description>1: Enable KM4 to share BT memory</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARE_WL_MEM</name>
              <description>1: Enable KM4 to share WL memory</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KM4NS_RETENTION_MODE</name>
              <description>1: Enable, when CPU1 reset, cache will not be cleared 
0: Disable, when CPU1 reset, cache will be cleared by HW</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KM4TZ_RETENTION_MODE</name>
              <description>1: Enable, when CPU0 reset, cache will not be cleared 
0: Disable, when CPU0 reset, cache will be cleared by HW</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>sys_retention_save</name>
              <description>1: save data</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>sys_retention_load</name>
              <description>1: restore data</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ppe_clk_opt</name>
              <description>ppe clock option</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hs_sram2_rd_weight</name>
              <description>Excuted read command number continuously if both read and write command reached
This is for bt/wl share_ram</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hs_sram0_rd_weight</name>
              <description>Excuted read command number continuously if both read and write command reached
This is for hs_ram 512K</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>plfm0_isolation_enable</name>
              <description>1:plfm1 -&gt; plfm0 access will be blocked</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>HUK_PROT</name>
              <description>0: only cpu can read HUK key
1: no one can read HUK key
This bit will be latch to high when it was write to 1 until reset again .</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PLAT_STATUS</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pke_attr</name>
              <description>pke key secure attribute</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pke_key_mask</name>
              <description>pke key0 mask mode
00:no mask
01:mask high 128bit
10:mask high 256bit
11:no mask</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>init_xo_range_en</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4tz_rst_halt</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4ns_rst_halt</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4tz_share_cache_mem</name>
              <description>0: km4tz cache memory used as cache
1: km4tz cache memory used as dtcm</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4ns_share_cache_mem</name>
              <description>0: km4ns cache memory used as cache
1: km4ns cache memory used as dtcm</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>km4ns_dbgrestarted_m</name>
              <description>km4ns debug restart status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>km4ns_dbg_mode</name>
              <description>km4ns halt status</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>km4ns_lockup_m</name>
              <description>km4ns lockup status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>km4ns_slp_mode</name>
              <description>km4ns sleep status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>km4tz_dbgrestarted_m</name>
              <description>km4tz debug restart status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>km4tz_dbg_mode</name>
              <description>km4tz halt status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>km4tz_lockup_m</name>
              <description>km4tz lockup status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>km4tz_slp_mode</name>
              <description>km4tz sleep status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SYSTEM_CFG0</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eng_mode</name>
              <description>Indicate PKG_ENG_SEL pad value
0: normal package; 1: engineering mode</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>usb_pll_valid</name>
              <description>Indicator usb pll is ready,not used in RL6955</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>xtal_valid</name>
              <description>Indicator xtal 40M is ready</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sys_pll_valid</name>
              <description>Indicator sys pll is ready</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ptrp_boot_nor</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ptrp_boot_int</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ptrp_icfg</name>
              <description>Trapped ICFG data value
0: normall mode
XXXX: the other mode (Test Mode)</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ptrp_uartdl</name>
              <description>Power on trapped uart download value
0: Normal boot
1: uartdownload boot
TODO: it may be overwrited by efuse autoload</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ptrp_tmode</name>
              <description>0: normal mode
1: test mode</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ptrp_otpbyp</name>
              <description>1: force efuse autoload fail</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>hw_cpu_id</name>
              <description>Different CPU reading this register will return different value.
If read by KR4: return 0
If read by KM4: return 1
Other will return 2</description>
              <bitRange>[7:6]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_32K_CTRL0</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0200007F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_mldo_req_trig</name>
              <description>level -&gt; pulse. Write to 1 to update BT analog 1.8V LDO request when BT is active (load BT_mldo_mode_nm). need to write 0 before next request</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_mldo_mode_lps</name>
              <description>mem ldo mode slep option 
00:off
01:sleep
10:normal + dummy
11:normal + no dummy</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_mldo_mode_nm</name>
              <description>mem ldo mode normal option 
00:off
01:sleep
10:normal + dummy
11:normal + no dummy</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_WAKE_BT_PMC_EN</name>
              <description>1: host_wakt_bt will wake bt_misc pmc, and then wake BTTOP (wait SWR/XTAL/PLL ready)
0: host_wakt_bt wake BTTOP and then rif_oscenout wake bt_misc pmc</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dwtim_srstn_chn</name>
              <description>sw reset for bt dw channel ,active 0
default all channel will release after dw timer function enable</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_KR4_CTRL</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x71000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ckd_bt_pll_40m</name>
              <description>pll divider for BT
0: Not support
1: div2
...
DIV_MIN:1</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_en_pon_req_regu</name>
              <description>1: enable to change BT regu_sts request during BT active</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_en_pwm_load</name>
              <description>1:when bt enter normal , it will enable pwm high loading option
0:pwm loading change effect by bt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_CTRL0</name>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xC090C488</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_SWR_STS_NM</name>
              <description>SET SWR state when BT in active mode
000: RSVD     
001: state1  0.7/PC/PFM
010: state2  0.8/PC/PFM 
011: state3  0.9/PC/PFM
100: state4  0.9/SLP/PFM  
101: state5  0.9/SLP/PWM 
110: state6  0.9/NORM/PWM 
111: state7  1.0/NORM/PWM</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BTWL_USE_LOGUART_PAD_ST</name>
              <description>The state of xor of WL_USE_REQ and BT_USE_REQ.
0: loguart use loguart trx pad
1: bt hci use loguart trx pad</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WL_MP_STATUS</name>
              <description>Wi-Fi MP status</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_USE_EXT_BT</name>
              <description>1: select external BT
0: select internal BT</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_USE_REQ</name>
              <description>who uses loguart  trx pad depends on the xor of WL_USE_REQ and BT_USE_REQ, wifi can send use request by change the value of WL_USE_REQ</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LOGUART_USE_LOGUART_PAD_B</name>
              <description>Force wifi soc to use loguart pad mandatory if necessary
0: loguart use loguart trx pad
1: who uses loguart trx pad depends on BTWL_USE_LOGUART_PAD_ST</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_XTAL_MODE_NM</name>
              <description>SET XTAL state when BT in active mode
000: XTAL OFF
001: XTAL LPS, gating XTAL 40M
010: XTAL LPS, enable XTAL 40M
011: XTAL NM mode
100: XTAL HP mode</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_EN_TST_SI_CTRL_RFC</name>
              <description>进入Test Mode 8 , 且同時 BT_EN_TST_SI_CTRL_RFC=1 , 才將RFC 端的SI  3 wire交由專線BT_SI_*_TST 控制;
若I2C 想要access RFC,设置BT_EN_TST_SI_CTRL_RFC=0 或者 將BT_SI_ENB_TST pull high(如果BT_SI_ENB_TST 有出 PIN)</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_USE_EXT_UART</name>
              <description>1: BT use external uart
0: BT use internal uart</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_CTRL_RFC_SEL_SI</name>
              <description>Normal mode 或者Test Mode 2,通过此寄存器选择RFC的控制端. BT_CTRL_RFC_SEL_SI = 1,將RFC 端的SI  3 wire交由專線BT_SI_*_TST 控制;BT_CTRL_RFC_SEL_SI = 0,將RFC 端的SI  3 wire交由 I2C 控制.
BT_CTRL_RFC_SEL_SI = 1时,也可通过将BT_SI_ENB_TST pull high,交由PI控制</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOT_RSVD_BT_SW1</name>
              <description>RSVD for sotfware</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOT_RSVD_BT_SW2</name>
              <description>RSVD for sotfware</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_WAKE_HOST_POL</name>
              <description>1:BT_WAKE_HOST to CPU and pinmux 0:pinmux to CPU for external trig</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_WAKE_BT_POL</name>
              <description>1:HOST_WAKE_BT to BT and pinmux 0:pinmux to BT for external trig</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_WAKE_BT</name>
              <description>CPU set this bit to 1 to wake BT</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_XTAL_MODE_LPS</name>
              <description>SET XTAL state when BT in LPS mode
000: XTAL OFF
001: XTAL LPS, gating XTAL 40M
010: XTAL LPS, enable XTAL 40M
011: XTAL NM mode
100: XTAL HP mode</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_I2C_TEST_EN</name>
              <description>SW control BT enter I2C test mode</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_MEM_PWRC_LPS</name>
              <description>BT DMEM/BFMEM power mode control in SLEEP.
Setted before chip goes to SLEEP.Used to controll power mode of BT memory group when chip is in SLEEP.
For FTC_ULP mem, pwr_lps[2:0] map to {SLP,RET,NAP};
For SNPS mem, pwr_lps[2:0] map to {SD,DS,LS}.
  000 - active
  001 - light sleep
  010 - deep sleep
  100 - shut down</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_BT_OFF_PARAM</name>
              <description>level -&gt; pulse. Write to 1 to disable XTAL and SWR, before BT OFF. Before Write to 1 or after BT OFF,need to write to 0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_SYS_BTDBG_SEL</name>
              <description>0: select debug port from BTTOP
1: debug_port[31:18] from bt_misc; else from BTTOP</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSWR_REF_BT</name>
              <description>core swr parameter refer BT status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_SWR_STS_LPS</name>
              <description>SET SWR state when BT in LPS mode
000: RSVD     
001: state1  0.7/PC/PFM
010: state2  0.8/PC/PFM 
011: state3  0.9/PC/PFM
100: state4  0.9/SLP/PFM  
101: state5  0.9/SLP/PWM 
110: state6  0.9/NORM/PWM 
111: state7  1.0/NORM/PWM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
