Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_BT_CTRL1</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00008000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_CKSL_CKANA</name>
              <description>1: enable osc4m when BT enter LPS
0: switch bt_ana_clk from osc4m to ana_100k when BT enter LPS</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_PMC_STATE</name>
              <description>indicate bt_misc PMC current state, for debug</description>
              <bitRange>[14:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_I2C_CTRL</name>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>i2c1_rx_swap</name>
              <description>I2C1 RX swap control</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2c1_tx_swap</name>
              <description>I2C1 TX swap control</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2c0_rx_swap</name>
              <description>I2C0 RX swap control</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2c0_tx_swap</name>
              <description>I2C0 TX swap control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DW_GPIO_CTRL</name>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>gpio_reg_opt</name>
              <description>gpio data out/oe register function option
0: DR/DDR reg function are same as DW GPIO spec
1: DR/DDR reg  func changes , 0:not toggle , 1:toggle current value</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_divcnt_pc</name>
              <description>divider for dw gpioc debounce clk</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_divcnt_pb</name>
              <description>divider for dw gpiob debounce clk</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_divcnt_pa</name>
              <description>divider for dw gpioa debounce clk</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SDIO_CTRL</name>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000180</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sdio_bt_en</name>
              <description>enable sdio bt function(fn2)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sdd_update_fw</name>
              <description>enable updating firmware via sdio</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sdd_ahbm_nonsec</name>
              <description>sdio wifi ahb mster
0: sec, 1: non-sec,</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sdd_pmux_fen</name>
              <description>after sdio pinmux is configured, set this bit to 1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SIC_DBNC</name>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sic_dbnc_cyc</name>
              <description>SIC clk/data input debounce cycle , base on 4M clock</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sic_dbnc_fen</name>
              <description>SIC clk/data input debounce enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SPIC_CTRL</name>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>flash_pg_do_ctrl</name>
              <description>1: disable spic do output enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPHY_RD_DELAY_CNT</name>
              <description>spic_dphy output dealy cnt,
when set &lt; 3, output data will occur at fourth or fifth axi clock from the rising edge of spi_rx_data_en; when set &gt;= 3, data  will occur after  DPHY_RD_DELAY_CNT + 2 axi clock from the rising edge of spi_rx_data_en</description>
              <bitRange>[20:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPHY_EN</name>
              <description>when set, enable spic_dphy function to read data from flash</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_CAL_EN</name>
              <description>Flash calibration enable
1: delay flash sout for calibration
0: bypass flash sout to spic</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ecc_icg_disable</name>
              <description>Disable NAND ECC auto icg to save power
1:disable , no gating
0:enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PSRAMC_FLASH_CTRL</name>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>flash_feedback_loc</name>
              <description>0: pinmux S0 -&gt; flash_spic, pinmux S1 -&gt; psram_spic(if psramc_flash_en)
1: pinmux S1 -&gt; flash_spic, pinmux S0 -&gt; psram_spic(if psramc_flash_en)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>psramc_flash_en</name>
              <description>use psram_spic as flash controller, disable psram_phy</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>psram_pdex_cmd</name>
              <description>psram_spic excute this cmd when receiving pdex_req
1: enter low power state
0: exit low power state</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>psram_pdex_req</name>
              <description>write 1 to trigger psram_spic excuting pdex_cmd, auto clear 0 when pdex_cmd is done</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>psram_frqc_en</name>
              <description>enable psram auto freq change control flow</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>psram_frqc_done</name>
              <description>indicate psram auto freq change is done</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field protection="s">
              <name>psram_frqc_grp</name>
              <description>select psram auto freq change group</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PSRAMC_DPHY_RD_DELAY_CNT</name>
              <description>spic_dphy output dealy cnt,
when set &lt; 3, output data will occur at fourth or fifth axi clock from the rising edge of spi_rx_data_en; when set &gt;= 3, data  will occur after  DPHY_RD_DELAY_CNT + 2 axi clock from the rising edge of spi_rx_data_en</description>
              <bitRange>[20:17]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PSRAMC_DPHY_EN</name>
              <description>when set, enable spic_dphy function to read data from flash</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>PSRAMC_FLASH_CAL_EN</name>
              <description>Flash calibration enable
1: delay flash sout for calibration
0: bypass flash sout to spic</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>flash_pdex_cmd</name>
              <description>flash_spic excute this cmd when receiving pdex_req
1: enter low power state
0: exit low power state</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>flash_pdex_req</name>
              <description>write 1 to trigger flash_spic excuting pdex_cmd, auto clear 0 when pdex_cmd is done</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SOFT_DUMMY</name>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>USED for SW</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LXBUS_DBG_CTRL</name>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lx1_lock_ok</name>
              <description>lock lx1 bus lock ok</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>lx1_lock_bus</name>
              <description>lock lx1 bus for debug</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bustimeout</name>
              <description>lx sys bus arb timeout thresh</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>enbustimeout</name>
              <description>lx sys bus arb timeout enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GMAC_LX_TIMEOUT_CTRL</name>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>gmac_lx_timeout_en</name>
              <description>lxbus timeout enable in gmac</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gmac_lx_timeout_sel</name>
              <description>sel lxbus tiomeout in gmac</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GMAC_LX_TIMEOUT_STATUS</name>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>gmac_lx_mst_timeout</name>
              <description>lxbus master timeout status in gmac</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gmac_lx_slv_timeout</name>
              <description>lxbus slave timeout status in gmac</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_P1</name>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>USED for SW</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOOT_ADDR_KM4TZ</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>USED for SW</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOOT_ADDR_KM4NS</name>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>USED for SW</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_09</name>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xBDC10512</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>HW used only ,
Used for access boundary check, SYSON is 512B which is 000-1FF.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_10</name>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00F0C000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aip_info_rsvd1</name>
              <description>reserved for aip info indication</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>aip_ctrl_rsvd1</name>
              <description>reserved for aip info indication</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dummy</name>
              <description>Reserved for HW ECO</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dvp_dummy_data_en</name>
              <description>dvp dummy data enable
1: enable extra dummy data fliter, only work in the end of frame
0: disable extra dummy data fliter, only flitir out 0xffff</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dvp_dummy_data</name>
              <description>dvp dummy data</description>
              <bitRange>[12:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>otpc_dslp_trig</name>
              <description>It can trig OTP to accelerate power-off.</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>auxadc_vccoffb</name>
              <description>1: enable auxadc power cut
0: shutdown auxadc all power cut for power saving
when scan mode , it will tie0,  also ISO signal must tie 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dummy</name>
              <description>Reserved for HW ECO</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>xtal_bus_isolation</name>
              <description>plfm1 write to xtal bus isoable enable.
1: disable bus access
0: enable bus access
Note: this bit only assert when plfm1 pre-reset happen to protect bus mistake</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>plfm1_reset_confirm</name>
              <description>cpu0 write this bit to 1 to confirm plfm1 reset enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
