Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_SYS_1</name>
      <groupName>LP_SYS</groupName>
      <baseAddress>0x41000200</baseAddress>
      <size>0x00000100</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_PWC</name>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>psw_out_shrm</name>
              <description>ShareMem domain power switch status
1: power on
0: power off
Note:there are two group</description>
              <bitRange>[13:12]</bitRange>
              <access>read-only</access>
            </field>
            <field protection="s">
              <name>psw_out_bt</name>
              <description>BT domain power switch status
1: power on
0: power off
Note:there are two group</description>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>psw_out_soc</name>
              <description>SOC domain power switch status
1: power on
0: power off
Note:there are two group</description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pwc_soc_req</name>
              <description>pwc soc req arb result</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pwc_soc_st</name>
              <description>pwc soc arb result state</description>
              <bitRange>[6:4]</bitRange>
              <access>read-only</access>
            </field>
            <field protection="s">
              <name>pwc_shrm</name>
              <description>BT share mem power cut control 
1: Enable BT share mem power (mux + mbis + cell)
0: Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>pwc_bt</name>
              <description>This is BT function total power cut control 
1: Enable BT power cut
0: Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>pow_on_soc</name>
              <description>1:SYS PMC request to enable HP SOC power cut and diable ISO
0: SYS PMC request to disable HP SOC power cut and enable ISO</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ISO</name>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>fen_soc</name>
              <description>1: enable hs soc sytem
0: disable hs soc system 
(Note: used as soc power on reset)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>iso_shrm</name>
              <description>1: isolate signals from PD_SHRM to other power domain
0: release iso</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>iso_bt</name>
              <description>1: isolate signals from PD_BT to other power domain
0: release iso</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iso_soc_req</name>
              <description>isolate signals from PD_SOC to other power domain. It is arb result</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FEN_GRP0</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>fen_pke</name>
              <description>1: enable pke module
0: reset
No use</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_pwm</name>
              <description>1: enable PWM TIMER function
0: disable
[4:1]:pwm
[0]:pulse</description>
              <bitRange>[27:23]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sdd</name>
              <description>1: enable sdio device function
0: disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sport</name>
              <description>1: enable SPORT function
0: disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_gmac</name>
              <description>1: enable ppe module
0: reset
No use</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_trng</name>
              <description>1: enable TRNG function
0: disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_can</name>
              <description>1: enable can0/1 module
0: reset
No use</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_spi</name>
              <description>1: enable SPI1 function
0: disable</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_psram</name>
              <description>1: enable PSRAM function
0: disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_lcdc</name>
              <description>1: enable ppe module
0: reset
No use</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_spic</name>
              <description>Flash spic function enable
1: enable flash
0: disable flash</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_crypto</name>
              <description>1: enable IPSEC (AES + HMAC) function
0: disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_ppe</name>
              <description>1: enable ppe module
0: reset
No use</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_dmac</name>
              <description>1: enable GDMA function
0: disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_ipc_p1</name>
              <description>1: enable IPC function
0: reset</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_ipc</name>
              <description>1: enable IPC function
0: reset</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_cpu0</name>
              <description>1: enable cpu0 (KM4TZ)
0: reset</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_cpu1</name>
              <description>1: enable cpu1 (KM4NS)
0: reset</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_plfm1</name>
              <description>1: enable platform1
0: reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_plfm0</name>
              <description>1: enable platform0
0: reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FEN_GRP1</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00540000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>fen_qspi</name>
              <description>1: enable qspi function
0: disable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_i3c</name>
              <description>1: enable i3c function
0: disable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_ptim</name>
              <description>pmc_timer function enable
1: enable
0: disable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_ptim_p1</name>
              <description>pmc_timer function enable
1: enable
0: disable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_adc</name>
              <description>lp adc  function enable
1: enable
0: disable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb</name>
              <description>usb core function enable
1: enable
0: disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_shrm</name>
              <description>BT share memory function enable
1: enable
0: disable
Note:this is same as PD_SHRM power reset</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_dtim</name>
              <description>Debug timer function enable
1: enable
0: disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_jpg</name>
              <description>mjpeg  function enable
1: enable
0: disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_dvp</name>
              <description>dvp function enable
1: enable
0: disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_ltim_p1</name>
              <description>Basic Timer4-5 function enable for plfm1
1: enable
0: disable</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_ltim</name>
              <description>Basic Timer0-3 function enable for plfm0
1: enable
0: disable</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_i2c</name>
              <description>I2C1  function enable
1: enable
0: disable</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_uart_p1</name>
              <description>Uart function enable for BT
1: enable
0: disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_uart</name>
              <description>Uart function enable 
1: enable
0: disable</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_loguart</name>
              <description>Uartlog function enable
1: enable
0: disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_gpio</name>
              <description>SGPIO  function enable
1: enable
0: disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sic</name>
              <description>1: enable SIC function
0: reset</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_wlafe_ctrl</name>
              <description>WL RFAFE control function enable
1: enable
0: disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_bton</name>
              <description>BTON function enable
1: enable
0: disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_wlon</name>
              <description>WLON  function enable
1: enable
0: disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKE_GRP0</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x20401A26</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>cke_pke</name>
              <description>1: enable pke clk
0: reset
No use</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_pwm</name>
              <description>1: Enable PWM TIMER clock
0: Disable
[1] : pwm timer
[0] : pulse timer</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_sdd</name>
              <description>1: Enable sdio dev clock
0: Disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_shperi</name>
              <description>1: Enable shperi clock
0: Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_sport</name>
              <description>1: Enable sport clock
0: Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_trng</name>
              <description>1: Enable trng bus clock
0: Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_can</name>
              <description>1: Enable can0/1 bus clock
0: Disable</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_spi</name>
              <description>1: Enable spi clock
0: Disable</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_psram</name>
              <description>1: Enable PSRAM pll divider clock
0: Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_sram</name>
              <description>1: Enable sram clock
0: Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_rom</name>
              <description>1: Enable rom clock
0: Disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_spic</name>
              <description>1: Enable FLASH pll divider clock
0: Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_lcdc</name>
              <description>1: Enable lcdc pll  clock
0: Disable
Note: lcdc/mipi all use this cke</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_crypto</name>
              <description>1: Enable ipsec (AES + HMAC) clock
0: Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_otpc</name>
              <description>1: Enable OTPC clock
0: Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_dmac</name>
              <description>1: Enable GDMA0 clock
0: Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_ipc</name>
              <description>1: Enable IPC clock
0: Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_cpu0</name>
              <description>1: Enable hp KM4 cpu0 clock
0: Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_cpu1</name>
              <description>1: Enable lp  KM4 cpu1 clock
0: Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_hperi</name>
              <description>1: Enable HPERI pll divider clock
0: Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_lperi</name>
              <description>1: Enable peri_lclk  clock all
0: Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_lpon</name>
              <description>1.Enable lpon clk
0: Disable
Note: this bit is controlled HW PMC, SW shall not modify</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
