Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_CKE_GRP1</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x06E00004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>cke_ppe</name>
              <description>1: Enable ppe clock
0: Disable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_i3c</name>
              <description>1: Enable i3c clock
0: Disable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_wmac</name>
              <description>1: Enable WMAC AXI and AHB bus clock
0: Disable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_ptim</name>
              <description>1: Enable pmc timer clock
0: Disable</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_adc</name>
              <description>1: Enable LS ADC clock
0: Disable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_usb</name>
              <description>1: Enable usb core clock
0: Disable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_gmac</name>
              <description>1: Enable gmac  clock
0: Disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_dtim</name>
              <description>1: Enable LS dtim clk
0: Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_qspi</name>
              <description>1: Enable qsip clock
0: Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_jpg</name>
              <description>1: Enable jpg clock
0: Disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_dvp</name>
              <description>1: Enable dvp clock
0: Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_ltim_p1</name>
              <description>LS basic Timer4-5 clk enable for plfm1
0: Disable</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_ltim</name>
              <description>LS basic Timer0-3 clk enable
0: Disable</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_i2c</name>
              <description>1: Enable HS I2C0 clock
0: Disable
[1]: i2c1
[0]: i2c0</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_uart_p1</name>
              <description>1: Enable Uart clock  for uart3
0: Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_uart</name>
              <description>1: Enable Uart clock 
0: Disable</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_loguart</name>
              <description>1: Enable Uartlog clock
0: Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_gpio</name>
              <description>1: Enable GPIO clock
0: Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_sic</name>
              <description>1: Enable SIC clock
0: Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_wdg</name>
              <description>1: Enable wdg bus clock
0: Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_bton</name>
              <description>1: Enable BTON clock
0: Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_wlon</name>
              <description>1: Enable WLON clock
0: Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKE_GRP2</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00003000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>cke_bt_32k</name>
              <description>1.Enable bt 32k enable
0: Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_sys_32k</name>
              <description>1.Enable system/wifi 32k enable
0: Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_ret</name>
              <description>1.Enable Some IP's clock who has retention function when pmc state change
0: Disable
Note: this bit is controlled HW PMC, SW shall not modify</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cke_osc2m_soc</name>
              <description>1.Enable 2M clk path for soc clk
0: Disable
Note: this bit is controlled HW PMC, SW shall not modify</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKSL_GRP0</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x07C37DA2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>cksl_dvpm</name>
              <description>dvpm clock select
##0: sys_pll
##1: usb_pll</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_dvp</name>
              <description>dvp clock select
##x0: xtal
##01: sys_pll
##11: usb_pll</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_i3c</name>
              <description>i3c clock select
##x0: xtal
##01: sys_pll
##11: usb_pll</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_gmac</name>
              <description>gmac clock select
##x0: ext50m
##01: sys_pll( 400M for gmac path)
##11: usb_pll</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_vo</name>
              <description>vo clock select
##x0: xtal
##01: sys_pll
##11: usb_pll</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_can</name>
              <description>can clock select
##x0: xtal
##01: sys_pll
##11: usb_pll</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_shperi</name>
              <description>peri_shclk clock select
##x0: xtal
##01: sys_pll
##11: usb_pll</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_psram</name>
              <description>psram clock select
##x0: xtal
##01: sys_pll
##11: usb_pll</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_spic</name>
              <description>spic clock select
##x0: xtal
##01: sys_pll
##11: usb_pll</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_hperi</name>
              <description>hperi clock seletion
##x0: xtal
##01: sys_pll
##11: usb_pll</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_otpc</name>
              <description>otpc clock selection
##0: osc4m
##1: xtal
Note: this bit will be set by pmc auto, when SW use otp, 
it will be set to 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_lperi</name>
              <description>LPERI clock select
##0: osc4m
##1: xtal_40m</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_hp</name>
              <description>HP clock select,used for KM4 and sram
##x0: xtal
##01: sys_pll
##11: usb_pll</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKSL_GRP1</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00027F00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>cksl_ltim5</name>
              <description>LS timer 5 clock source select
##0: sdm32k
##1: xtal
Note:using XTAL divider out , which can be 40M/N  (N=2~63)</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_ltim4</name>
              <description>LS timer 4 clock source select
##0: sdm32k
##1: xtal
Note:using XTAL divider out , which can be 40M/N  (N=2~63)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_ltim3</name>
              <description>LS timer 3 clock source select
##0: sdm32k
##1: xtal
Note:using XTAL divider out , which can be 40M/N  (N=2~63)</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_ltim2</name>
              <description>LS timer 2 clock source select
##0: sdm32k
##1: xtal
Note:using XTAL divider out , which can be 40M/N  (N=2~63)</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_ltim1</name>
              <description>LS timer 1 clock source select
##0: sdm32k
##1: xtal
Note:using XTAL divider out , which can be 40M/N  (N=2~63)</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_ltim0</name>
              <description>LS timer 0 clock source select
##0: sdm32k
##1: xtal
Note:using XTAL divider out , which can be 40M/N  (N=2~63)</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_bt_32k</name>
              <description>BT 32k clk source selection
##0:  osc131k
##1:  xtal312p5k</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_sys_32k</name>
              <description>system/wifi 32k clk source selection
##0:  osc131k
##1:  xtal312p5k</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_loguart</name>
              <description>Select loguart's input clock
##0: osc4m
##1: xtal</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_uart3</name>
              <description>Select uart's input rx clock
##0: osc2m
##1: xtal
Note:tx input clock is always xtal , and divided in uart IP</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_uart2</name>
              <description>Select uart's input rx clock
##0: osc2m
##1: xtal
Note:tx input clock is always xtal , and divided in uart IP</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_uart1</name>
              <description>Select uart's input rx clock
##0: osc2m
##1: xtal
Note:tx input clock is always xtal , and divided in uart IP</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_uart0</name>
              <description>Select uart's input rx clock
##0: osc2m
##1: xtal
Note:tx input clock is always xtal , and divided in uart IP</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_adc4m</name>
              <description>lp adc 4m clk selection
##0:  osc4m
##1:  xtal
Note:when select xtal , it must set divider</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_dtim</name>
              <description>dtim clock selection 
##0: sdm32k
##1: xtal
Note:when select to xtal, it will divided to 1M fixed</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_adc</name>
              <description>ADC INT clock selection
##0: bus_clk
##1: ip_clk</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_gpio</name>
              <description>GPIO INT clock selecton:
##0: bus_clk
##1: ip_clk</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>cksl_gpio4m</name>
              <description>gpio ip using 4m clk selection
##0:  sdm32k
##1:  osc4m</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKD_GRP0</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x27270000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>ckd_xtal_ltim5</name>
              <description>LS timer xtal clock divider when cksl_ltim = 1
0: not support
1: div2
n: divider is n+1
DIV_MIN:1</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_xtal_ltim4</name>
              <description>LS timer xtal clock divider when cksl_ltim = 1
0: not support
1: div2
n: divider is n+1
DIV_MIN:1</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_xtal_adc</name>
              <description>xtal 4m divider for adc 
Default is /1 which output 40M</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sram</name>
              <description>sram clock divider, it is based on  hp_clk
0: div1
1: div2
2: div3
3/other: divider by this value + 1
DIV_MIN:0</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_rom</name>
              <description>rom clock divider, it is based on  hp_clk
0: div1
1: div2
2: div3
3/other: divider by this value + 1
DIV_MIN:0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKD_TIMER_GRP0</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x27272727</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>ckd_xtal_ltim3</name>
              <description>LS timer xtal clock divider when cksl_ltim = 1
0: not support
1: div2
n: divider is n+1
DIV_MIN:1</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_xtal_ltim2</name>
              <description>LS timer xtal clock divider when cksl_ltim = 1
0: not support
1: div2
n: divider is n+1
DIV_MIN:1</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_xtal_ltim1</name>
              <description>LS timer xtal clock divider when cksl_ltim = 1
0: not support
1: div2
n: divider is n+1
DIV_MIN:1</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_xtal_ltim0</name>
              <description>LS timer xtal clock divider when cksl_ltim = 1
0: not support
1: div2
n: divider is n+1
DIV_MIN:1</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKD_TIMER_GRP1</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00270000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>ckd_xtal_dtim</name>
              <description>xtal 1m divider for dtim 
Default is /40 which output 1M</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKD_FEN_XTAL</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000007</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>fen_xtal_ltim</name>
              <description>enable xtal divider for ltim[5:0] use
1:enable
0:disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_xtal_dtim</name>
              <description>enable xtal divider for dtim use
1:enable
0:disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_xtal_adc</name>
              <description>enable xtal divider for adc use
1:enable
0:disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
