Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_CKD_FEN_sys_pll</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>fen_sys_pll_dvpm</name>
              <description>sys_pll_divider for dvpm enable
1:enable
0:disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_dvp</name>
              <description>sys_pll_divider for dvp enable
1:enable
0:disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_i3c</name>
              <description>sys_pll_divider for i3c enable
1:enable
0:disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_gmac</name>
              <description>sys_pll_divider for gmac enable
1:enable
0:disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_vo</name>
              <description>sys_pll_divider for vo enable
1:enable
0:disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_can</name>
              <description>sys_pll_divider for can
1:enable
0:disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_shperi</name>
              <description>sys_pll_divider for shperi enable
1:enable
0:disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_psram</name>
              <description>sys_pll_divider for psram enable
1:enable
0:disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_spic</name>
              <description>sys_pll_divider for spic enable
1:enable
0:disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_hperi</name>
              <description>sys_pll_divider for hperi enable
1:enable
0:disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_sys_pll_hp</name>
              <description>sys_pll_divider for hp enable
1:enable
0:disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FEN_USB_PLL</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>fen_usb_pll_dvpm</name>
              <description>usb_pll_divider for dvpm enable
1:enable
0:disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_dvp</name>
              <description>usb_pll_divider for dvp enable
1:enable
0:disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_usb</name>
              <description>usb_pll divider for usb utim enable
1:enable
0:disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_i3c</name>
              <description>usb_pll_divider for i3c enable
1:enable
0:disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_gmac</name>
              <description>usb_pll_divider for gmac enable
1:enable
0:disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_vo</name>
              <description>usb_pll_divider for vo enable
1:enable
0:disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_can</name>
              <description>usb_pll_divider for can
1:enable
0:disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_shperi</name>
              <description>usb_pll_divider for shperi enable
1:enable
0:disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_psram</name>
              <description>usb_pll_divider for psram enable
1:enable
0:disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_spic</name>
              <description>usb_pll_divider for spic enable
1:enable
0:disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_hperi</name>
              <description>usb_pll_divider for hperi enable
1:enable
0:disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>fen_usb_pll_hp</name>
              <description>usb_pll_divider for hp enable
1:enable
0:disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKD_sys_pll_GRP0</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x47310131</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>ckd_sys_pll_dvpm</name>
              <description>sys_pll divider for shperi
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sys_pll_dvp</name>
              <description>sys_pll divider for shperi
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sys_pll_can</name>
              <description>sys_pll divider for can
0: div1
1: div2
...
Note: default 320M/3=106M
DIV_MIN:0</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sys_pll_shperi</name>
              <description>sys_pll divider for shperi
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sys_pll_psram</name>
              <description>sys_pll divider for psram
0: Not support
1: div2
...
DIV_MIN:1</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sys_pll_spic</name>
              <description>sys_pll divider for spic
0: Not support
1: div2
...
DIV_MIN:1</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sys_pll_hperi</name>
              <description>sys_pll divider for hperi
0: Not support
1: div2
...
DIV_MIN:1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sys_pll_hp</name>
              <description>sys_pll divider for hp
0: Not support
1: div2
...
DIV_MIN:1</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKD_sys_pll_GRP1</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x10000701</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>ckd_sys_pll_i3c</name>
              <description>sys_pll divider for i3c clk
0: div1
1: div2
...
Note: default 200M (for i3c afe clock select 400M)
DIV_MIN:0</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sys_pll_gmac</name>
              <description>sys_pll divider for vo/panel clk
0: div1
1: div2
...
Note: fix to 50M (for gmac afe clock select 400M)
DIV_MIN:0</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_sys_pll_vo</name>
              <description>sys_pll divider for vo/panel clk
0: div1
1: div2
...
Note: max 200M
DIV_MIN:0</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CKD_USB_PLL_GRP0</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x13742393</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>ckd_usb_pll_usb</name>
              <description>usb_pll divider for usb utmi , default 48M
0: div1
1: div2
...
Note: default 960M/8=120M
DIV_MIN:0</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_can</name>
              <description>usb_pll divider for can
0: div1
1: div2
...
Note: default 960M/8=120M
DIV_MIN:0</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_shperi</name>
              <description>usb_pll divider for shperi
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_psram</name>
              <description>usb_pll divider for psram, special 400M pll input
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_spic</name>
              <description>usb_pll divider for spic
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_hperi</name>
              <description>usb_pll divider for hperi
0: div1
1: div2
...</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_hp</name>
              <description>usb_pll divider for hp
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ckd_usb_pll_GRP1</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x99091304</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>ckd_usb_pll_i3c</name>
              <description>usb_pll divider for i3c clk
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_dvpm</name>
              <description>usb_pll divider for sdh clk
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_dvp</name>
              <description>usb_pll divider for dvp clk
0: div1
1: div2
...
DIV_MIN:0</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_gmac</name>
              <description>usb_pll divider for gmac,
Note: output must fix to 50M.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ckd_usb_pll_vo</name>
              <description>usb_pll divider for vo/panel
0: div1
1: div2
...
Note: max 200M
DIV_MIN:0</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SW_RST_CTRL</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x03FF0F73</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>km4tz_sys_rst</name>
              <description>Only when REG_SW_RST_TRIG is 0x96969696 , this reg can be write</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>km4ns_sys_rst</name>
              <description>Only when REG_SW_RST_TRIG is 0x96969696 , this reg can be write</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>plfm1_sys_rst</name>
              <description>Only when REG_SW_RST_TRIG is 0x96969696 , this reg can be write</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>srst1_glb_rst_en</name>
              <description>1.system reset1  will reset all syson IP and local CPU1(km4ns)
0.system reset0  will reset local CPU1(km4ns)</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>srst0_glb_rst_en</name>
              <description>1.system reset0  will reset all syson IP and local CPU0(km4tz)
0.system reset0  will reset local CPU0(km4tz)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>sys_glbrst_timeout</name>
              <description>If system glb rst en is disable , system reset will reset its local cpu only . but if bus is hang , it will trigger global reset also . 
HW will wait local CPU's status , if it is not in IDLE in a threshold time, it will trigger global reset .
Note : This value must set &gt; 1 , it is base on 4M clock cycle .</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>wdg_glbrst_timeout</name>
              <description>If wdg's glb rst en is disable , wdg reset will reset its local cpu only . but if bus is hang , it will trigger global reset also . 
HW will wait local CPU's status , if it is not in IDLE in a threshold time, it will trigger global reset .
Note : This value must set &gt; 1 , it is base on 32k clock cycle .</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>wdg2_glb_rst_en</name>
              <description>1.wdg2 will reset all syson IP and local CPU
0.wdg2 will reset local CPU and itself
Note: wdg2 's local CPU is CPU0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>wdg1_glb_rst_en</name>
              <description>1.wdg1 will reset all syson IP and local CPU
0.wdg1 will reset local CPU and itself
Note: wdg1 's local CPU is CPU0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>wdg0_glb_rst_en</name>
              <description>1.wdg0 will reset all syson IP and local CPU
0.wdg0 will reset local CPU and itself
Note: wdg0 's local CPU is CPU1</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>periall_rst_en</name>
              <description>1. warm reset request by one cpu will reset all peri and local cpu
0. warm reset request by one cpu will only reset local cpu
Note : peri rst will use sysrst mst also</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>othercpu_rst_en</name>
              <description>1. warm reset request by one cpu will reset other cpu's core and local cpu
0. warm reset request by one cpu will only reset local cpu</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SW_RST_TRIG</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>trig_rst_p1</name>
              <description>System reset trigger register
Write 0x96969696 to enable the write of reset control
Write 0x69696969 will trigger the system if REG_SW_RST_CTRL set .</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>trig_rst</name>
              <description>System reset trigger register
Write 0x96969696 to enable the write of reset control
Write 0x69696969 will trigger the system if REG_SW_RST_CTRL set .</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOOT_REASON_SW</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOOT_CFG</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_CPU1_RUN</name>
              <description></description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOT_WAKE_FROM_PS_LS</name>
              <description></description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>BOOT_WAKE_FROM_PS_HS</name>
              <description></description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>BOOT_PATCH_FUNC0</name>
              <description></description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOT_RSVD_SW</name>
              <description></description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field protection="s">
              <name>ROM_VERSION_SW</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SW_PATCH</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field protection="s">
              <name>sw_patch_saddr</name>
              <description>SW patch code start addr.
OTP physical addr 0x500-0x6FF will autoload to this addr .</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
