Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RXI300_S_DIR_REG</name>
      <groupName>RXI_300</groupName>
      <baseAddress>0x41892200</baseAddress>
      <size>0x00001388</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001388</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PPC1_REG</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>PPC1 configure register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAP_TOUCH</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ADC_COMP</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_A_B_C</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_0_3_BASIC</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMC_TIMER_1</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IPC_P0</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_LOG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SYSON</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC2_REG</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>PPC2 configure register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPIC_USER_MODE</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QSPI_USER_MODE</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_SPIC_USERMODE</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_PHY</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPE_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MJPEG_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_6_10_PULSE_PWM_TIMER</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSIP</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXI300_P0</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I3C0</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDC_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI0</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPORT_I2S</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_DEVICE_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DVP_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN1</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN0</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GDMA0_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RMII_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC3_REG</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>PPC3 configure register</description>
          <resetValue>0x00020000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMER_4_5_BASIC</name>
              <description>1: Non-secure attribution
2: Secure attribution</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMC_TIMER_0</name>
              <description>1: Non-secure attribution
1: Secure attribution</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIMER</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IPC_P1</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_BT</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SYSON</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OTPC_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRNG_PORT1_PORT2</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXI300_P1</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_KEY_MANAGE</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_KEY_MANAGE</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_SHA_DMA</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WIFI_CFG</name>
              <description>1: Non-secure attribution
0: Secure attribution</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC_LOCK</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>PPC Lock register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>PPC lock register.
When writing 1'b1 to this bit, PPC will be locked.
Note: It can not be written to 1'b0 again until system reset to prevent modification. When PPC is locked, you can not program PPC registers unless system reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DISCONNECT_PLFM1</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Disconnect platform register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DISCONNECT_PLFM1</name>
              <description>Platform1-to-platform0 peripheral path are
0x0: connect                                                                                                                                                                                                                                       0x1: disconnect
When writing 1'b1 to this bit, the register willl be locked.
NOTE: It can not be written to 1'b0 again until system reset to prevent modification.When this regitster is locked, you can not program this register unless system reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_CONTROL</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>Reset flow control register</description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMEOUT_TRIGGER_N</name>
              <description>Trigger all timeout monitors in platform0 to block transaction from platform1.
0x0: trigger timeout                                                                                                                                                                                                                                       0x1: idle
NOTE: The register is not a write-1-clear register. User should set this register to 0x1(idle) after timeout is triggered.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P1_MASTER_DISABLE</name>
              <description>Master enable signal. All master agent  of platform1-to-platform are
0x0: enable                                                                                                                                                                                                                                          0x1: disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_STATUS</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>Reset flow status register</description>
          <resetValue>0x00000007</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLFM1_SLV_OSW</name>
              <description>Write  transaction number of KM4TZ which remains in platform1 slaves.The platform1 slaves are
0x0: idle                                                                                                                                                                                                                                                  0x1: has at least one write OST</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLFM1_SLV_OSR</name>
              <description>Read transaction number of KM4TZ which remains in platform1 slaves.The platform1 slaves are
0x0: idle                                                                                                                                                                                                                                                  0x1: has at least one read OST</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TMO_TRIG_PLFM1</name>
              <description>Status of AES_SHA/SIC/OTPC/WIFI timeout monitor.The timeout is
0x0: disable                                                                                                                                                                                                                                            0x1: enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TMO_TRIG_WIFI</name>
              <description>Status of WIFI  timeout monitor.The timeout is
0x0: disable                                                                                                                                                                                                                                            0x0: enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TMO_TRIG_KM4</name>
              <description>Status of CPU domain timeout monitor.The timeout is
0x0: disable                                                                                                                                                                                                                                            0x1: enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MST_STAT_OTHERS</name>
              <description>Status of AES_SHA/SIC/OTPC/WIFI  master agent. The master is
0x0: idle                                                                                                                                                                                                                                                  0x1: active</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MST_STAT_WIFI</name>
              <description>Status of WIFI master agent. The master is
0x0: idle                                                                                                                                                                                                                                                  0x1: active</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MST_STAT_KM4NS</name>
              <description>Status of KM4NS master agent. The master is
0x0: idle                                                                                                                                                                                                                                                  0x1: active</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
