Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>IDAU_CTRL</name>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <description>Enable control register in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_WRITE_CTRL</name>
              <description>Region entry enable
After setting WRITE_CTRL bits as 1, corresponding regions is set as write-forbidden.Note that if WRITE_CTRL bits are not enabled, the region remains secure even if ba*i/la*i is set.
[16]: enable entry for ba0/la0
0: disable 
1: enable                                                                                                                                                                                                                                                     [17]: enable entry for ba1/la1
0: disable 
1: enable                                                                                                                                                                                                                                              [18]: enable entry for ba2/la2
0: disable 
1: enable
[19]: enable entry for ba3/la3
0: disable 
1: enable                                                                                                                                                                                                                                                 [20]: enable entry for ba4/la4
0: disable 
1: enable                                                                                                                                                                                                                                               [21]: enable entry for ba5/la5
0: disable 
1: enable</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAU_SECURE_CTRL</name>
              <description>Region entry enable
After setting SECURE_CTRL bits as 1, corresponding regions is set as non-secure.Note that if SECURE_CTRL bits are not enabled, the region remains secure even if ba*i/la*i is set.
[0]: enable entry for ba0/la0
0: disable 
1: enable                                                                                                                                                                                                                                                 [1]: enable entry for ba1/la1
0: disable 
1: enable                                                                                                                                                                                                                                                  [2]: enable entry for ba2/la2
0: disable 
1: enable
[3]: enable entry for ba3/la3
0: disable 
1: enable                                                                                                                                                                                                                                                 [4]: enable entry for ba4/la4
0: disable 
1: enable                                                                                                                                                                                                                                                  [5]: enable entry for ba5/la5
0: disable 
1: enable</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_LOCK</name>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <description>Lock control register in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_LOCK</name>
              <description>Lock write transfer for all registers in IDAU (including lock register itself) until system reset if it is ebabled.
[0]: lock bit for all register in IDAU                                                                                                                                                                                                              0: disable lock  1: enable lock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_BA0</name>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
          <description>Base address register 0 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_BA0</name>
              <description>It's the base address of region 0 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 0</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_LA0</name>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
          <description>Top address register 0  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_LA0</name>
              <description>It's the top address of region 0 which can be set as non-secure.
[27:12]: top address of region 0</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_BA1</name>
          <addressOffset>0x00000508</addressOffset>
          <size>32</size>
          <description>Base address register 1 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_BA1</name>
              <description>It's the base address of region 1 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 1</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_LA1</name>
          <addressOffset>0x0000050C</addressOffset>
          <size>32</size>
          <description>Top address register 1  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_LA1</name>
              <description>It's the top address of region 1 which can be set as non-secure.
[27:12]: top address of region 1</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_BA2</name>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
          <description>Base address register 2 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_BA2</name>
              <description>It's the base address of region 2 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 2</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_LA2</name>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
          <description>Top address register 2  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_LA2</name>
              <description>It's the top address of region 2 which can be set as non-secure.
[27:12]: top address of region 2</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_BA3</name>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
          <description>Base address register 3 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_BA3</name>
              <description>It's the base address of region 3 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 3</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_LA3</name>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
          <description>Top address register 3  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_LA3</name>
              <description>It's the top address of region 3 which can be set as non-secure.
[27:12]: top address of region 3</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_BA4</name>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <description>Base address register 4 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_BA4</name>
              <description>It's the base address of region 4 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 4</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_LA4</name>
          <addressOffset>0x00000524</addressOffset>
          <size>32</size>
          <description>Top address register 4  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_LA4</name>
              <description>It's the top address of region 4 which can be set as non-secure.
[27:12]: top address of region 4</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_BA5</name>
          <addressOffset>0x00000528</addressOffset>
          <size>32</size>
          <description>Base address register 5 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_BA5</name>
              <description>It's the base address of region 5 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 5</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_LA5</name>
          <addressOffset>0x0000052C</addressOffset>
          <size>32</size>
          <description>Top address register 5  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU1_LA5</name>
              <description>It's the top address of region 5 which can be set as non-secure.
[27:12]: top address of region 5</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_CTRL</name>
          <addressOffset>0x00000540</addressOffset>
          <size>32</size>
          <description>Enable control register in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRITE_CTRL</name>
              <description>Region entry enable
After setting WRITE_CTRL bits as 1, corresponding regions is set as write-forbidden.Note that if WRITE_CTRL bits are not enabled, the region remains secure even if ba*i/la*i is set.
[16]: enable entry for ba0/la0
0: disable 
1: enable                                                                                                                                                                                                                                                     [17]: enable entry for ba1/la1
0: disable 
1: enable                                                                                                                                                                                                                                              [18]: enable entry for ba2/la2
0: disable 
1: enable
[19]: enable entry for ba3/la3
0: disable 
1: enable                                                                                                                                                                                                                                                 [20]: enable entry for ba4/la4
0: disable 
1: enable                                                                                                                                                                                                                                               [21]: enable entry for ba5/la5
0: disable 
1: enable</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SECURE_CTRL</name>
              <description>Region entry enable
After setting SECURE_CTRL bits as 1, corresponding regions is set as non-secure.Note that if SECURE_CTRL bits are not enabled, the region remains secure even if ba*i/la*i is set.
[0]: enable entry for ba0/la0
0: disable 
1: enable                                                                                                                                                                                                                                                 [1]: enable entry for ba1/la1
0: disable 
1: enable                                                                                                                                                                                                                                                  [2]: enable entry for ba2/la2
0: disable 
1: enable
[3]: enable entry for ba3/la3
0: disable 
1: enable                                                                                                                                                                                                                                                 [4]: enable entry for ba4/la4
0: disable 
1: enable                                                                                                                                                                                                                                                  [5]: enable entry for ba5/la5
0: disable 
1: enable</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU1_LOCK</name>
          <addressOffset>0x00000544</addressOffset>
          <size>32</size>
          <description>Lock control register in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_LOCK</name>
              <description>Lock write transfer for all registers in IDAU (including lock register itself) until system reset if it is ebabled.
[0]: lock bit for all register in IDAU                                                                                                                                                                                                              0: disable lock  1: enable lock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_BA0</name>
          <addressOffset>0x00000600</addressOffset>
          <size>32</size>
          <description>Base address register 0 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_BA0</name>
              <description>It's the base address of region 0 which can be set as non-secure.          
[27:12]: base address of region 0</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_LA0</name>
          <addressOffset>0x00000604</addressOffset>
          <size>32</size>
          <description>Top address register 0  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_LA0</name>
              <description>It's the top address of region 0 which can be set as non-secure.
[27:12]: top address of region 0</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_BA1</name>
          <addressOffset>0x00000608</addressOffset>
          <size>32</size>
          <description>Base address register 1 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_BA1</name>
              <description>It's the base address of region 1 which can be set as non-secure.          
[27:12]: base address of region 1</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_LA1</name>
          <addressOffset>0x0000060C</addressOffset>
          <size>32</size>
          <description>Top address register 1  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_LA1</name>
              <description>It's the top address of region 1 which can be set as non-secure.
[27:12]: top address of region 1</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_BA2</name>
          <addressOffset>0x00000610</addressOffset>
          <size>32</size>
          <description>Base address register 2 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_BA2</name>
              <description>It's the base address of region 2 which can be set as non-secure.          
[27:12]: base address of region 2</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_LA2</name>
          <addressOffset>0x00000614</addressOffset>
          <size>32</size>
          <description>Top address register 2  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_LA2</name>
              <description>It's the top address of region 2 which can be set as non-secure.
[27:12]: top address of region 2</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_BA3</name>
          <addressOffset>0x00000618</addressOffset>
          <size>32</size>
          <description>Base address register 3 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_BA3</name>
              <description>It's the base address of region 3 which can be set as non-secure.          
[27:12]: base address of region 3</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_LA3</name>
          <addressOffset>0x0000061C</addressOffset>
          <size>32</size>
          <description>Top address register 3  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_LA3</name>
              <description>It's the top address of region 3 which can be set as non-secure.
[27:12]: top address of region 3</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_BA4</name>
          <addressOffset>0x00000620</addressOffset>
          <size>32</size>
          <description>Base address register 4 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_BA4</name>
              <description>It's the base address of region 4 which can be set as non-secure.          
[27:12]: base address of region 4</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
