Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>ARB_W_CTRL3</name>
          <addressOffset>0x0000104C</addressOffset>
          <size>32</size>
          <description>The write arbitration control3</description>
          <resetValue>0x49244924</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHPERI_TO_SRAM_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: MJPEG
0x1: LCDC                                                                                                                                                                                                  0x2: PPE
And the following shows bit field of each slots:
[1:0]: slot 0 of arbiter
[3:2]: slot 1 of arbiter
[5:4]: slot 2 of arbiter
[7:6]: slot 3 of arbiter
[9:8]: slot 4 of arbiter
[11:10]: slot 5 of arbiter
[13:12]: slot 6 of arbiter
[15:14]: slot 7 of arbiter</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIC_FINAL_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: CPU_TO_SPIC_ARB group
0x1: HPERI_TO_SPIC_ARB group                                                                                                                                                       0x2: SHPERI_TO_SPIC_ARB group
And the following shows bit field of each slots:
[1:0]: slot 0 of arbiter
[3:2]: slot 1 of arbiter
[5:4]: slot 2 of arbiter
[7:6]: slot 3 of arbiter
[9:8]: slot 4 of arbiter
[11:10]: slot 5 of arbiter
[13:12]: slot 6 of arbiter
[15:14]: slot 7 of arbiter</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_W_CTRL4</name>
          <addressOffset>0x00001050</addressOffset>
          <size>32</size>
          <description>The write arbitration control4</description>
          <resetValue>0x49245555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM_SUB_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: CPU_TO_SRAM_ARB group
0x1: HPERI_TO_SRAM_ARB group                                                                                                                                                       0x2: SHPERI_TO_SRAM_ARB group
And the following shows bit field of each slots:
[1:0]: slot 0 of arbiter
[3:2]: slot 1 of arbiter
[5:4]: slot 2 of arbiter
[7:6]: slot 3 of arbiter
[9:8]: slot 4 of arbiter
[11:10]: slot 5 of arbiter
[13:12]: slot 6 of arbiter
[15:14]: slot 7 of arbiter</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_FINAL_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: WIFI
0x1: SRAM_SUB_ARB group
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHPERI_TO_SPIC_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: MJPEG
0x1: PPE
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_W_CTRL5</name>
          <addressOffset>0x00001054</addressOffset>
          <size>32</size>
          <description>The write arbitration control5</description>
          <resetValue>0x23444688</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSRAM_FINAL_ARB</name>
              <description>write  arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: CPU_TO_PSRAM_ARB group
0x1: HPERI_TO_PSRAM_ARB group
0x2: MJPEG
0x3: LCDC
0x4: PPE                                                                                                                                                                                                      
And the following shows bit field of each slots:
[2:0]: slot 0 of arbiter
[5:3]: slot 1 of arbiter
[8:6]: slot 2 of arbiter
[11:9]: slot 3 of arbiter
[14:12]: slot 4 of arbiter
[17:15]: slot 5 of arbiter
[20:18]: slot 6 of arbiter
[23:21]: slot 7 of arbiter 
[26:24]: slot 8 of arbiter
[29:27]: slot 9 of arbiter</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMC_CONFIG</name>
          <addressOffset>0x00001058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_RESP_DISABLE</name>
              <description>0x0: enable error response of SRAMC
0x1: disable error response of SRAMC</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_WEIGHT</name>
              <description>RD weight of SRAMC</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_PLD0</name>
          <addressOffset>0x00001100</addressOffset>
          <size>32</size>
          <description>Error log payload register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_BSTINDEX</name>
              <description>Burst index of the error request.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTLEN</name>
              <description>Burst Length of the error request.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTTYPE</name>
              <description>BurstSeq of the error request.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CMD</name>
              <description>CMD of the error request.
0x1: Write command
0x2: Read command</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SRC</name>
              <description>Error source of the error request.
0x00: Address hole default slave of M0,M8 group                                                                                                                                                   0x01: Address hole default slave of M1, M3, M5,  M7, M9-M11 group
0x02: Address hole default slave of M2, M4, M6                                                                                                                          0x03: Address hole default slave of P3S0 group                                                                                                                            0x40: master timeout of KM4NS                                                                                                                                                          0x41: master timeout of PLFM1_MST(M9-M11)                                                                                                                                             0x42: master timeout of WIFI                                                                                                                                                           0x43: slave timeout of KM4TZ to PLFM1                                                                                                                                        0x50: slave timeout of SRAMC</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_PLD1</name>
          <addressOffset>0x00001104</addressOffset>
          <size>32</size>
          <description>Error log payload register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_LOCK</name>
              <description>AxLock of the error request.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CACHE</name>
              <description>AxCache of the error request.</description>
              <bitRange>[29:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ElR_PROT</name>
              <description>AxProt of the error request.</description>
              <bitRange>[25:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SIZE</name>
              <description>Size of the error request.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_ID</name>
          <addressOffset>0x00001108</addressOffset>
          <size>32</size>
          <description>Error log ID information register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ID</name>
              <description>Tagid of the error request.
8'b00000???: M0 access error
8'b000100??: M1 access error
8'b0100????: M2 access error
8'b000101??: M3 access error
8'b0101000?: M4 access error
8'b0001100?: M5 access error
8'b01100???: M6 access error    
8'b001?????: M7 access error
8'b1101????: M8 access error
8'b11100???: M9 access error
8'b1111000?: M10 access error
8'b101?????: M11 access error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_ADR0</name>
          <addressOffset>0x0000110C</addressOffset>
          <size>32</size>
          <description>Error log addrress register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR0</name>
              <description>Address[31:0] of the error request.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_ADR1</name>
          <addressOffset>0x00001110</addressOffset>
          <size>32</size>
          <description>Error log addrress register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR1</name>
              <description>Address[63:32] of the error request.</description>
              <bitRange>[63:32]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_CODE</name>
          <addressOffset>0x00001130</addressOffset>
          <size>32</size>
          <description>Error code register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_CODE</name>
              <description>The error code of error request, if it's 0, indicates that there is no error request. 
8'h00: No error
8'h01: Address hole error   
8'h2C: AXI master agent wdata timeout
8'h2D: AXI master agent write response timeout     
8'h2E: AXI master agent write response timeout   
8'h30: AXI SRAM controller grant timeout     
8'h38: AXI slave agent arready timeout 
8'h39: AXI slave agent rvalid timeout    
8'h3A: AXI slave agent arready timeout 
8'h3B: AXI slave agent wready timeout 
8'h3C: AXI slave agent bvalid timeout</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_INTR_CLR</name>
          <addressOffset>0x0000113C</addressOffset>
          <size>32</size>
          <description>Error log clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_INTR_CLR</name>
              <description>Error log interrupt clear. Writing 1'b1 to the register will trigger a 1-cycle pulse interrupt clear. It has to write 1'b1 to this register every time when the error exception occurs.
Note that this register is write-only, the return value of reading this register is meaningless.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_GUARD_EN</name>
          <addressOffset>0x00001300</addressOffset>
          <size>32</size>
          <description>Timeout guardian enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GUARDIAN_MODE_EN_PLFM1_SLV</name>
              <description>The enable of platform1 slave timeout monitor                                                                                                                                  
0x0: Disable timeout check 
0x1: Enable timeoute check</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GUARDIAN_MODE_EN_WIFI</name>
              <description>The enable of WIFI timeout monitor                                                                                                                                  
0x0: Disable timeout check 
0x1: Enable timeoute check</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GUARDIAN_MODE_EN_PLFM1_MST</name>
              <description>The enable of SIC/OTPC/ARS_SHA/GDMA timeout monitor                                                                                                                                  
0x0: Disable timeout check 
0x1: Enable timeoute check</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GUARDIAN_MODE_EN_KM4NS</name>
              <description>The enable of KM4NS timeout monitor                                                                                                                                  
0x0: Disable timeout check 
0x0: Enable timeoute check</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GUARDIAN_MODE_EN_SRAMC</name>
              <description>The enable of SRAMC timeout monitor                                                                                                                                  
0x0: Disable timeout check 
0x1: Enable timeoute check</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_CLEAN_N</name>
          <addressOffset>0x00001340</addressOffset>
          <size>32</size>
          <description>Timeout clear register</description>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TMO_CLEAR_N_PLFM1_SLV</name>
              <description>The register can only written to 0 when a platform1 time out occures, and automatically clear this register by hardware</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TMO_CLEAR_N_WIFI</name>
              <description>The register can only written to 0 when a WIFI time out occures, and automatically clear this register by hardware</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TMO_CLEAR_N_PLFM1_MST</name>
              <description>The register can only written to 0 when a SIC/OTPC/ARS_SHA/GDMA time out occures, and automatically clear this register by hardware</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TMO_CLEAR_N_KM4NS</name>
              <description>The register can only written to 0 when a KM4NS time out occures, and automatically clear this register by hardware</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TMO_CLEAR_N_SRAMC</name>
              <description>The register can only written to 0 when a SRAMC time out occures, and automatically clear this register by hardware</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_MON_CFG0</name>
          <addressOffset>0x00001380</addressOffset>
          <size>32</size>
          <description>Timeout monitor configuration register0</description>
          <resetValue>0x000F00FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRADE</name>
              <description>Timeout grade                                                                                                                                                                                                                                      Timeout total cycle = [256*(2^(grade-1) +1)*threshold] - inaccurate                                                                                                       Note1: the range of inaccurate = 0 ~ [256*(2^(grade-1) +1)-2]                                                                                              Note2: If threshold is 0x0, the Timeout_total_cycle is always 1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Timeout threshold</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_MON_CFG1</name>
          <addressOffset>0x00001384</addressOffset>
          <size>32</size>
          <description>Timeout monitor configuration register0</description>
          <resetValue>0x000F00FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRADE</name>
              <description>Timeout grade                                                                                                                                                                                                                                      Timeout total cycle = [256*(2^(grade-1) +1)*threshold] - inaccurate                                                                                                       Note1: the range of inaccurate = 0 ~ [256*(2^(grade-1) +1)-2]                                                                                              Note2: If threshold is 0x0, the Timeout_total_cycle is always 1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Timeout threshold</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
