Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>ELR_PLD0_S</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description>Error log payload register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_BSTINDEX_S</name>
              <description>Burst index of the error request.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTLEN_S</name>
              <description>Burst Length of the error request.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTTYPE_S</name>
              <description>BurstSeq of the error request.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CMD_S</name>
              <description>CMD of the error request.
0x1: Write command
0x2: Read command</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SRC_S</name>
              <description>Error source of the error request.
0x10: secure default slave of P0S0                                                                                                                                                                                                0x11: secure default slave of P0S1-12~P0S1-16
0x12: secure default slave of P0S1-5~P0S1-7                                                                                                                                                                                               0x13: secure default slave of P0S1-1~P0S1-4, P0S1-8~P0S1-11                                                                                                                                                                                            0x14: secure default slave of P0S1-0                                                                                                                                                                                                0x15: secure default slave of P0S1-22                                                                                                                                                                                              0x16: secure default slave of P0S1-19~P0S1-21,  P0S2                                                                                                                                                                                                 0x17: secure default slave of P0S1-17, P0S1-18                                                                                                                                                                               0x20: secure default slave of P2S0                                                                                                                                                                                      0x21: secure default slave of P3S0                                                                                                                                                                                                0x22: secure default slave of P4S0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_PLD1_S</name>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <description>Error log payload register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_LOCK_S</name>
              <description>AxLock of the error request.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CACHE_S</name>
              <description>AxCache of the error request.</description>
              <bitRange>[29:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ElR_PROT_S</name>
              <description>AxProt of the error request.</description>
              <bitRange>[25:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SIZE_S</name>
              <description>Size of the error request.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_ID_S</name>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <description>Error log ID information register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ID_S</name>
              <description>Tagid of the error request.
8'b00000???: M0 access error
8'b000100??: M1 access error
8'b0100????: M2 access error
8'b000101??: M3 access error
8'b0101000?: M4 access error
8'b0001100?: M5 access error
8'b01100???: M6 access error    
8'b001?????: M7 access error
8'b1101????: M8 access error
8'b11100???: M9 access error
8'b1111000?: M10 access error
8'b101?????: M11 access error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_ADR0_S</name>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <description>Error log addrress register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR0_S</name>
              <description>Address[31:0] of the error request.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_ADR1_S</name>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <description>Error log addrress register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR1_S</name>
              <description>Address[63:32] of the error request.</description>
              <bitRange>[63:32]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_CODE_S</name>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <description>Error code register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_CODE_S</name>
              <description>The error code of error request, if it's 0, indicates that there is no error request. 
8'h00: No error
8'h02: Secure fault error</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_INTR_CLR_S</name>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <description>Error log clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_INTR_CLR_S</name>
              <description>Error log interrupt clear. Writing 1'b1 to the register will trigger a 1-cycle pulse interrupt clear. It has to write 1'b1 to this register every time when the error exception occurs.
Note that this register is write-only, the return value of reading this register is meaningless.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NAME</name>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <description>RXI300 design name register</description>
          <resetValue>0x00052300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NAME</name>
              <description>The design name of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VER</name>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <description>RXI300 design version register</description>
          <resetValue>0x00000300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VER</name>
              <description>The design version of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RVE</name>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <description>RXI300 design reversion register</description>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REV</name>
              <description>The design reversion of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INST</name>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <description>RXI300 design instance number register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INST</name>
              <description>The design instance number of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMPL_Y</name>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <description>RXI300 implementation year register</description>
          <resetValue>0x00002025</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMPL_Y</name>
              <description>The implementatin year of RXI-300.
Reset value depends on implementation date.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMPL_D</name>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <description>RXI300 implementation date register</description>
          <resetValue>0x03211627</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMPL_D</name>
              <description>The implementatin date of RXI-300.
Reset value depends on implementation date.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV</name>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <description>RXI300 developer register</description>
          <resetValue>0x05207433</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEV</name>
              <description>The developer of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_NUM</name>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <description>RXI300 project number register</description>
          <resetValue>0x00006955</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRO_NUM</name>
              <description>The project number of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_BA0</name>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <description>Base address register 0 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_BA0</name>
              <description>It's the base address of region 0 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 0</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_LA0</name>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <description>Top address register 0  in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_LA0</name>
              <description>It's the top address of region 0 which can be set as non-secure.
[27:12]: top address of region 0</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_BA1</name>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <description>Base address register 1 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_BA1</name>
              <description>It's the base address of region 1 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 1</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_LA1</name>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <description>Top address register 1  in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_LA1</name>
              <description>It's the top address of region 1 which can be set as non-secure.
[27:12]: top address of region 1</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_BA2</name>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <description>Base address register 2 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_BA2</name>
              <description>It's the base address of region 2 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 2</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_LA2</name>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <description>Top address register 2  in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_LA2</name>
              <description>It's the top address of region 2 which can be set as non-secure.
[27:12]: top address of region 2</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_BA3</name>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <description>Base address register 3 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_BA3</name>
              <description>It's the base address of region 3 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 3</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_LA3</name>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <description>Top address register 3  in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_LA3</name>
              <description>It's the top address of region 3 which can be set as non-secure.
[27:12]: top address of region 3</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_BA4</name>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <description>Base address register 4 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_BA4</name>
              <description>It's the base address of region 4 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 4</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_LA4</name>
          <addressOffset>0x00000424</addressOffset>
          <size>32</size>
          <description>Top address register 4  in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_LA4</name>
              <description>It's the top address of region 4 which can be set as non-secure.
[27:12]: top address of region 4</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_BA5</name>
          <addressOffset>0x00000428</addressOffset>
          <size>32</size>
          <description>Base address register 5 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_BA5</name>
              <description>It's the base address of region 5 which can be set as non-secure.                                                                                                       
[27:12]: base address of region 5</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU_LA5</name>
          <addressOffset>0x0000042C</addressOffset>
          <size>32</size>
          <description>Top address register 5  in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_LA5</name>
              <description>It's the top address of region 5 which can be set as non-secure.
[27:12]: top address of region 5</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
