Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>IDAU2_LA4</name>
          <addressOffset>0x00000624</addressOffset>
          <size>32</size>
          <description>Top address register 4  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_LA4</name>
              <description>It's the top address of region 4 which can be set as non-secure.
[27:12]: top address of region 4</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_BA5</name>
          <addressOffset>0x00000628</addressOffset>
          <size>32</size>
          <description>Base address register 5 in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_BA5</name>
              <description>It's the base address of region 5 which can be set as non-secure.          
[27:12]: base address of region 5</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_LA5</name>
          <addressOffset>0x0000062C</addressOffset>
          <size>32</size>
          <description>Top address register 5  in IDAU</description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU2_LA5</name>
              <description>It's the top address of region 5 which can be set as non-secure.
[27:12]: top address of region 5</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_CTRL</name>
          <addressOffset>0x00000640</addressOffset>
          <size>32</size>
          <description>Enable control register in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRITE_CTRL</name>
              <description>Region entry enable
After setting WRITE_CTRL bits as 1, corresponding regions is set as write-forbidden.Note that if WRITE_CTRL bits are not enabled, the region remains secure even if ba*i/la*i is set.
[16]: enable entry for ba0/la0
0: disable 
1: enable                                                                                                                                                                                                                                                     [17]: enable entry for ba1/la1
0: disable 
1: enable                                                                                                                                                                                                                                              [18]: enable entry for ba2/la2
0: disable 
1: enable
[19]: enable entry for ba3/la3
0: disable 
1: enable                                                                                                                                                                                                                                                 [20]: enable entry for ba4/la4
0: disable 
1: enable                                                                                                                                                                                                                                               [21]: enable entry for ba5/la5
0: disable 
1: enable</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SECURE_CTRL</name>
              <description>Region entry enable
After setting SECURE_CTRL bits as 1, corresponding regions is set as non-secure.Note that if SECURE_CTRL bits are not enabled, the region remains secure even if ba*i/la*i is set.
[0]: enable entry for ba0/la0
0: disable 
1: enable                                                                                                                                                                                                                                                 [1]: enable entry for ba1/la1
0: disable 
1: enable                                                                                                                                                                                                                                                  [2]: enable entry for ba2/la2
0: disable 
1: enable
[3]: enable entry for ba3/la3
0: disable 
1: enable                                                                                                                                                                                                                                                 [4]: enable entry for ba4/la4
0: disable 
1: enable                                                                                                                                                                                                                                                  [5]: enable entry for ba5/la5
0: disable 
1: enable</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAU2_LOCK</name>
          <addressOffset>0x00000644</addressOffset>
          <size>32</size>
          <description>Lock control register in IDAU</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAU_LOCK</name>
              <description>Lock write transfer for all registers in IDAU (including lock register itself) until system reset if it is ebabled.
[0]: lock bit for all register in IDAU                                                                                                                                                                                                              0: disable lock  1: enable lock 
[31:1] reserved</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_R_CTRL0</name>
          <addressOffset>0x00001000</addressOffset>
          <size>32</size>
          <description>The read arbitration control0</description>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPERI_TO_SPIC_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: WIFI/AES_SHA/OTPC/SIC
0x1: GDMA
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_TO_SRAM_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: KM4TZ
0x1: KM4NS
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_TO_PSRAM_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: KM4TZ
0x1: KM4NS
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_TO_SPIC_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: KM4TZ
0x1: KM4NS
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_R_CTRL1</name>
          <addressOffset>0x00001004</addressOffset>
          <size>32</size>
          <description>The read arbitration control1</description>
          <resetValue>0x23444688</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPERI_TO_PSRAM_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: WIFI/AES_SHA/OTPC/SIC
0x1: USB
0x2: DVP
0x3: RMII
0x4: GDMA
And the following shows bit field of each slots:
[2:0]: slot 0 of arbiter
[5:3]: slot 1 of arbiter
[8:6]: slot 2 of arbiter
[11:9]: slot 3 of arbiter
[14:12]: slot 4 of arbiter
[17:15]: slot 5 of arbiter
[20:18]: slot 6 of arbiter
[23:21]: slot 7 of arbiter 
[26:24]: slot 8 of arbiter
[29:27]: slot 9 of arbiter</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_R_CTRL2</name>
          <addressOffset>0x00001008</addressOffset>
          <size>32</size>
          <description>The read arbitration control2</description>
          <resetValue>0x23444688</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPERI_TO_SRAM_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: WIFI/AES_SHA/OTPC/SIC
0x1: USB
0x2: DVP
0x3: RMII
0x4: GDMA
And the following shows bit field of each slots:
[2:0]: slot 0 of arbiter
[5:3]: slot 1 of arbiter
[8:6]: slot 2 of arbiter
[11:9]: slot 3 of arbiter
[14:12]: slot 4 of arbiter
[17:15]: slot 5 of arbiter
[20:18]: slot 6 of arbiter
[23:21]: slot 7 of arbiter 
[26:24]: slot 8 of arbiter
[29:27]: slot 9 of arbiter</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_R_CTRL3</name>
          <addressOffset>0x0000100C</addressOffset>
          <size>32</size>
          <description>The read arbitration control3</description>
          <resetValue>0x49244924</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHPERI_TO_SRAM_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: MJPEG
0x1: LCDC                                                                                                                                                                                                  0x2: PPE
And the following shows bit field of each slots:
[1:0]: slot 0 of arbiter
[3:2]: slot 1 of arbiter
[5:4]: slot 2 of arbiter
[7:6]: slot 3 of arbiter
[9:8]: slot 4 of arbiter
[11:10]: slot 5 of arbiter
[13:12]: slot 6 of arbiter
[15:14]: slot 7 of arbiter</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIC_FINAL_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: CPU_TO_SPIC_ARB group
0x1: HPERI_TO_SPIC_ARB group                                                                                                                                                       0x2: SHPERI_TO_SPIC_ARB group
And the following shows bit field of each slots:
[1:0]: slot 0 of arbiter
[3:2]: slot 1 of arbiter
[5:4]: slot 2 of arbiter
[7:6]: slot 3 of arbiter
[9:8]: slot 4 of arbiter
[11:10]: slot 5 of arbiter
[13:12]: slot 6 of arbiter
[15:14]: slot 7 of arbiter</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_R_CTRL4</name>
          <addressOffset>0x00001010</addressOffset>
          <size>32</size>
          <description>The read arbitration control4</description>
          <resetValue>0x49245555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM_SUB_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: CPU_TO_SRAM_ARB group
0x1: HPERI_TO_SRAM_ARB group                                                                                                                                                       0x2: SHPERI_TO_SRAM_ARB group
And the following shows bit field of each slots:
[1:0]: slot 0 of arbiter
[3:2]: slot 1 of arbiter
[5:4]: slot 2 of arbiter
[7:6]: slot 3 of arbiter
[9:8]: slot 4 of arbiter
[11:10]: slot 5 of arbiter
[13:12]: slot 6 of arbiter
[15:14]: slot 7 of arbiter</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_FINAL_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: WIFI
0x1: SRAM_SUB_ARB group
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHPERI_TO_SPIC_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: MJPEG
0x1: PPE
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_R_CTRL5</name>
          <addressOffset>0x00001014</addressOffset>
          <size>32</size>
          <description>The read arbitration control5</description>
          <resetValue>0x23444688</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSRAM_FINAL_ARB</name>
              <description>Read arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: CPU_TO_PSRAM_ARB group
0x1: HPERI_TO_PSRAM_ARB group
0x2: MJPEG
0x3: LCDC
0x4: PPE                                                                                                                                                                                                      
And the following shows bit field of each slots:
[2:0]: slot 0 of arbiter
[5:3]: slot 1 of arbiter
[8:6]: slot 2 of arbiter
[11:9]: slot 3 of arbiter
[14:12]: slot 4 of arbiter
[17:15]: slot 5 of arbiter
[20:18]: slot 6 of arbiter
[23:21]: slot 7 of arbiter 
[26:24]: slot 8 of arbiter
[29:27]: slot 9 of arbiter</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_W_CTRL0</name>
          <addressOffset>0x00001040</addressOffset>
          <size>32</size>
          <description>The write arbitration control0</description>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPERI_TO_SPIC_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: WIFI/AES_SHA/OTPC/SIC
0x1:GDMA
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_TO_SRAM_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: KM4TZ
0x1: KM4NS
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_TO_PSRAM_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: KM4TZ
0x1: KM4NS
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_TO_SPIC_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: KM4TZ
0x1: KM4NS
And the following shows bit field of each slots:
[0]: slot 0 of arbiter
[1]: slot 1 of arbiter
[2]: slot 2 of arbiter
[3]: slot 3 of arbiter
[4]: slot 4 of arbiter
[5]: slot 5 of arbiter
[6]: slot 6 of arbiter
[7]: slot 7 of arbiter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_W_CTRL1</name>
          <addressOffset>0x00001044</addressOffset>
          <size>32</size>
          <description>The write arbitration control1</description>
          <resetValue>0x23444688</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPERI_TO_PSRAM_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: WIFI/AES_SHA/OTPC/SIC
0x1: USB
0x2: DVP
0x3: RMII
0x4: GDMA
And the following shows bit field of each slots:
[2:0]: slot 0 of arbiter
[5:3]: slot 1 of arbiter
[8:6]: slot 2 of arbiter
[11:9]: slot 3 of arbiter
[14:12]: slot 4 of arbiter
[17:15]: slot 5 of arbiter
[20:18]: slot 6 of arbiter
[23:21]: slot 7 of arbiter 
[26:24]: slot 8 of arbiter
[29:27]: slot 9 of arbiter</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_W_CTRL2</name>
          <addressOffset>0x00001048</addressOffset>
          <size>32</size>
          <description>The write arbitration control2</description>
          <resetValue>0x23444688</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPERI_TO_SRAM_ARB</name>
              <description>Write arbitration control register. Each slot should be set by a port number. The port number represents a master group.The master group is shown as following:
0x0: WIFI/AES_SHA/OTPC/SIC
0x1: USB
0x2: DVP
0x3: RMII
0x4: GDMA
And the following shows bit field of each slots:
[2:0]: slot 0 of arbiter
[5:3]: slot 1 of arbiter
[8:6]: slot 2 of arbiter
[11:9]: slot 3 of arbiter
[14:12]: slot 4 of arbiter
[17:15]: slot 5 of arbiter
[20:18]: slot 6 of arbiter
[23:21]: slot 7 of arbiter 
[26:24]: slot 8 of arbiter
[29:27]: slot 9 of arbiter</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
