Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC_REG</name>
      <baseAddress>0x4100a000</baseAddress>
      <size>0x000000C0</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000000C0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_ADC_CONF</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>ADC Configuration Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_enable</name>
              <description>This bit is for ADC enable control</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_cvlist_len</name>
              <description>This field defines the number of items in the ADC conversion channel list.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_op_mod</name>
              <description>These bits selects ADC operation mode. 0: software trigger mode. 
1:automatic mode. 
2:timer-trigger mode. 
3:comparator-assist mode</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH0</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>ADC Channel 0 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch0</name>
              <description>This field defines the higher threshold of channel 0 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch0</name>
              <description>This field defines the lower threshold of channel 0 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH1</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>ADC Channel 1 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch1</name>
              <description>This field defines the higher threshold of channel 1 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch1</name>
              <description>This field defines the lower threshold of channel 1 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH2</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>ADC Channel 2 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch2</name>
              <description>This field defines the higher threshold of channel 2 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch2</name>
              <description>This field defines the lower threshold of channel 2 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH3</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>ADC Channel 3 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch3</name>
              <description>This field defines the higher threshold of channel 3 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch3</name>
              <description>This field defines the lower threshold of channel 3 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH4</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>ADC Channel 4 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch4</name>
              <description>This field defines the higher threshold of channel 4 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch4</name>
              <description>This field defines the lower threshold of channel 4 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH5</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>ADC Channel 5 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch5</name>
              <description>This field defines the higher threshold of channel 5 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch5</name>
              <description>This field defines the lower threshold of channel 5 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH6</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>ADC Channel 6 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch6</name>
              <description>This field defines the higher threshold of channel 6 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch6</name>
              <description>This field defines the lower threshold of channel 6 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH7</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>ADC Channel 7 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch7</name>
              <description>This field defines the higher threshold of channel 7 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch7</name>
              <description>This field defines the lower threshold of channel 7 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH8</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>ADC Channel 8 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch8</name>
              <description>This field defines the higher threshold of channel 8 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch8</name>
              <description>This field defines the lower threshold of channel 8 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH9</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>ADC Channel 9 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch9</name>
              <description>This field defines the higher threshold of channel 9 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch9</name>
              <description>This field defines the lower threshold of channel 9 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_TH_CH10</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>ADC Channel 10 Comparison Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_th_h_ch10</name>
              <description>This field defines the higher threshold of channel 10 for ADC automatic comparison.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_th_l_ch10</name>
              <description>This field defines the lower threshold of channel 10 for ADC automatic comparison.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_CTRL</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>ADC Comparison Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_ctrl_ch10</name>
              <description>This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in reg_adc_comp_sts.
0: When Vin &lt; bit_adc_comp_th_l_chx, comparison criterion matches.
1: When Vin &gt; bit_adc_comp_th_h_chx, comparison criterion matches.
2: When Vin &gt;= bit_adc_comp_th_l_chx and Vin &lt;= bit_adc_comp_th_h_chx, comparison criterion matches.
2: When Vin &lt; bit_adc_comp_th_l_chx or Vin &gt; bit_adc_comp_th_h_chx, comparison criterion matches.</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch9</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch8</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch7</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch6</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch5</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch4</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch3</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch2</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch1</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_comp_ctrl_ch0</name>
              <description>the function is same as bit_adc_comp_ctrl_ch10</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_COMP_STS</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>ADC Comparison Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_comp_sts_ch10</name>
              <description>this field reflects the comparison result of channel 10 immediately</description>
              <bitRange>[21:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch9</name>
              <description>this field reflects the comparison result of channel 9 immediately</description>
              <bitRange>[19:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch8</name>
              <description>this field reflects the comparison result of channel 8 immediately</description>
              <bitRange>[17:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch7</name>
              <description>this field reflects the comparison result of channel 7 immediately</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch6</name>
              <description>this field reflects the comparison result of channel 6 immediately</description>
              <bitRange>[13:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch5</name>
              <description>this field reflects the comparison result of channel 5 immediately</description>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch4</name>
              <description>this field reflects the comparison result of channel 4 immediately</description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch3</name>
              <description>this field reflects the comparison result of channel 3 immediately</description>
              <bitRange>[7:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch2</name>
              <description>this field reflects the comparison result of channel 2 immediately</description>
              <bitRange>[5:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch1</name>
              <description>this field reflects the comparison result of channel 1 immediately</description>
              <bitRange>[3:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_comp_sts_ch0</name>
              <description>this field reflects the comparison result of channel 0 immediately</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CHSW_LIST_0</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>ADC Channel Switch List 0 Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_chsw_7</name>
              <description>This field defines the number 7 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_6</name>
              <description>This field defines the number 6 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_5</name>
              <description>This field defines the number 5 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_4</name>
              <description>This field defines the number 4 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_3</name>
              <description>This field defines the number 3 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_2</name>
              <description>This field defines the number 2 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_1</name>
              <description>This field defines the number 1 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_0</name>
              <description>This field defines the number 0 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
