Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_ADC_CHSW_LIST_1</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>ADC Channel Switch List 1 Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_chsw_15</name>
              <description>This field defines the number 15 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_14</name>
              <description>This field defines the number 14 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_13</name>
              <description>This field defines the number 13 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_12</name>
              <description>This field defines the number 12 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_11</name>
              <description>This field defines the number 11 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_10</name>
              <description>This field defines the number 10 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_9</name>
              <description>This field defines the number 9 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_chsw_8</name>
              <description>This field defines the number 8 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_AUTO_CSW_CTRL</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>ADC Automatic Channel Switch Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_autosw_en</name>
              <description>This bit controls the automatic channel switch enabled or disabled.
0: Disable the automatic channel switch.If an automatic channel switch is in process, writing 0 will terminate the automatic channel switch. 
1: Enable the automatic channel switch. When setting this bit, an automatic channel switch starts from the first channel in the channel switch list.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_SW_TRIG</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>ADC Software Trigger Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_sw_trig</name>
              <description>This bit controls the ADC module to do a conversion.
Every time this bit is set to 1, ADC module would switch to a new channel and do one conversion. Therefore, this bit could be used as a start-convert event which is controlled by software. Every time a conversion is done, software MUST clear this bit manually. The interval between clearing and restart this bit must exceed one sample clock period.
0: disable the analog module and analog mux.
1: enable the analog module and analog mux. And then start a new channel conversion.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_LAST_CH</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>ADC Last Channel Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_last_ch</name>
              <description>This field reflects the last used channel</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_BUSY_STS</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>ADC Busy Status Register</description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_fifo_empty</name>
              <description>0: FIFO in ADC not empty; 1: FIFO in ADC empty</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_fifo_full_real</name>
              <description>0: FIFO in ADC not full real; 1: FIFO in ADC full real</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_busy_sts</name>
              <description>This bit reflects the ADC is busy or not. If the ADC is processing a conversion of a channel, this bit remains 1 which indicates it's busy. Once a conversion is done, this bit becomes 0 which indicates it's ready to do another conversion.
0: The ADC is ready.
1: The ADC is busy.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_INTR_CTRL</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>ADC Interrupt Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_it_comp_det_mod</name>
              <description>This bit controls the interrupt bit_adc_it_comp_chx operation. comparison criterion matching is rising edge.
0: The detection mode is level detection. when the comparison criterion is match, bit_adc_it_comp_chx will send interrupt continuously.
1: The detection mode is edge detection. when the comparison criterion is match, bit_adc_it_comp_chx will send interrupt once at the time of matching.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_break_timeout_en</name>
              <description>When the ADC does not respond for a long time due to CTC occupation, an interrupt will be triggered.
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch10_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch9_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch8_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch7_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch6_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch5_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch4_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch3_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch2_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch1_en</name>
              <description>the function is same as bit_adc_it_comp_ch0_en</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch0_en</name>
              <description>This bit controls the interrupt is enabled or not when channel 0 comparison criterion matches.
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_err_en</name>
              <description>This bit controls the interrupt is enabled or not when an error state takes place.
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_dat_ovw_en</name>
              <description>This bit controls the interrupt is enabled or not when a data overwritten situation takes place.
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_fifo_empty_en</name>
              <description>This bit controls the interrupt is enabled or not when a FIFO empty state takes place.
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_fifo_over_en</name>
              <description>This bit controls the interrupt is enabled or not when a FIFO overflow state takes place.
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_fifo_full_en</name>
              <description>This bit controls the interrupt is enabled or not when a FIFO full state takes place.
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_chcv_end_en</name>
              <description>This bit controls the interrupt is enabled or not when a particular channel conversion is done.
Please refer to reg_adc_it_chno_con
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_cv_end_en</name>
              <description>This bit controls the interrupt is enabled or not every time a conversion is done.
No matter ADC module is in what kind of operation mode. Every time a conversion is executed, ADC module would notify system if This bit is set.
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_it_cvlist_end_en</name>
              <description>This bit controls the interrupt is enabled or not when a conversion of the last channel in the list is done.
For example, in automatic mode conversions would be executed continuously.
Every time the last channel conversion is done, which means all channel conversions in the list is done, ADC could notify system if This bit is set.
0: This interrupt is disabled.
1: This interrupt is enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_INTR_RAW_STS</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>ADC Interrupt Raw Status Register</description>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_break_timeout_raw_sts</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch10_raw_sts</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch9_raw_sts</name>
              <description>merged</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch8_raw_sts</name>
              <description>merged</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch7_raw_sts</name>
              <description>merged</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch6_raw_sts</name>
              <description>merged</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch5_raw_sts</name>
              <description>merged</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch4_raw_sts</name>
              <description>merged</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch3_raw_sts</name>
              <description>merged</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch2_raw_sts</name>
              <description>merged</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch1_raw_sts</name>
              <description>merged</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch0_raw_sts</name>
              <description>merged</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_err_raw_sts</name>
              <description>merged</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_dat_ovw_raw_sts</name>
              <description>merged</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_fifo_empty_raw_sts</name>
              <description>merged</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_fifo_over_raw_sts</name>
              <description>merged</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_fifo_full_raw_sts</name>
              <description>merged</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_chcv_end_raw_sts</name>
              <description>merged</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_cv_end_raw_sts</name>
              <description>merged</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_cvlist_end_raw_sts</name>
              <description>merged</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
