Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_ADC_INTR_STS</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>ADC Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_break_timeout_sts</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch10_sts</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch9_sts</name>
              <description>merged</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch8_sts</name>
              <description>merged</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch7_sts</name>
              <description>merged</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch6_sts</name>
              <description>merged</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch5_sts</name>
              <description>merged</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch4_sts</name>
              <description>merged</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch3_sts</name>
              <description>merged</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch2_sts</name>
              <description>merged</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch1_sts</name>
              <description>merged</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_comp_ch0_sts</name>
              <description>merged</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_err_sts</name>
              <description>merged</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_dat_ovw_sts</name>
              <description>merged</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_fifo_empty_sts</name>
              <description>merged</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_fifo_over_sts</name>
              <description>merged</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_fifo_full_sts</name>
              <description>merged</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_chcv_end_sts</name>
              <description>merged</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_cv_end_sts</name>
              <description>merged</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_it_cvlist_end_sts</name>
              <description>merged</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_IT_CHNO_CON</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>ADC Interrupt Channel Number Configuration Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_it_chno_con</name>
              <description>This field defines that ADC module should send interrupt signal to system when a conversion which of channel number is the same as this field. This register is only valid when bit_adc_it_chcv_end_en is set.
bit_adc_it_chno_con: channel number</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_FULL_LVL</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>ADC FIFO Full Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_full_lvl</name>
              <description>This field defines the FIFO full entry thredshold level and it's used for FIFO full interrupt. It should be set according to ADC FIFO depth.
A value of 0 sets the threshold for 1 entry, and a value of 15 sets the threshold for 16 entries.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_EXT_TRIG_TIMER_SEL</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>ADC External Trigger Timer Select Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_ext_trig_timer_sel</name>
              <description>These three bits defines which timer channel would be used to make ADC module do a conversion.
0: Timer module 0 is used as the comparator external trigger source.
1: Timer module 1 is used as the comparator external trigger source.
..
7: Timer module 7 is used as the comparator external trigger source.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH0</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>ADC Channel 0 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch0</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch0.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch0</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch0.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch0</name>
              <description>This field contains the newsest conversion data of channel 0
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch0</name>
              <description>This field contains the newsest conversion data of channel 0
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH1</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>ADC Channel 1 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch1</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch1.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch1</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch1.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch1</name>
              <description>This field contains the newsest conversion data of channel 1
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch1</name>
              <description>This field contains the newsest conversion data of channel 1
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH2</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description>ADC Channel 2 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch2</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch2.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch2</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch2.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch2</name>
              <description>This field contains the newsest conversion data of channel 2
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch2</name>
              <description>This field contains the newsest conversion data of channel 2
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH3</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>ADC Channel 3 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch3</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch3.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch3</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch3.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch3</name>
              <description>This field contains the newsest conversion data of channel 3
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch3</name>
              <description>This field contains the newsest conversion data of channel 3
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH4</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>ADC Channel 4 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch4</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch4.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch4</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch4.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch4</name>
              <description>This field contains the newsest conversion data of channel 4
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch4</name>
              <description>This field contains the newsest conversion data of channel 4
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH5</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>ADC Channel 5 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch5</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch5.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch5</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch5.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch5</name>
              <description>This field contains the newsest conversion data of channel 5
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch5</name>
              <description>This field contains the newsest conversion data of channel 5
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH6</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>ADC Channel 6 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch6</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch6.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch6</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch6.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch6</name>
              <description>This field contains the newsest conversion data of channel 6
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch6</name>
              <description>This field contains the newsest conversion data of channel 6
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH7</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>ADC Channel 7 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch7</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch7.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch7</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch7.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch7</name>
              <description>This field contains the newsest conversion data of channel 7
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch7</name>
              <description>This field contains the newsest conversion data of channel 7
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
