Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_ADC_DATA_CH8</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>ADC Channel 8 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch8</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch8.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch8</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch8.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch8</name>
              <description>This field contains the newsest conversion data of channel 8
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch8</name>
              <description>This field contains the newsest conversion data of channel 8
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH9</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>ADC Channel 9 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch9</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch9.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch9</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch9.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch9</name>
              <description>This field contains the newsest conversion data of channel 9
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch9</name>
              <description>This field contains the newsest conversion data of channel 9
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_CH10</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description>ADC Channel 9 Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_ch10</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_ch10.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_ch10</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takeing place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field. It would be cleared to 0 when a read operation of reg_adc_data_ch10.
0: There is no data overwritten case.
1: There is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_num_ch10</name>
              <description>This field contains the newsest conversion data of channel 10
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_ch10</name>
              <description>This field contains the newsest conversion data of channel 10
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DATA_GLOBAL</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description>ADC Global Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_dat_rdy_global</name>
              <description>This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of reg_adc_data_global</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_dat_ovw_global</name>
              <description>This bit indicates that there is a data overwritten situation in bit_adc_data_global takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written to data field.
0: there is no data overwritten case.
1: there is a data overwritten case.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_ch_num_global</name>
              <description>This field contains the newsest conversion data of channel in the list.
[19:16]: which channel in channel list the data belongs to, only valid when bit_adc_ch_unmask=1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bit_adc_data_global</name>
              <description>This field contains the newsest conversion data of channel in the list.
[15:0]: newest data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_FLR</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description>ADC FIFO Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_flr</name>
              <description>This field records the current ADC FIFO entry number.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLR_FIFO</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description>ADC Clear FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clr_fifo</name>
              <description>This bit is used to clear FIFO contents and makes it to the default status. Every time this bit is set to 1. FIFO would be cleared to the default status. Software should set this bit to 0 after FIFO is cleared.
0: No effect
1: Clear FIFO</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_SETTLE</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description>ADC Settle Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_settle_pow_on</name>
              <description>settle count for sample data from power on , the unit is  sample clock.
0 means no need to settle</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_settle_ch_switch</name>
              <description>settle count for sample data from chn switch, the unit is sample clock.
0 means no need to settle</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_OVERSAMPLE</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description>ADC Over Sample Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_osf</name>
              <description>oversampling right shift
000: no shift
001: shift 1-bit
010: shift 2-bit
011: shift 3-bit
100: shift 4-bit</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_osr</name>
              <description>over sample ratio
000: 1X,  oversample disable
001: 2x
010: 4x
011: 8x
100: 16x
101: 32x
110: 64x
111:128x
1000:256x</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_ov_mode</name>
              <description>Oversample mode
1-All oversampling conversions done in regular sequence
0-All oversampling conversions done in staggered sequence</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_PWR_CTRL</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description>ADC Power Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_pwr_keep</name>
              <description>keep adc power on at all times.  automatic adjustment resumes after shutdown.
0: disable
1: enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_dbg_en</name>
              <description>Debug port enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_dbg_sel</name>
              <description>Debug port select</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_pwr_ctrl</name>
              <description>This field is used to power control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_SW_TMODE</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description>ADC Software Test Mode</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_sw_tmode</name>
              <description>This bit is used to change the high 4 bits in FIFO.
0: normal mode, the high 4 bits will be null or the channel number
1: software test mode, the high 4 bits will be the counter number of sample points. (loop from 0 to 15)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_BRK_CNT</name>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <description>ADC Break Cnt Register</description>
          <resetValue>0x00004FFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>adc_break_timeout</name>
              <description>Set a time threshold for waiting to sample. If exceeded, an interrupt will be triggered.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_DUMMY</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description>ADC Dummy Register</description>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
