Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN1_REG</name>
      <groupName>CAN</groupName>
      <baseAddress>0x41804000</baseAddress>
      <size>0x00000400</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CAN_CTL</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>CAN bus control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_fd_ssp_auto</name>
              <description>automatic calculat ssp delay, ssp = second sample point</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_fd_crc_mode</name>
              <description>crc mode select
* 0: ISO crc
* 1: non-ISO crc</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_rxdma_en</name>
              <description>rx dma enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_fd_en</name>
              <description>enable CAN FD protocol</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_en</name>
              <description>rx fifo function enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>test_mode_en</name>
              <description>test mode enable, for lbk or silent mode use</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>auto_re_tx_en</name>
              <description>auto re-transmission enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_tri_sample</name>
              <description>triple sample mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bus_on_req</name>
              <description>request to bus_on</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_en</name>
              <description>can enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_STS</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>CAN bus status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bus_on_state</name>
              <description>bus state
* 1 means the can module is already bus on
* 0 means the can module is busoff</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_FIFO_STS</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>CAN bus FIFO status</description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>fifo_msg_lvl</name>
              <description>rx fifo message level</description>
              <bitRange>[6:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fifo_msg_overflow</name>
              <description>rx fifo overflow</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fifo_msg_empty</name>
              <description>rx fifo empty</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fifo_msg_full</name>
              <description>rx fifo full</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_BIT_TIMING</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>CAN2.0 bit timing</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_brp</name>
              <description>CAN bit timing perscaler = &lt;$bit:can_brp&gt;+1</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_sjw</name>
              <description>SJW length = &lt;$bit:can_sjw&gt;</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_tseg2</name>
              <description>TSEG2 length = &lt;$bit:can_tseg2+1&gt;</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_tseg1</name>
              <description>TSEG1 length = &lt;$bit:can_tseg1+1&gt;</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_FD_BIT_TIMING</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>CAN FD DATA field bit timing</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_fd_brp</name>
              <description>CAN bit timing perscaler = &lt;$bit:can_fd_brp&gt;+1</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_fd_sjw</name>
              <description>SJW length = &lt;$bit:can_fd_sjw&gt;</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_fd_tseg2</name>
              <description>TSEG2 length = &lt;$bit:can_fd_tseg2+1&gt;</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_fd_tseg1</name>
              <description>TSEG1 length = &lt;$bit:can_fd_tseg1&gt;+1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_FD_SSP_CAL</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>CAN FD SSP configuration</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_fd_ssp_dco2</name>
              <description>delay compensation offset2</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_fd_ssp_dco</name>
              <description>delay compensation offset</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_fd_ssp_min</name>
              <description>minimum of ssp from start of one bit, only functional when can_fd_ssp_auto set</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_fd_ssp</name>
              <description>ssp position, delay from start of one bit, if automatic calculation is enabled, the field will update after calculation</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_INT_EN</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>CAN interrupt control</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ram_move_done_int_mask</name>
              <description>ram move done interrupt mask
1: mask
0: unmask</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>busoff_int_mask</name>
              <description>wakeup interrupt mask
1: mask
0: unmask</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wakeup_int_mask</name>
              <description>wakeup interrupt mask
1: mask
0: unmask</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>error_int_mask</name>
              <description>error interrupt mask
1: mask
0: unmask</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_int_mask</name>
              <description>rx interrupt mask
1: mask
0: unmask</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_int_mask</name>
              <description>tx interrupt mask
1: mask
0: unmask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ram_move_done_int_en</name>
              <description>ram move done interrupt enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>busoff_int_en</name>
              <description>wakeup interrupt enbale</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wakeup_int_en</name>
              <description>wakeup interrupt enbale</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>error_int_en</name>
              <description>error interrupt enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_int_en</name>
              <description>rx interrupt enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_int_en</name>
              <description>tx interrupt enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB_RXINT_EN</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>CAN rx interrupt for message buffers</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_mb_rxint_en</name>
              <description>rx interrupt enable for each message buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB_TXINT_EN</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>CAN tx interrupt for message buffers</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_mb_txint_en</name>
              <description>tx interrupt enable for each message buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_INT_FLAG</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>CAN interrupt flags</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ram_move_done_int_flag</name>
              <description>data move from register to CAN IP internal RAM finished interupt, move from RAM to register done will NOT generate interrupt, write one to clear</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>busoff_int_flag</name>
              <description>busoff interrupt flag, write one to clear</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wakeup_int_flag</name>
              <description>wakeup interrupt flag, write one to clear</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>error_int_flag</name>
              <description>error interrupt flag, write to clear</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_int_flag</name>
              <description>rx interrupt flag, write to clear</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_int_flag</name>
              <description>tx interrupt flag, write to clear</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_ERR_STATUS</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>CAN error status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_error_rx</name>
              <description>can rx error flag</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_error_tx</name>
              <description>can tx error flag</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_error_ack</name>
              <description>latest error  is ack error</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_error_stuff</name>
              <description>latest error  is stuff error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_error_crc</name>
              <description>latest error  is ctc error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_error_form</name>
              <description>latest error  is form error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_error_bit1</name>
              <description>latest error  is bit1 error, tx=1 but rx=0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_error_bit0</name>
              <description>latest error  is bit0 error, tx=0 but rx=1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_ERR_CNT_CTL</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>CAN bus error counter control</description>
          <resetValue>0x00006000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_error_warn_th</name>
              <description>error counter warning threshold, programable, default 96. NOTES: 0~127 is availaible to both TEC and REC, 128~255 is only available to TEC</description>
              <bitRange>[16:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_err_cnt_clr</name>
              <description>write 1 to clear can_rec</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>tx_err_cnt_clr</name>
              <description>write 1 to clear can_tec</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_ERR_CNT_STS</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>CAN bus error counter status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_error_warning</name>
              <description>error counter arrive at warning threshold</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_error_busoff</name>
              <description>error counter arrive at bus off level</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_error_passive</name>
              <description>error counter arrive at error passive level</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_rec</name>
              <description>receive error count</description>
              <bitRange>[24:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_tec</name>
              <description>transmit error count</description>
              <bitRange>[8:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_TX_ERROR_FLAG</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>CAN tx error flag for each message buffe</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_tx_error_flag</name>
              <description>indicate which message tx buffer have error detected, cpu can write 1 to clear</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_TX_DONE</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>CAN tx done for message buffers</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_tx_done</name>
              <description>tx done for each message buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RX_DONE</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>CAN rx done for message buffers</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_rx_done</name>
              <description>rx done for each message buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_TIME_STAMP</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Timestamp function</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_time_stamp_en</name>
              <description>time stamp function enable and time stamp counter start</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_time_stamp_div</name>
              <description>timer stamp conter  prescalar</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_time_stamp</name>
              <description>time stamp counter value, up count</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
