Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CAN_MB_TRIGGER</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>CAN tx trigger by timer configuration</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_trigger_en</name>
              <description>End of message buffer base address in RAM</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_trigger_close_offset</name>
              <description>end of trigger time = &lt;$bit:tx_trigger_begin&gt; + &lt;$bit:tx_trigger_close_offset&gt;</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_trigger_begin</name>
              <description>start of trigger time</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RXDMA_CFG</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>RX dma configuration</description>
          <resetValue>0x00010002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_rxdma_owner</name>
              <description>can rxdma owner is :
0:GDMA
1:CAN</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_rxdma_src_msize</name>
              <description>rx dma burst size:
'b00: dma burst size=1
'b01: dma burst size=4
'b10: dma burst size=8
'b11: dma burst size=16</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_rxdma_frame_size</name>
              <description>can rx dma data frame size = ceil(&lt;rx_dma_data bytes number&gt;/4 ), for example: rx_dma_data is 9~12 bytes, frame size is 3</description>
              <bitRange>[13:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RX_DMA_DATA</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>Register for dma access message buffe</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_rx_dma_data</name>
              <description>For DMA read received data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_SLEEP_MODE</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>sleep mode request and wakeup pin digital filter</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_sleep_state</name>
              <description>can is sleep or not
1: is
0: isn't</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_sleep_en</name>
              <description>can sleep enable
1:request can to sleep mode
0:wakeup can</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_wakepin_flt_en</name>
              <description>wakeup pin digital filter enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_wakepin_flt_length</name>
              <description>wakeup pin digital filter length</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_TEST</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>test configuration</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_test_cfg</name>
              <description>2b'00: silence_mode
2b'01: external loopback mode (enable can_tx_so )
2b'10: internal loopback mode (can_tx_so tie 1)
2b'11: reserved</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB0_STS</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg0_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg0_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg0_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg0_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB1_STS</name>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg1_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg1_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg1_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg1_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB2_STS</name>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg2_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg2_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg2_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg2_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB3_STS</name>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg3_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg3_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg3_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg3_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB4_STS</name>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg4_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg4_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg4_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg4_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB5_STS</name>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg5_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg5_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg5_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg5_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB6_STS</name>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg6_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg6_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg6_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg6_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB7_STS</name>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg7_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg7_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg7_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg7_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB8_STS</name>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg8_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg8_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg8_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg8_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB9_STS</name>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg9_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg9_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg9_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg9_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB10_STS</name>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg10_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg10_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg10_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg10_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB11_STS</name>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg11_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg11_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg11_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg11_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB12_STS</name>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg12_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg12_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg12_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg12_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB13_STS</name>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg13_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg13_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg13_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg13_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
