Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CAN_MB14_STS</name>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg14_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg14_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg14_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg14_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB15_STS</name>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg15_rx_vld</name>
              <description>new message have been received in the message buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg15_rx_rdy</name>
              <description>the message buffer is ready for receiving a new message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg15_tx_done</name>
              <description>tx message in the message buffer finish sending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>can_msg15_tx_req</name>
              <description>tx message is pending for transmit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB0_CTRL</name>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg0_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg0_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB1_CTRL</name>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg1_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg1_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB2_CTRL</name>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000000C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg2_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg2_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB3_CTRL</name>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000012</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg3_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg3_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB4_CTRL</name>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000018</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg4_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg4_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB5_CTRL</name>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000001E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg5_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg5_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB6_CTRL</name>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000024</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg6_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg6_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB7_CTRL</name>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000002A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg7_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg7_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB8_CTRL</name>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000030</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg8_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg8_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB9_CTRL</name>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000036</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg9_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg9_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB10_CTRL</name>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000003C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg10_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg10_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB11_CTRL</name>
          <addressOffset>0x0000022C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000042</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg11_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg11_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB12_CTRL</name>
          <addressOffset>0x00000230</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000048</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg12_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg12_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB13_CTRL</name>
          <addressOffset>0x00000234</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000004E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg13_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg13_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB14_CTRL</name>
          <addressOffset>0x00000238</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000054</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg14_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg14_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB15_CTRL</name>
          <addressOffset>0x0000023C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000005A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg15_rxdma_en</name>
              <description>dma enable when the message buffer used as rx</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_msg15_ba</name>
              <description>message buffer base address in RAM</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MB_BA_END</name>
          <addressOffset>0x000002F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000060</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_msg_ba_end</name>
              <description>End of message buffer base address in RAM</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_15</name>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_15_3</name>
              <description>data_byte 4*15+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_15_2</name>
              <description>data_byte 4*15+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_15_1</name>
              <description>data_byte 4*15+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_15_0</name>
              <description>data_byte 4*15+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_14</name>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_14_3</name>
              <description>data_byte 4*14+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_14_2</name>
              <description>data_byte 4*14+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_14_1</name>
              <description>data_byte 4*14+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_14_0</name>
              <description>data_byte 4*14+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_13</name>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_13_3</name>
              <description>data_byte 4*13+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_13_2</name>
              <description>data_byte 4*13+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_13_1</name>
              <description>data_byte 4*13+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_13_0</name>
              <description>data_byte 4*13+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_12</name>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_12_3</name>
              <description>data_byte 4*12+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_12_2</name>
              <description>data_byte 4*12+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_12_1</name>
              <description>data_byte 4*12+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_12_0</name>
              <description>data_byte 4*12+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_11</name>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_11_3</name>
              <description>data_byte 4*11+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_11_2</name>
              <description>data_byte 4*11+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_11_1</name>
              <description>data_byte 4*11+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_11_0</name>
              <description>data_byte 4*11+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_10</name>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_10_3</name>
              <description>data_byte 4*10+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_10_2</name>
              <description>data_byte 4*10+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_10_1</name>
              <description>data_byte 4*10+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_10_0</name>
              <description>data_byte 4*10+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
