Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CAN_RAM_FDDATA_9</name>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_9_3</name>
              <description>data_byte 4*9+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_9_2</name>
              <description>data_byte 4*9+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_9_1</name>
              <description>data_byte 4*9+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_9_0</name>
              <description>data_byte 4*9+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_8</name>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_8_3</name>
              <description>data_byte 4*8+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_8_2</name>
              <description>data_byte 4*8+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_8_1</name>
              <description>data_byte 4*8+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_8_0</name>
              <description>data_byte 4*8+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_7</name>
          <addressOffset>0x00000320</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_7_3</name>
              <description>data_byte 4*7+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_7_2</name>
              <description>data_byte 4*7+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_7_1</name>
              <description>data_byte 4*7+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_7_0</name>
              <description>data_byte 4*7+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_6</name>
          <addressOffset>0x00000324</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_6_3</name>
              <description>data_byte 4*6+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_6_2</name>
              <description>data_byte 4*6+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_6_1</name>
              <description>data_byte 4*6+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_6_0</name>
              <description>data_byte 4*6+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_5</name>
          <addressOffset>0x00000328</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_5_3</name>
              <description>data_byte 4*5+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_5_2</name>
              <description>data_byte 4*5+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_5_1</name>
              <description>data_byte 4*5+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_5_0</name>
              <description>data_byte 4*5+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_4</name>
          <addressOffset>0x0000032C</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_4_3</name>
              <description>data_byte 4*4+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_4_2</name>
              <description>data_byte 4*4+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_4_1</name>
              <description>data_byte 4*4+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_4_0</name>
              <description>data_byte 4*4+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_3</name>
          <addressOffset>0x00000330</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_3_3</name>
              <description>data_byte 4*3+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_3_2</name>
              <description>data_byte 4*3+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_3_1</name>
              <description>data_byte 4*3+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_3_0</name>
              <description>data_byte 4*3+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_2</name>
          <addressOffset>0x00000334</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_2_3</name>
              <description>data_byte 4*2+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_2_2</name>
              <description>data_byte 4*2+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_2_1</name>
              <description>data_byte 4*2+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_2_0</name>
              <description>data_byte 4*2+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_1</name>
          <addressOffset>0x00000338</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_1_3</name>
              <description>data_byte 4*1+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_1_2</name>
              <description>data_byte 4*1+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_1_1</name>
              <description>data_byte 4*1+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_1_0</name>
              <description>data_byte 4*1+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_FDDATA_0</name>
          <addressOffset>0x0000033C</addressOffset>
          <size>32</size>
          <description>CAN data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_data_0_3</name>
              <description>data_byte 4*0+3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_0_2</name>
              <description>data_byte 4*0+2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_0_1</name>
              <description>data_byte 4*0+1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_data_0_0</name>
              <description>data_byte 4*0+0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_ARB</name>
          <addressOffset>0x00000340</addressOffset>
          <size>32</size>
          <description>CAN message buffer arb field configuration</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_rtr</name>
              <description>can frame RTR bit, determine DATA or REMOTE frame</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_ide</name>
              <description>can frame IDE bit, determine standard or extend format</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_id</name>
              <description>can frame ID, including high 11 bit standard ID and low 18 bit extend ID</description>
              <bitRange>[28:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_MASK</name>
          <addressOffset>0x00000344</addressOffset>
          <size>32</size>
          <description>CAN message buffer arb field mask configuration</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_rtr_mask</name>
              <description>can frame RTR mask, 0 means don't care, 1 means the bit should match</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_ide_mask</name>
              <description>can frame IDE mask, 0 means don't care, 1 means the bit should match</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_id_mask</name>
              <description>can frame ID mask, 0 means the ID bit in CAN_RAM_ARB don't care, 1 means the bit should match.</description>
              <bitRange>[28:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_RAM_CS</name>
          <addressOffset>0x00000348</addressOffset>
          <size>32</size>
          <description>CAN message type control</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_timestamp</name>
              <description>the received message time stamp</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_esi</name>
              <description>FD frame esi bit, indicate error passive of message sending node, read bit, should always write 0, hardware automatic fill</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_brs</name>
              <description>FD frame brs bit, indicate switch bit timing</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_edl</name>
              <description>FD frame edl bit, indicate it's a FD frame</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_autoreply</name>
              <description>set the message buffer with remote frame auto reply function</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_rxtx</name>
              <description>can frame RX or TX, 0 is for RX, 1 is for TX</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_lost</name>
              <description>data have lost in the read buffer, means more than one frame have beed received since last read; only avaliable when rx FIFO is disabled</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_dlc</name>
              <description>data length</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
