Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CAN_RAM_CMD</name>
          <addressOffset>0x0000034C</addressOffset>
          <size>32</size>
          <description>CAN message buffer access control</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_ram_start</name>
              <description>start to exchange data with RAM, the bit will clear automatically after the data change is finshed.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_dir</name>
              <description>0 is for read from RAM to CAN_RAM_* registers, 1 is for write from CAN_RAM_* to RAM</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_buffer_en</name>
              <description>enable the can_ram_acc_num specified message buffer for rx/tx</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data15</name>
              <description>access CAN_RAM_DATA_15 field, the field will exchange with RAM space</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data14</name>
              <description>access CAN_RAM_DATA_14 field, the field will exchange with RAM space</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data13</name>
              <description>access CAN_RAM_DATA_13 field, the field will exchange with RAM space</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data12</name>
              <description>access CAN_RAM_DATA_12 field, the field will exchange with RAM space</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data11</name>
              <description>access CAN_RAM_DATA_11 field, the field will exchange with RAM space</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data10</name>
              <description>access CAN_RAM_DATA_10 field, the field will exchange with RAM space</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data9</name>
              <description>access CAN_RAM_DATA_9 field, the field will exchange with RAM space</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data8</name>
              <description>access CAN_RAM_DATA_8 field, the field will exchange with RAM space</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data7</name>
              <description>access CAN_RAM_DATA_7 field, the field will exchange with RAM space</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data6</name>
              <description>access CAN_RAM_DATA_6 field, the field will exchange with RAM space</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data5</name>
              <description>access CAN_RAM_DATA_5 field, the field will exchange with RAM space</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data4</name>
              <description>access CAN_RAM_DATA_4 field, the field will exchange with RAM space</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data3</name>
              <description>access CAN_RAM_DATA_3 field, the field will exchange with RAM space</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data2</name>
              <description>access CAN_RAM_DATA_2 field, the field will exchange with RAM space</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data1</name>
              <description>access CAN_RAM_DATA_1 field, the field will exchange with RAM space</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_data0</name>
              <description>access CAN_RAM_DATA_0 field, the field will exchange with RAM space</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_arb</name>
              <description>access CAN_RAM_ARB field, the field will exchange with RAM space</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_cs</name>
              <description>access CAN_RAM_CS field, the field will exchange with RAM space</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_mask</name>
              <description>access CAN_RAM_MASK field, the field will exchange with RAM space</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_ram_acc_num</name>
              <description>access buffer number</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_DBG_PORT</name>
          <addressOffset>0x000003F8</addressOffset>
          <size>32</size>
          <description>debug register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>can_dbg_en</name>
              <description>debug port enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>can_dbg_sel</name>
              <description>debug port selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_DUMMY</name>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
          <description>dummy register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>rsvd for hw</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
