Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SDIO_WIFI_REG</name>
      <baseAddress>0x41881000</baseAddress>
      <size>0x000000E4</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000000E4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPDIO_TXBD_ADDR</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_TXFIFO_ADDR</name>
              <description>The base address of TXBD The value of this register should be configure by CPU It should be 4 byte alignment (Because TXBD Size is 8 Byte).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_TXBD_NUM</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_TXBD_NUM</name>
              <description>The Number of TXBD. Unit: Number The value of this register should be configured by CPU</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_TXBD_WPTR</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_TXBD_H2C_WPTR</name>
              <description>When the packet has been sent from Host to TX Buffer, this index should be updated by SDIO IP.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_TXBD_RPTR</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_TXBD_H2C_RPTR</name>
              <description>When the packet has been processed by CPU and moved to MAC TX FIFO, this index should be updated by CPU.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_RXBD_ADDR</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_RXBD_ADDR</name>
              <description>The base address of RX BD. The value of this register should be configured by CPU. It should be 8-Byte alignment</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_RXBD_NUM</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_RXBD_NUM</name>
              <description>The total count of RX BD The value of this register should be configured by CPU. The unit is BD count</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_RXBD_C2H_WPTR</name>
          <addressOffset>0x000000B6</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_RXBD_C2H_WPTR</name>
              <description>When the packet has been processed by CPU and to be moved to host, this index should be updated by CPU</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_RXBD_C2H_RPTR</name>
          <addressOffset>0x000000B8</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_RXBD_C2H_RPTR</name>
              <description>When the packet has been moved to host, this index should be updated by SDIO IP.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_HCI_RX_REQ</name>
          <addressOffset>0x000000BA</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HCI_RX_REQ</name>
              <description>CPU triggers this bit to enable SDIO IP RX transfer by fetch BD info. SDIO fetch BD to get the RX length and address and transfer RX packet to Host, and clear this bit when all BD transfer done.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_CPU_RST_SDIO_DMA</name>
          <addressOffset>0x000000BB</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_RST_SDIO_DMA</name>
              <description>CPU set this bit to reset SDIO DMA. This bit is auto clear.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AVAL_PG_INT_OPT</name>
              <description>set 1 to disable clearing tx_aval_pg_int by read tx_aval_pg_num</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_RX_REQ_ADDR</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_RX_REQ_ADDR</name>
              <description>The address of the requested RX Packet. This is unnecessary for driver.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_CPU_INT_MASK</name>
          <addressOffset>0x000000C0</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H2C_SUS_REQ_MSK</name>
              <description>This bit is clear, and H2C_SUS_REQ is masked</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_CMD11_INT_MSK</name>
              <description>This bit is clear, and HOST_CMD11_INT is masked</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_WAKE_CPU_INT_MSK</name>
              <description>This bit is clear, and HOST_WAKE_CPU_INT is masked</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BD_AVAI_INT_MSK</name>
              <description>This bit is clear, and RX_BD_AVAI_INT is masked</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BD_FLAG_ERR_INT_MSK</name>
              <description>This bit is clear, and RX_BD_FLAG_ERR_INT is masked</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_RST_CMD_INT_MSK</name>
              <description>This bit is clear, and SDIO_RST_CMD_INT is masked</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RPWM2_INT_MSK</name>
              <description>This bit is clear, and RPWM2_INT is masked</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RPWM_INT_MSK</name>
              <description>This bit is clear, and RPWM_INT is masked</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H2C_MSG_INT_MSK</name>
              <description>This bit is clear, and H2C_MSG_INT is masked</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C2H_DMA_OK_MSK</name>
              <description>This bit is clear, and C2H_DMA_OK _INT is masked</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H2C_DMA_OK_MSK</name>
              <description>This bit is clear, and H2C_DMA_OK _INT is masked</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H2C_BUS_RES_FAIL_MSK</name>
              <description>This bit is clear, and H2C_BUS_RES_FAIL_INT is masked</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBD_H2C_OVF__MSK</name>
              <description>This bit is clear, and TXBD_H2C_OVF is masked</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_CPU_INT_STATUS</name>
          <addressOffset>0x000000C2</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H2C_SUS_REQ</name>
              <description>Host write sdio local reg to trigger suspend request interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_CMD11_INT</name>
              <description>When Host sends CMD11 to notify that the signal voltage level is going to switch to 1.8v, the HW should issue this interrupt to notify the local CPU to do the LDO power voltage level switch.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_WAKE_CPU_INT</name>
              <description>When Host Send TRX CMD53 while CPU is not ready (SYSTEM_CPU_RDY_IND=0, or CPU_RDY_IND=0), trigger this interrupt to wake CPU, and then indicate BUSY status to host. CPU should be able to receive this interrupt even CPU clock is gated; therefore, this interrupt should be connected to System On circuit.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BD_AVAI_INT</name>
              <description>If the free RXBD Number become larger than FREE_RXBD_COUNT(0x1D8), trigger this interrupt. This interrupt trigger only once when free RXBD number cross FREE_RXBD_COUNT</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BD_FLAG_ERR_INT</name>
              <description>Trigger by SDIO to CPU when detect RX_BD error</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_RST_CMD_INT</name>
              <description>Trigger by SDIO to CPU when SDIO is reset. CPU should be able to receive this interrupt even CPU clock is gated; therefore, this interrupt should be connected to System On circuit.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RPWM2_INT</name>
              <description>Trigger by SDIO to CPU that RPWM2 occurs (HRPWM2 is toggled) CPU should be able to receive this interrupt even CPU clock is gated; therefore, this interrupt should be connected to System On circuit.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RPWM1_INT</name>
              <description>Trigger by SDIO to CPU that RPWM1 occurs(HRPWM1 is toggled) CPU should be able to receive this interrupt even CPU clock is gated; therefore, this interrupt should be connected to System On circuit.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H2C_MSG_INT</name>
              <description>Trigger by SDIO to CPU that H2C_MSG_INT occurs(REG_SDIO_H2C_MSG is toggled)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C2H_DMA_OK</name>
              <description>Trigger by SDIO to CPU that packet is sent from RXFIFO to Host</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H2C_DMA_OK</name>
              <description>Trigger by SDIO to CPU that packet is sent from Host to TXFIFO</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H2C_BUS_RES_FAIL</name>
              <description>If SDIO is going to move packet to TX FIFO and fails to get bus resource, this interrupt raise. Driver Write 1 clear</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBD_H2C_OVF</name>
              <description>If there is not enough TX_BD for TX Packet, this bit raise. Driver Write 1 clear</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_CCPWM</name>
          <addressOffset>0x000000C4</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_CCPWM_PS</name>
              <description>device write 1 to trigger interrupt to host</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPDIO_CCPWM</name>
              <description>ccpwm</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_SYS_CPU_INDICATION</name>
          <addressOffset>0x000000C5</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DL_DONE</name>
              <description>Host write firmware update done, sync to this bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>READEE_DONE</name>
              <description>After cccr reg is configured, write this bit to 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTEM_CPU_RDY_IND</name>
              <description>Used to indicate that CPU is ready for TRX. Default: 0 This bit is synchronized to CPU_RDY_IND(Offset: 0x87)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_CCPWM2</name>
          <addressOffset>0x000000C6</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_CCPWM2_PS</name>
              <description>device write 1 to trigger interrupt to host</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPDIO_CCPWM2</name>
              <description>ccpwm2</description>
              <bitRange>[14:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_CPU_H2C_MSG</name>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_H2C_MSG_PS</name>
              <description>host write 1 to trigger interrupt to device</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_H2C_MSG</name>
              <description>Driver to FW Message</description>
              <bitRange>[30:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_CPU_C2H_MSG</name>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_C2H_MSG_PS</name>
              <description>device write 1 to trigger interrupt to host</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_C2H_MSG</name>
              <description>FW to Driver Message</description>
              <bitRange>[30:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_CRPWM</name>
          <addressOffset>0x000000D0</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_HRPWM_PS</name>
              <description>host write 1 to trigger interrupt to device</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPDIO_HRPWM</name>
              <description>hrpwm</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_CRPWM2</name>
          <addressOffset>0x000000D2</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPDIO_HRPWM2_PS</name>
              <description>host write 1 to trigger interrupt to device</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPDIO_HRPWM2</name>
              <description>NO USED</description>
              <bitRange>[14:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
