Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>SPDIO_AHB_DMA_CTRL</name>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00200000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DISPATCH_TXAGG_PKT</name>
              <description>Enable SPDIO to dispatch the Aggregated TX packet.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_BURST_TYPE</name>
              <description>This field is used to control to SPDIO AHB support Burst type.  b100: Support Burst 16 DW b010: Support Burst 8 DW b001: Support Burst 4 DW Default is b111, all support.</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_AHB_BUSY_WAIT_CNT</name>
              <description>When SPDIO RX transfer, AHB controller will wait BUSY counter for AHB access target not response READY signal. If timeout, AHB controller will issue AHB_BUS_RES_FAIL INT to CPU.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBM_SPDIO_TRANS</name>
              <description>SPDIO AHB Master HTRANS signal</description>
              <bitRange>[23:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBM_SPDIO_READY</name>
              <description>SPDIO AHB Master Hready signal</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_DMA_CS</name>
              <description>AHB DMA state</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPDIO_RXFF_WLEVEL</name>
              <description>SPDIO FIFO RX water level Range 1~126, it can be modified only when AHB_DMA_CS = 000</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPDIO_TXFF_WLEVEL</name>
              <description>SPDIO FIFO TX water level Range 1~126, it can be modified only when AHB_DMA_CS = 000</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIO_FREE_RXBD_COUNT</name>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00010100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREE_RXBD_COUNT</name>
              <description>If SPDIO_RXBD_C2H_RPTR is updated and the free RXBD Number is larger than FREE_RXBD_COUNT, trigger RX_BD_AVAI_INT interrupt.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_BUFF_UNIT_SIZE</name>
              <description>The Size of each single TX Buffer which is addressed by TX_BD Unit: 64Byte Ex: 0x01=&gt;64Byte     0x10=&gt;1024Byte</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_CNT</name>
              <description>The SPDIO Local FIFO counter, for debug usage</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_REG</name>
      <baseAddress>0x41009000</baseAddress>
      <size>0x00000100</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPIO_DR</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Port data register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PORT_DATA</name>
              <description>Values written to this register are output on the I/O signals for Portx if the corresponding data direction bits for Portx are set to Output mode and the corresponding control bit for Portx is set to software mode. The value read back is equal to the last value written to this register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_DDR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Port data direction register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PORT_DATA_DIRECTION</name>
              <description>Values written to this register independently control the direction of the corresponding data bit in Portx. The default direction can be configured as input or output after system reset through the GPIO_DFLT_DIR_x parameter.
0: Input (default)
1: Output</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT_EN</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>Port interrupt enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_INT_EN</name>
              <description>Allows each bit of Portx to be configured for interrupts. By default, the generation of interrupts is disabled. Whenever a 1 is written to a bit of this register, it configures the corresponding bit on Portx to become an interrupt; otherwise, Portx operates as a normal GPIO signal. Interrupts are disabled on the corresponding bits of Portx if the corresponding data direction register is set to Output or if
Portx mode is set to Hardware.
0: Configure Portx bit as normal GPIO signal (default)
1: Configure Portx bit as interrupt</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT_MASK</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>Port interrupt mask register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_INT_MASK</name>
              <description>Controls whether an interrupt on Portx can create an interrupt for the interrupt controller by not masking it. By default, all interrupts bits are unmasked. Whenever a 1 is written to a bit in this register, it masks the interrupt generation capability for this signal; otherwise interrupts are allowed through. The unmasked status can be read as well as the resultant status after masking.
0: Interrupt bits are unmasked (default)
1: Mask interrupt</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT_TYPE</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>Port interrupt trigger type register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_INT_TYPE</name>
              <description>Controls the type of interrupt that can occur on Portx.
Whenever a 0 is written to a bit of this register, it configures the
interrupt type to be level-sensitive; otherwise, it is edge-sensitive.
0: Level-sensitive (default)
1: Edge-sensitive</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT_POLARITY</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>Port interrupt polarity register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_INT_POLARITY</name>
              <description>Controls the polarity of edge or level sensitivity that can occur on input of Portx. Whenever a 0 is written to a bit of this register, it configures the interrupt type to falling-edge or active-low sensitive; otherwise, it is rising-edge or active-high sensitive.
0: Active-low (default)
1: Active-high</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT_STATUS</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Port interrupt status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_INT_STATUS</name>
              <description>Interrupt status of Portx.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT_STATUS_RAW</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Port raw interrupt status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_RAW_INT_STATUS</name>
              <description>Raw interrupt status of Portx (premasking bits).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_DEBOUNCE</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Port interrupt debounce register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_DEBOUNCE_EN</name>
              <description>Controls whether an external signal that is the source of an interrupt needs to be debounced to remove any spurious glitches. Writing a 1 to a bit in this register enables the debouncing circuitry. A signal must be valid for two periods of an external clock before it is internally
processed.
0: No debounce (default)
1: Enable debounce 
This register is available only if Portx is configured to generate interrupts (GPIO_PORTA_INTR = Include (1)) and when the debounce logic is included (GPIO_DEBOUNCE = Include (1)).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT_EOI</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>Port edge type interrupt clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_INT_EOI</name>
              <description>Controls the clearing of edge type interrupts from Portx.
When a 1 is written into a corresponding bit of this register, the interrupt is cleared. All interrupts are cleared when Portx is not configured for interrupts.
0: No interrupt clear (default)
1: Clear interrupt</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_PORT</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>External Port data register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_EXT_PORTA</name>
              <description>When Portx is configured as Input, then reading this location reads the values on the signal. When the data direction of Portx is set as Output, reading this location reads the data register for Portx.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_ITN_LS_SYNC</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>Port level interrupt synchronization</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_Level_SYNC</name>
              <description>Writing a 1 to this register results in all level-sensitive interrupts being synchronized to pclk_intr.
0: No synchronization to pclk_intr (default)
1: Synchronize to pclk_intr</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_ID_CODE</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>Port GPIO ID code register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_ID_CODE</name>
              <description>This register is available only if Portx is configured to generate interrupts (GPIO_PORTx_INTR = Include (1)) and interrupt detection is configured to generate on both rising and falling edges of external input signal (GPIO_INT_BOTH_EDGE=Include (1)).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT_BOTHEDGE</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>Port both edge interrupt register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_INT_BOTHEDGE</name>
              <description>Controls the edge types of interrupt that can occur on Portx.
Whenever a particular bit is programmed to 1, it enables the generation of interrupt on both the rising edge and falling edge of an external input signal corresponding to that bit on Port.
The values programmed in the registers gpio_intype_level and gpio_int_polarity for this particular bit are not considered when the corresponding bit of this register is set to 1.
Whenever a particular bit is programmed to 0, the interrupt type depends on the value of the corresponding bits in the gpio_inttype_level and gpio_int_polarity registers.
0: Disabled. Single edge sensitive
1: Enabled. Both edge sensitive</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_VER_ID_CODE</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>Port GPIO component version register</description>
          <resetValue>0x3231302A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_VER_ID_CODE</name>
              <description>ASCII value for each number in the version, followed by *. For example 32_30_31_2A represents the version 2.01*.
Reset Value: See the releases table in the Release Notes.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_DUMMY</name>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description>No real reg, only for run_espec.py</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
