Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>IC_TX_ABRT_SOURCE</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>I2C Transmit Abort Source Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ABRT_SLV_ARBLOST</name>
              <description>* 1: Slave lost the bus while transmitting data to a remote master. IC_TX_ABRT_SOURCE [12] is set at the same time.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_SLVFLUSH_TXFIFO</name>
              <description>* 1: Slave has received a read command and some data exists in the TXFIFO so the slave issues a TX_ABRT interrupt to flush old data in TXFIFO.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARBT_LOST</name>
              <description>* 1: Master has lost arbitration, or if IC_TX_ABRT_SOURCE [* 14] is also set, then the slave transmitter has lost arbitration.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_MASTER_DIS</name>
              <description>* 1: User tries to initiate a Master operation with the Master mode disabled.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_10B_RD_NORSTRT</name>
              <description>* 1: The restart is disabled and the master sends a read command in * 10-bit addressing mode.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_SBYTE_NORSTRT</name>
              <description>* 1: The restart is disabled and the user is trying to send a START Byte.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_HS_NORSTRT</name>
              <description>* 1: The restart is disabled and the user is trying to use the master to transfer data in High Speed mode.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_SBYTE_ACKDET</name>
              <description>* 1: Master has sent a START Byte and the START Byte was acknowledged (wrong behavior).</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_HS_ACKDET</name>
              <description>* 1: Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior).</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_GCALL_READ</name>
              <description>* 1: I2C in master mode sent a General Call but the user programmed the byte following the General Call to be a read from the bus.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_GCALL_NOACK</name>
              <description>* 1: I2C in master mode sent a General Call and no slave on the bus acknowledged the General Call.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_TXDATA_NOACK</name>
              <description>* 1: This is a master-mode only bit. Master has received an acknowledgement for the address, but when it sent data byte(s) following the address, it did not receive an acknowledge from the remote slave(s).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_10ADDR2_NOACK</name>
              <description>* 1: Master is in * 10-bit address mode and the second byte of the * 10-bit address was not acknowledged by any slave.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_10ADDR1_NOACK</name>
              <description>* 1: Master is in * 10-bit address mode and the first * 10-bit address byte was not acknowledged by any slave.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_7B_ADDR_NOACK</name>
              <description>* 1: Master is in 7-bit addressing mode and the address sent was not acknowledged by any slave</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_SLV_DATA_NACK_ONLY</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>Generate Slave Data NACK Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NACK</name>
              <description>Generate NACK. This NACK generation only occurs when I2C is a slave-receiver. If this register is set to a value of 1, it can only generate a NACK after a data byte is received; hence, the data transfer is aborted and the data received is not pushed to the receive buffer.
When the register is set to a value of 0, it generates NACK/ACK, depending on normal criteria.
* 1: generate NACK after data byte received
* 0: generate NACK/ACK normally</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_DMA_CR</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>DMA Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDMAE</name>
              <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel.
* 0: Transmit DMA disabled
* 1: Transmit DMA enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDMAE</name>
              <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel.
* 0: Receive DMA disabled
* 1: Receive DMA enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_DMA_TDLR</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>DMA Transmit Data Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMATDL</name>
              <description>Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE=1.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_DMA_RDLR</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>I2C Reveive Data Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMARDL</name>
              <description>Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level=DMARDL+1; that is, the dma_tx_req signal is generated when the number of valid data entries in the receive FIFO is equal to or more than this field value+1, and RDMAE=1. For instance, when DMARDL is 0, the dma_rx_req is asserted when 1 or more data entries are present in the receive FIFO.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_SDA_SETUP</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>I2C SDA Setup Register</description>
          <resetValue>0x00000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_SDA_SETUP</name>
              <description>Set the required SDA setup time in units of ic_clk period.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_ACK_GENERAL_CALL</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description>I2C ACK General Call Register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACK_GEN_CALL</name>
              <description>* 1: I2C responds with a ACK when it receives a General Call.
* 0: I2C does not generate General Call interrupts.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_ENABLE_STATUS</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description>I2C Enable Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>busy_in_mode</name>
              <description>* 00: I2C is disable while busy in legacy mode
* 01: I2C is disable while busy in DMA mode
* 10: I2C is disable while busy in Descriptor mode</description>
              <bitRange>[4:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SLV_DISABLE_WHILE_BUSY</name>
              <description>Slave Disabled While Busy (Transmit, Receive). This bit indicates if a potential or active Slave operation has been aborted due to the setting of the IC_SLAVE_DISBALE register from 1 to 0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IC_EN</name>
              <description>ic_en Status. This bit always reflects the value driven on the output port ic_en.
* 1: I2C is deemed to be in an enabled state.
* 0: I2C is deemed completely inactive.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_DMA_CMD</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description>I2C DMA Command Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMODE_RESTART</name>
              <description>This bit controls whether a RESTART is issued after the byte is sent or received in DMA mode.
* 1: a RESTART is issued after the data is sent/received (according to the value of CMD_RW), regardless of whether or not the transfer direction is changing from the previous command.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMODE_STOP</name>
              <description>This bit controls whether a STOP is issued after the byte is sent or received in DMA mode.
* 1: STOP is issued after this byte, regardless of whether or not the Tx FIFO is empty. If the Tx FIFO is not empty, the master immediately tries to start a new transfer by issuing a START and arbitrating for the bus.
* 0: STOP is not issued after this byte.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMODE_CMD</name>
              <description>This bit controls whether a read or write is performed in DMA mode. This bit does not control the direction when the I2C acts as a slave. It controls only the direction when it acts as a master.
* 1: Read
* 0: Write</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMODE_ENABLE</name>
              <description>* 1: Set to enable dma mode, clear when transfer is done</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_DMA_DATA_LEN</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description>I2C DMA Mode Transfer Data Length Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_DAT_LEN</name>
              <description>DMA transfer data length</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_DMA_MODE</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description>I2C DMA Mode Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_MODE</name>
              <description>* 0: DWC DMA legacy mode
* 1: DMA with control register
* 2: DMA with transfer descriptor</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_DEBUG_SEL</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description>I2C Debug SEL Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_DEBUG_SEL</name>
              <description>* 0: Debug clock
* 1: Debug APB
* 2: RSVD
* 3: Debug FIFO
* 4: Debug Timing
* 5: Debug Slave Mode Address Match
* 6: Debug Interrupt</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_OUT_SMP_DLY</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_OUT_SMP_DLY</name>
              <description>Delay cycles for sample of master drived SCL value. The sample of master drived SCL is used for slave stretch. 
Slave stretch is valid when master drive SCL High, but slave drive SCL low.
Valid value of IC_OUT_SMP_DLY is 0-7. Inicate a delay of 1-8 cycles.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_ADDR_MATCH</name>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <description>Clear Slave Mode Address Match Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_CLR_ADDR_MATCH</name>
              <description>Read this register to clear the slave mode address match interrupt (bit 12&amp;13) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_DMA_DONE</name>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <description>Clear DMA DONE Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_CLR_RAW_INTR_STAT</name>
              <description>Read this register to clear the DMA_DONE interrupt (bit 15) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_FILTER</name>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <description>I2C Filter Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_DIG_FLTR_SEL</name>
              <description>1: Enable filter</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IC_DIG_FLTR_DEG</name>
              <description>DIG_FLTR_DEG is to define frequency range of filter. A greater value of DIG_FLTR_DEG results in a slower transfer speed and hardware would be able to filter a lower frequency.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_SAR2</name>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <description>I2C Slave2 Address Register</description>
          <resetValue>0x00000012</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_SAR2</name>
              <description>The IC_SAR2 holds the slave address when the I2C is operating as slave2. Slave2 only supports 7 bit address.
The register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE register being set to 0. Writes at other times have no effect.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_COMP_VERSION</name>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <description>I2C Component Version Register</description>
          <resetValue>0x20200702</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_COMP_VERSION</name>
              <description>I2C version number</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_DUMMY</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description>IC Dummy Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>rsvd for hw</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
