Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C1_REG</name>
      <groupName>I2C</groupName>
      <baseAddress>0x41897000</baseAddress>
      <size>0x00000104</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000104</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IC_CON</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>I2C Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_SLAVE_DISABLE_1</name>
              <description>This bit controls whether I2C has its slave2 (7-bit address) disabled.
* 0: slave2 is enabled
* 1: slave2 is disabled</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IC_SLAVE_DISABLE_0</name>
              <description>This bit controls whether I2C has its slave1 (7-bit or 10-bit address) disabled. 
* 0: slave1 is enabled
* 1: slave1 is disabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IC_RESTATRT_EN</name>
              <description>Determine whether RESTART conditions may be sent when acting as a master. 
* 0: disable
* 1: enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IC_10BITADDR_SLAVE</name>
              <description>When acting as a slave, this bit controls whether the I2C responds to 7- or 10-bit addresses. 
* 0: 7-bit addressing
* 1: 10-bit addressing</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPEED</name>
              <description>These bits control at which speed the I2C operates; its setting is relevant only if one is operating the I2C in master mode. 
* 1: standard mode (0 to 100kbit/s)
* 2: fast mode (&lt;=400kbit/s)
* 3: high speed mode (&lt;=3.4Mbit/s)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MASTER_MODE</name>
              <description>This bit controls whether the I2C master is enabled. 
* 0: master disabled
* 1: master enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_TAR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>I2C Target Address Register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_10BITADDR_MASTER</name>
              <description>Control whether I2C starts its transfers in 7- or 10-bit addressing mode when acting as a master.
* 0: 7-bit addressing
* 1: 10-bit addressing</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPECIAL</name>
              <description>This bit indicates whether software performs a General Call or START BYTE command.
* 0: ignore bit 10 GC_OR_START and use IC_TAR normally
* 1: perform special I2C command as specified in GC_OR_START bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GC_OR_START</name>
              <description>If SPECIAL is set to 1, then this bit indicates whether a General Call or START BYTE command is to be performed by I2C. (ic_clk domain)
* 0: General Call - after issuing a General Call, only write may be performed
* 1: START BYTE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IC_TAR</name>
              <description>This is the target address for any master transaction. When transmitting a General Call, these bits are ignored. To generate a START BYTE, the CPU needs to write only once into these bits.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_SAR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>I2C Slave Address Register</description>
          <resetValue>0x00000011</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_SAR</name>
              <description>The IC_SAR holds the slave address when the I2C is operating as slave1. For 7-bit addressing, only IC_SAR[6:0] is used.
The register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE register being set to 0. Writes at other times have no effect.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_HS_MAR</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>I2C High Speed Master Mode Code Address Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_HS_MAR</name>
              <description>This bit field holds the value of the I2C HS mode master code. HS-mode master codes are reserved 8-bit codes (00001xxx) that are not used for slave addressing or other purposes. 
This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE register being set to 0. Write at other times have no effect.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_DATA_CMD</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>I2C Rx/Tx Data Buffer and Command Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NULL_DATA</name>
              <description>*1 :  null data transfer</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CMD_RESTART</name>
              <description>This bit controls whether a RESTART is issued after the byte is sent or received. 
* 1: a RESTART is issued after the data is sent/received (according to the value of CMD_RW), regardless of whether or not the transfer direction is changing from the previous command.</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CMD_STOP</name>
              <description>This bit controls whether a STOP is issued after the byte is sent or received.
* 1: STOP is issued after this byte, regardless of whether or not the Tx FIFO is empty. If the Tx FIFO is not empty, the master immediately tries to start a new transfer by issuing a START and arbitrating for the bus.
* 0: STOP is not issued after this byte.</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CMD_RW</name>
              <description>This bit controls whether a read or write is performed. This bit does not control the direction when the I2C acts as a slave. It controls only the direction when it acts as a master.
* 1: Read
* 0: Write</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>IC_DATA</name>
              <description>This register contains the data to be transmitted or received on the I2C bus. If you are writing to this register and want to perform a read, these bits are ignored by the I2C. However, when you read this register, these bits return the value of data received on the I2C interface.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_SS_SCL_HCNT</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>Standard Speed I2C Clock SCL High Count Register</description>
          <resetValue>0x00000190</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_SS_SCL_HCNT</name>
              <description>This register sets the SCL clock high-period count for standard speed. 
This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. 
This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE register being set to 0. Writes at other times have no effect.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_SS_SCL_LCNT</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>Standard Speed I2C Clock SCL Low Count Register</description>
          <resetValue>0x000001D6</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_SS_SCL_LCNT</name>
              <description>This register sets the SCL clock low-period count for standard speed. 
This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. 
This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE register being set to 0. Writes at other times have no effect.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_FS_SCL_HCNT</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>Fast Speed I2C Clock SCL High Count Register</description>
          <resetValue>0x0000003C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_FS_SCL_HCNT</name>
              <description>This register sets the SCL clock high-period count for fast speed. 
This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. 
This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE register being set to 0. Writes at other times have no effect.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_FS_SCL_LCNT</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>Fast Speed I2C Clock SCL Low Count Register</description>
          <resetValue>0x00000082</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_FS_SCL_LCNT</name>
              <description>This register sets the SCL clock low-period count for fast speed. 
This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. 
This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE register being set to 0. Writes at other times have no effect.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_HS_SCL_HCNT</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>High Speed I2C Clock SCL High Count Register</description>
          <resetValue>0x00000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_HS_SCL_HCNT</name>
              <description>This register sets the SCL clock high-period count for high speed. 
This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. 
This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE register being set to 0. Writes at other times have no effect. 
The SCL High time depends on the loading of the bus. For 100pF loading, the SCL High time is 60ns; for 400pF loading, the SCL High time is 120ns.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_HS_SCL_LCNT</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>High Speed I2C Clock SCL Low Count Register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_HS_SCL_LCNT</name>
              <description>This register sets the SCL clock low-period count for high speed. 
This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. 
This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE register being set to 0. Writes at other times have no effect. 
The SCL Low time depends on the loading of the bus. For 100pF loading, the SCL High time is 160ns; for 400pF loading, the SCL High time is 320ns.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_INTR_STAT</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>I2C Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R_LP_WAKE_2</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_LP_WAKE_1</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_GEN_CALL</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_START_DET</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_STOP_DET</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_ACTIVITY</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_RX_DONE</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_TX_ABRT</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_RD_REQ</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_TX_EMPTY</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_TX_OVER</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_RX_FULL</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_RX_OVER</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_RX_UNDER</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_INTR_MASK</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>I2C Interrupt Mask Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M_LP_WAKE_2</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_LP_WAKE_1</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_GEN_CALL</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_START_DET</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_STOP_DET</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_ACTIVITY</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_RX_DONE</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_TX_ABRT</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_RD_REQ</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_TX_EMPTY</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_TX_OVER</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_RX_FULL</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_RX_OVER</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>M_RX_UNDER</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
