Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>IC_RAW_INTR_STAT</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>I2C Raw Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP_WAKE_2</name>
              <description>Set when  address SAR_2 match with address sending on I2C BUS.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_WAKE_1</name>
              <description>Set when  address SAR match with address sending on I2C BUS.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_CALL</name>
              <description>Set only when a General Call address is received and it is acknowledged.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>START_DET</name>
              <description>Indicates whether a START or RESTART condition has occurred on the I2C interface regardless of whether I2C is operating in slave or master mode.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STOP_DET</name>
              <description>Indicates whether a STOP condition has occurred on the I2C interface regardless of whether I2C is operating in slave or master mode.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTIVITY</name>
              <description>This bit captures I2C activity.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_DONE</name>
              <description>When the I2C is acting as a slave-transmitter, this bit is set to 1 if the master does not acknowledge a transmitted byte. This occurs on the last byte of the transmission, indicating that the transmission is done.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_ABRT</name>
              <description>This bit indicates if I2C as a transmitter, is unable to complete the intended actions on the contents of the transmit FIFO. This situation can occur both as an I2C master or an I2C slave, and is referred to as a 'transmit abort'.
* 1: the IC_TX_ABRT_SOURCE register indicates the reason why the transmit abort take places.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_REQ</name>
              <description>This bit is set to 1 when I2C is acting as a slave and another I2C master is attempting to read data from I2C. The I2C holds the I2C bus in a wait state(SCL=0) until this interrupt is serviced, which means that the slave has been addressed by a remote master that is asking for data to be transferred. The processor must respond to this interrupt and then write the requested data to the IC_DATA_CMD register.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_EMPTY</name>
              <description>This bit is set to 1 when the transmit buffer is at or below the threshold value set in the IC_TX_TL register. It is automatically cleared by hardware when the buffer level goes above the threshold.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_OVER</name>
              <description>Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and the processor attempts to issue another I2C command by writing to the IC_DATA_CMD register.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_FULL</name>
              <description>Set when the receive buffer goes above the RX_TL threshold in the IC_RX_TL register. It is automatically cleared by hardware when buffer level is equal to or less than the threshold.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_OVER</name>
              <description>Not used. Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an additional byte is received from an external I2C device.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_UNDER</name>
              <description>Set if the processor attempts to read the receive buffer when it is empty by reading from the IC_DATA_CMD register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_RX_TL</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>I2C Receive FIFO Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_RX_0_TL</name>
              <description>Receive FIFO Threshold Level.
Control the level of entries (or above) that triggers the RX_FULL interrupt (bit 2 in IC_RAW_INTR_STAT register).</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_TX_TL</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>I2C Transmit FIFO Threshold Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_TX_0_TL</name>
              <description>Transmit FIFO Threshold Level.
Control the level of entries (or below) that triggers the TX_EMPTY interrupt (bit 4 in IC_RAW_INTR_STAT register).</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_INTR</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Clear Combined and Individual Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_INRT</name>
              <description>Read this register to clear the combined interrupt, all individual interrupts, and the IC_TX_ABRT_SOURCE register. This bit does not clear hardware clearable interrupts but software clearable interrupts.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_RX_UNDER</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Clear RX_UNDER Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_RX_UNDER</name>
              <description>Read this register to clear the RX_UNDER interrupt (bit 0) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_RX_OVER</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Clear RX_OVER Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_RX_OVER</name>
              <description>Read this register to clear the RX_OVER interrupt (bit 1) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_TX_OVER</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>Clear TX_OVER Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_TX_OVER</name>
              <description>Read this register to clear the TX_OVER interrupt (bit 3) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_RD_REQ</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>Clear RD_REQ Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_RD_REQ</name>
              <description>Read this register to clear the RD_REQ interrupt (bit 5) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_TX_ABRT</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>Clear TX_ABRT Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_TX_ABRT</name>
              <description>Read this register to clear the TX_ABRT interrupt (bit 6) of IC_RAW_INTR_STAT register, and the IC_TX_ABRT_SOURCE register. This is also releases the TX FIFO from the flushed/reset state, allowing more writes to the TX FIFO.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_RX_DONE</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>Clear RX_DONE Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_RX_DONE</name>
              <description>Read this register to clear the RX_DONE interrupt (bit 7) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_ACTIVITY</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>Clear ACTIVITY Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_ACTIVITY</name>
              <description>Read this register to clear the ACTIVITY interrupt if the I2C is not active anymore. If the I2C module is still active on the bus, the ACTIVITY interrupt bit continues to be set. It is automatically cleared by hardware if the module is disabled and if there is no further activity on the bus. The value read from this register to get status of the ACTIVITY interrupt (bit 8) of the IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_STOP_DET</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>Clear STOP_DET Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_STOP_DET</name>
              <description>ead this register to clear the STOP_DET interrupt (bit 9) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_START_DET</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>Clear START_DET Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_START_DET</name>
              <description>ead this register to clear the START_DET interrupt (bit 10) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_CLR_GEN_CALL</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>Clear GEN_ALL Interrupt Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_GEN_CALL</name>
              <description>ead this register to clear the GEN_CALL interrupt (bit 11) of IC_RAW_INTR_STAT register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_ENABLE</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>I2C Enable Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORCE</name>
              <description>Force master I2C stop transfer immediately after IC_ENABLE set 0.
* 1:  when IC_ENABLE is set 0 during transfer, force master FSM go to IDLE immediately.
* 0:  when IC_ENABLE is set 0 during transfer, master FSM while finish current transition (include RESTART) before go to IDLE.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Control whether the I2C is enabled.
* 0: Disable I2C (TX and RX FIFOs are held in an erased state)
* 1: Enable I2C</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_STATUS</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>I2C Status Register</description>
          <resetValue>0x00000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bus_monitor_status</name>
              <description>BUS monitor status: 
* 2'b00: IDLE
* 2'b01: ADDR
* 2'b10: DATA
* 2'b11:STRTCH</description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SLV_ACTIVITY</name>
              <description>Slave FSM Activity Status. When the Slave FSM is not in the IDLE state, this bit is set.
* 0: Slave FSM is in the IDLE state so the slave part of I2C is not active
* 1: Slave FSM is not he IDLE state so the slave part of I2C is active</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MST_ACTIVITY</name>
              <description>Master FSM Activity Status. When the Master FSM is not in the IDLE state, this bit is set.
* 0: Master FSM is in the IDLE state so the master part of I2C is not active
* 1: Master FSM is not he IDLE state so the master part of I2C is active</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RFF</name>
              <description>Receive FIFO Completely Full. When the receive FIFO is completely full, this bit is set. When the receive FIFO contains one or more empty location, this bit is cleared.
* 0: Receive FIFO is not full
* 1: Receive FIFO is full</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RFNE</name>
              <description>Receive FIFO Not Empty. This bit is set when the receive FIFO contains one or more entries; it is cleared when the receive FIFO is empty.
* 0: Receive FIFO is empty
* 1: Receive FIFO is not empty</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit FIFO Completely Empty. When the transmit FIFO is completely empty, this bit is set. When it contains one or more valid entries, this bit is cleared. This bit field does not request an interrupt.
* 0: Transmit FIFO is not empty
* 1: Transmit FIFO is empty</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFNF</name>
              <description>Transmit FIFO Not Full. Set when the transmit FIFO contains one or more empty locations, and is cleared when the FIFO is full.
* 0: Transmit FIFO is full
* 1: Transmit FIFO is not full</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IC_ACTIVITY</name>
              <description>I2C Activity Status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_TXFLR</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>I2C Transmit FIFO Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXFLR</name>
              <description>Transmit FIFO Level. Contains the number of valid data entries in the transmit FIFO.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_RXFLR</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description>I2C Receive FIFO Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXFLR</name>
              <description>Receive FIFO Level. Contains the number of valid data entries in the receive FIFO.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_SDA_HOLD</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>I2C SDA Hold Time Length Register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC_SDA_HOLD</name>
              <description>Set the required SDA hold time in units of ic_clk period.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
