Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I3C_REG</name>
      <baseAddress>0x41890000</baseAddress>
      <size>0x000002C0</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000002C0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CCR</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Configuration Control Register</description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA</name>
              <description>DMAC handshake interface support
Exists: TAG &gt;= 2.2.1</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_RX</name>
              <description>DMAC handshake TX enable
Exists: TAG &gt;= 2.2.1</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_TX</name>
              <description>DMAC handshake RX enable
Exists: TAG &gt;= 2.2.1</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INTR_DIS</name>
              <description>Interrupt global disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DARB_DIS</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CARB_DIS</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IXC_DIS</name>
              <description>IXC IP disable
1 = disable
0 = enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCTRL</name>
              <description>Secondary Control mode enable for CCR.ROLE=TAGT.Only Can be set 1 when config I3CC_SCTRL = 1 in config form file, otherwise this bit would be always 0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCR</name>
              <description>1: Primary Control
0: Not Primary Control</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ROLE</name>
              <description>Role of the rxi356_i3cc
Write:
0 - Role is the primary controller
1 - Role is the target
Read: 
0 - Role is the Active controller
1 - Role is the target</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPCR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>I3C/I2C protocol control Register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JESD</name>
              <description>JESD Spec enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEC</name>
              <description>PEC CRC enable. Can be enable when INTEL = 1 or JESD =1 .</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BRST</name>
              <description>Bus Reset (TimedReset) enable. Can be enable when INTEL = 1 or JESD =1 .</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCLR</name>
              <description>Bus Clear Enable. Can be enable when INTEL = 1 or JESD =1 .</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN</name>
              <description>BL Enable for Intel Spec</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAR_DIS</name>
              <description>Parity Check Disable (Can be disable when INTEL = 1 or JESD = 1).</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEL</name>
              <description>INTEL Spec enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEL_EXT</name>
              <description>Intel spec extend
bit 23: intel_ddr : 0 (disable) / 1 (enable)
bit 22: intel_as : 0 (disable) / 1 (enable)
bit 21: intel_ccc : 0 (disable) / 1 (enable)
bit 20: intel_ga : 0 (disable) / 1 (enable)</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTRY_CNT</name>
              <description>Read Retry Count for ROLE = CTRL.
RTRY_CNTretry numberTotal read cmd count
2'b00: No retry, total read cmd count=1
2'b01: Retry 1 time, total read cmd count=2
2'b10: Retry 2 times, total read cmd count=3
2'b11: Retry 3 times, total read cmd count=4</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BRSV_NCK</name>
              <description>Reserved</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCC_PEC</name>
              <description>1: Direct CCC cmd must includes pec byte, otherwise the pec_err &amp; intr_pece would toggle.
0: disable this feature (just for INTEL = 1), direct CCC cmd without PEC byte would be acceptted as normal cmd, and the the pec_err &amp; intr_pece would Not come out.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I2CC_DIS</name>
              <description>for TAGT: NACK I2C private access.
Maybe used in CTS 2.1.9 test.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WETM</name>
              <description>Write Early terminate, not supported Now</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RETM</name>
              <description>Read Early terminate, not supported Now</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TE_DIS</name>
              <description>TAGT ERROR Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CE_DIS</name>
              <description>CTRL ERROR Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>NAK_DIS</name>
              <description>RX NACK Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HDER_PP</name>
              <description>Enable Header Address turn to PP timing</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FT_OD</name>
              <description>Force Timing = OD</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HDEX_DIS</name>
              <description>HDR EXIT Pattern Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C</name>
              <description>I2C BUS enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSTALL</name>
              <description>SCL STALL feature enable.
Now always enable. (reserved)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>I/O Configuration Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLPBK</name>
              <description>SDA loop back calibration function enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLPBK</name>
              <description>SCL loop back calibration function enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_ERR</name>
              <description>Indicated for I3C Secondary Controller Handoff Procedure occured an error.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_ING</name>
              <description>Indicated for I3C Secondary Controller Handoff Procedure is going.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY_TO</name>
              <description>Indicated to turn to idle phase when SCL, SDA hold for tIDLE</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDA_DLY</name>
              <description>Indicated SDA delay count
Valid value: 0~4; others reserved
Exists: TAG &gt;= 2.0.3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLOD</name>
              <description>Force output: SCL in Open-Drain Status.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSTR</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Control Structure register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLUSH</name>
              <description>Flush BYFM/TXDA/RXDA &amp; recovery ixc status</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BFLUSH</name>
              <description>Flush BYFM FIFO</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFLUSH</name>
              <description>Flush TXDA FIFO</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RFLUSH</name>
              <description>Flush RXDA/RCMD FIFO</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ASTART</name>
              <description>Control strucure async mode0 flow start</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CDPIN</name>
              <description>CDPin start
Exists: TAG &gt;= 2.0.2</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Control strucure flow start</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBDR</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>SCL baud rate register</description>
          <resetValue>0x5004007D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BDR_FST</name>
              <description>Baud rate for the first header address</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDR_PP</name>
              <description>Baud rate for PP</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDR_OD</name>
              <description>Baud rate for OD</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>Current Status Register</description>
          <resetValue>0xF0002102</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSTRB</name>
              <description>APB read strob
Available value: 0x0, 0x1, 0x3, 0x7, 0xf</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DDR</name>
              <description>HDR-DDR mode</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CCC</name>
              <description>For target: receive a CCC cmd</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BCF</name>
              <description>BYFM CMD FIFO Full</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BCE</name>
              <description>BYFM CMD FIFO Empty</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNAK</name>
              <description>Received NACK</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXUN</name>
              <description>TXDA Underflow (reserved)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXF</name>
              <description>TXDA Full</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>TXDA EMPTY</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDP</name>
              <description>RX DATA Drop</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>RXDA Not Empty</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXF</name>
              <description>RXDA Full</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AMODE</name>
              <description>In Async mode0
Only can be programmed in ctrl mode, user set AMODE=1 to enter asyn mode0 and set AMODE=0 to exit asyn mode0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ABUSY</name>
              <description>1: Async mode0 flow is still busy (action Not Over)
0: Async mode0 flow is Not busy</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BBUSYN</name>
              <description>BBUSYN = 1: IXC Bus is NOT Busy (Idle). Bus has detected Stop.BBUSYN= 0: IXC Bus is Busy. Bus has detected Start.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>1: I3C/I2C transaction is still busy
0: I3C/I2C transaction is NOT busy (Idle)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
