Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>ICR</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TE5IC</name>
              <description></description>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TE4IC</name>
              <description></description>
              <bitRange>[28:28]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TE3IC</name>
              <description></description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TE2IC</name>
              <description></description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TE1IC</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TE0IC</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CE3IC</name>
              <description></description>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CE2IC</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CE0IC</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DDRE</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>STALL_TO</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BCLR</name>
              <description>Bus Clear</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BRST</name>
              <description>Bus Reset (TimedReset)</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DAF</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RDNG</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>PECE</name>
              <description>PEC CRC Error</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RETM</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WETM</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXSEC</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXHJI</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXIBI</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXNAK</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>PARE</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BYFME</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ECOM</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXDP</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TXF</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRINF</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>Transcation Information Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_INF</name>
              <description>[31:24]: for TAGT, receive CCC_CMD; for CTRL, receive IBI_MDB
[23:16]: for TAGT, reveive CCC.defining byte; for CTRL, reserved</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CCC</name>
              <description>For target: receive a CCC cmd</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXNS_NUM</name>
              <description>Transaction number for ROLE Ctrl</description>
              <bitRange>[13:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RDA</name>
              <description>For TAGT, HDR-DDR req's RnW.
For CTRL, IBI/HJ/SEC req's RnW.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DA</name>
              <description>For TAGT, HDR-DDR command code.
For CTRL, IBI/HJ/SEC req's DA.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBCR</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>BUS timing register</description>
          <resetValue>0x061A80A3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIDLE</name>
              <description>Bus IDLE Timing (tIDLE) count</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TBUF</name>
              <description>Bus Free Timing (tBUF) count</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TINIT</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>Initial timing register</description>
          <resetValue>0x005000FA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THIGH_OD</name>
              <description>SCL High count for OD timing</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TAVAL</name>
              <description>Bus Available Timing (tAVAL) count</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSR0</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>Timing START register0</description>
          <resetValue>0x0600284E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCAS</name>
              <description>tCAS timing count</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDS</name>
              <description>tDS timing count
Available value: 2'b00 ~ 2'b11</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>THD_STA</name>
              <description>tHD_STA timing count</description>
              <bitRange>[21:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSU_STA</name>
              <description>tSU_STA timing count</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSR1</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>Timing STOP register1</description>
          <resetValue>0x00000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSU_STO</name>
              <description>tSU_STO timing count</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSTMR</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Reserved</description>
          <resetValue>0x000030D4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSTA_TO</name>
              <description>Timeout count for pulling SCL=Low when SDA is Low at SEC HP flow.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Reserved</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSTALL_TO</name>
              <description>Timeout count for SCL stall. Timeout = TSTALL_TO*32.
Set 0 disable SCL stall timeout.
ex. set 1 =&gt; timeout occur when counter count 32T</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>THPR</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Reserved</description>
          <resetValue>0x007D001E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TNCRL</name>
              <description>tNEWCRLock timing count</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCRHPOVLP</name>
              <description>tCRHPOverlap timing count</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>THPTMR</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>Reserved</description>
          <resetValue>0x000030D4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSDA_TO</name>
              <description>Timeout count for pulling SDA=Low when SEC HP.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDLYR</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>Timing delay register</description>
          <resetValue>0x00040100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDGE</name>
              <description>RX SDR data capture edge
0: high edge
1: low edge
Only valid when cr_9dge set
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>9DGE</name>
              <description>RX SDR data capture edge
0: data+9th(ack, T bit) capture at high edge
cr_rhdy = 0; rx data: SDA before high edge according odly/pdly
cr_rhdy = 1; rx data: SDA after high edge according odly/pdly
1: according CR_RDGE determine capture edge</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ODLY</name>
              <description>SDA Received delay count for header/data phase with OD mode</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDLY</name>
              <description>SDA Received delay count for header/data phase with PP mode</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CDLY</name>
              <description>SCL Received delay count</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDLYR2</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>Timing delay register2</description>
          <resetValue>0x000B0105</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RHDY</name>
              <description>RX SDR data capture high edge with delay count
1: with delay count (ODLY/PDLY)
0: without delay count
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADLY</name>
              <description>SDA Received delay count for 9th of header/data phase with OD mode
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDR_RDGE</name>
              <description>Indicate capture point in DDR mode
Rely on CR_DDR_PDLY to determine capture data/point
0: capture data at edge, data is according to DDR_PDLY
DDR_PDLY= 0 =&gt; sda reg in delay 0T (sda_in_r)
DDR_PDLY= 1 =&gt; sda reg in delay 1T (sda_in_r1)
DDR_PDLY= 2 =&gt; sda reg in delay 2T (sda_in_r2)
DDR_PDLY= 3 =&gt; sda reg in delay 3T (sda_in_r3)
1: capture data after edge with delay (delay is according to DDR_PDLY)
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDR_PDLY</name>
              <description>SDA Received delay count for DDR mode</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_DLY</name>
              <description>The timing for SCL keep in low before preamble phase in DDR mode (min: BDR_PP)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRST</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>Timing bus reset register</description>
          <resetValue>0x00060000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BRST</name>
              <description>BUS reset timing count. Timeout = TSTALL_TO*64.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>METM</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>Monitor early terminate register</description>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DISEC_ADDR</name>
              <description>The dynamic address of the TAGT which won BUS arbitration and not known to be a Monitoring Device</description>
              <bitRange>[25:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_DISEC</name>
              <description>Indicate the BUS arbitration was won by a TAGT not known to be a Monitoring Device
User should disable this TAGT driven IBI</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ETM</name>
              <description>Indicate the previous transaction has been early terminated</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CETM_EN</name>
              <description>Enable CTRL early terminate feature to terminate long transactions</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CETM_MAX_LEN</name>
              <description>The maximum length of transaction that should be early terminated by CTRL
The maximum length = 256 * (CETM_MIN_LEN + CETM_MAX_LEN), unit: CTRL clk cycle</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CETM_MIN_LEN</name>
              <description>The minimum length of transaction that should not be early terminated by CTRL
The minimum length = 256 * CETM_MIN_LEN, unit: CTRL clk cycle</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFL</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>TXDA FIFO Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXFTL</name>
              <description>Waterlevel for DMAC TX handshake
If TXFTL = 0/1, I3CC only support single transcation; else, I3CC support burst + signle transcation (for DMAC flow, not I3C transcation).
Available value: 0x0, 0x1, 0x4, 0x8, 0x16, ... (&lt;= TDFR_DEPTH)
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFL</name>
              <description>TXDA FIFO level</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFL</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>RXDA FIFO Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXFTL</name>
              <description>Waterlevel for DMAC RX handshake
If RXFTL = 0/1, I3CC only support single transcation; else, I3CC support burst + signle transcation (for DMAC flow, not I3C transcation).
Available value: 0x0, 0x1, 0x4, 0x8, 0x16, ... (&lt;= RDFR_DEPTH)
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFL</name>
              <description>RXDA FIFO level</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
