Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>DBGI</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description>DBG Index Register</description>
          <resetValue>0x88000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_P_PH</name>
              <description>Debug infomation P_PH</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_D_PH</name>
              <description>Debug infomation D_PH</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_H_PH</name>
              <description>Debug infomation H_PH</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_S_PH</name>
              <description>Debug infomation S_PH</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_P_PH</name>
              <description>Debug information RX P_PH.
If detect START, RX_P_PH = 0
If detect STOP, RX_P_PH =1</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IXC_TX</name>
              <description>1 = IXC Send out SDA Data
0 = IXC Receive SDA Data</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DPIDX</name>
              <description>Debug Port Signal index
Bit[3]:
1: TIC_DP
0: IXC_DP
Bit[2:0]:Select 16 signals from total 64 signals.</description>
              <bitRange>[23:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TEST</name>
              <description>Test mode enable (1 = enable, 0 = disable)
Use a Vendor/Standard Extension - Direct CCCs to read/write access to rxi356_i3cc control registers</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_MEM</name>
              <description>Data register enable (1 = enable (only when TEST = 1), 0 = disable)
When enable, read/write will access to CR_MEM_DR, not FIFO.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDX</name>
              <description>Index of MDB list groups
0x0: MDB index to 31~0
0x1: MDB index to 63~32
0x2: MDB index to 95~64
0x3: MDB index to 127~96</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GIDX</name>
              <description>Debug index of debug FIFO</description>
              <bitRange>[9:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GSEL</name>
              <description>Debug access to BYFM/TXDA/BYFM/MDB
0x0: write access to MDB
0X1: read/write access to TXDA FIFO
0x2: read/write access to RXDA FIFO
0x3: read/write access to BYFM FIFO</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGR</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>DBG Data Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GDR</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EC</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>I3C Target Events Byte Register</description>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPLS</name>
              <description>For TAGT: indicate IBI payload size for SETMRL/GETMRL. the thrid byte data if BCR[2] == 1
For CTRL: indicate IBI Payload Max size. If the IBI length &gt; IPLS, CTRL would abort this IBI transaction.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPID</name>
              <description>Indicate I3C.
PID[31:0] value is used from CR_PIDH and CR_PIDL
If MPID == 1, I3C.PID[31:0] = \{CR_PIDH[15:0], CR_PIDL[31:16]}
If MPID == 0, I3C.PID[31:0] = I3CC input port: user_pid_31_0
*. PID[47:0] = \{CRR_PIDH[31:0], CR_PIDL[31:16]} needs to following I3C.PID format
If PID[32] == 1, PID[31:0] is vairable value</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HJ</name>
              <description>For TAGT: indicate Taget device. taget event[3] value
1: ENHJ by CCC: ENEC.taget event byte[3]
0: DISHJ by CCC: DISEC.taget event byte[3]
For CTRL:
If 1, then ACK Hot Join, and put interrupt rxhji.
If 0, then NACK Hot Join.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR</name>
              <description>For TAGT: indicate Taget device. taget event[1] value
1: ENCR by CCC: ENEC.taget event byte[1]
0: DISCR by CCC: DISEC.taget event byte[1]
For CTRL:
If 1, then ACK Ctrl Role Req, and put interrupt rxsec.
If 0, then NACK Ctrl Role Req.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INT</name>
              <description>For TAGT: indicate Taget device. taget event[0] value
1: ENINT by CCC: ENEC.taget event byte[0]
0: DISINT by CCC: DISEC.taget event byte[0]
For CTRL:
If 1, then ACK IBI Req, and put interrupt rxibi and received the IBI payload if the TAGT send.
If 0, then NACK IBI Req.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AS</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>Activity State Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS</name>
              <description>Indicate Taget device. activity status
Set value by CCC: ENTAS0~ENTAS3
ex: AS=0x1 written by ENTAS1
AS0: activity state 0; 1 us
AS1: activity state 1; 100 us
AS2: activity state 2; 2 ms
AS3: activity state 3; 50 ms</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MXL</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>Max Write/Read Length Register</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MRL</name>
              <description>Indicated the max read length for SETMRL/GETMRL
CR_MXL.MRL &gt;= CR_MXL_MIN.MRL_MIN</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MWL</name>
              <description>Indicated the max read length for SETXWL/GETMWL
CR_MXL.MWL &gt;= CR_MXL_MIN.MWL_MIN</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDL</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>PIDL register</description>
          <resetValue>0x13CC0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PID_l</name>
              <description>Indicated for I3C.PID[15:0]</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCR</name>
              <description>Indicated for I3C.BCR</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCR</name>
              <description>Indicated for I3C.DCR</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDH</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>PIDH register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PID_H</name>
              <description>Indicated for I3C.PID[47:16] 
*. Following I3C.PID format 
If PID[32] == 1, PID[31:0] is vairable value; default PID[31:0] = I3CC input port: user_pid_31_0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSA</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>Dynamic/Static Address Register</description>
          <resetValue>0x00004700</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAA_DONE</name>
              <description>Indicated for I3C.dynamic address assignment (DAA) flow is done. 
If CR_DSA.DAA=1, it is indicated 
1. Dynamic address is used for Taget address by SETDASA or ENTDAA. 
2. Static address used for Taget address by SETAASA.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DAA_ING</name>
              <description>Indicated for I3C.dynamic address assignment flow is going. 
It is set after ENTDAA command is executed.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STC_ADDR</name>
              <description>Indicated Static address[6:0] for target addreess[6:0]
Static address[17:8] for 10-bit Target addreess mode</description>
              <bitRange>[17:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DA1R_DIS</name>
              <description>For DA = 0x1 (SETDASA format 2), Read/GETCCC ACK disable
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DYN_ADDR</name>
              <description>Indicated Dynamic address[6:0] for Target addreess[6:0]</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCST</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description>Device Status (GETSTATUS) Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Indicate Target device current status
Reply the value by CCC: GETSTATUS</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MXDS</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description>Max Data Speed Register</description>
          <resetValue>0x00000840</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MXW</name>
              <description>Indicate Taget device. MXDS.MXR value; (defining byte support)transaction value by CCC: GETMXDS</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MXR</name>
              <description>Indicate Taget device. MXDS.MXR value
Reply the value by CCC: GETMXDS
Bit[6] Write-to-Read Permits Stop Between: private write / read with Sr are seperate transcations for IP.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUSC</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description>BUS context Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HID</name>
              <description>Indicate target device receive. CCC.SETHID
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSCON</name>
              <description>Indicate bus context
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPA</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description>Group Address Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPA2_A</name>
              <description>Group address 2 assigned
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPA2</name>
              <description>Indicated Group address 2 for target</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPA1_A</name>
              <description>Group address 1 assigned</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPA1</name>
              <description>Indicated Group address 1 for target</description>
              <bitRange>[14:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPA0_A</name>
              <description>Group address 0 assigned</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPA0</name>
              <description>Indicated Group address 0 for target</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CASYN</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description>Controller ASYN Timing Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ASYN_FAIL</name>
              <description>Indicate C_REF/C_C2 counter overflow</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ASYN</name>
              <description>Indicate ASYN IBI finished and inform user to read CASYN and TASYN</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>C_C2</name>
              <description>Controller counter from the first SCL positive-going edge after the IBI ACK to the first SCL positive-going edge after the T-Bit of the IBI's MDB</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>C_REF</name>
              <description>Controller counter from IBI start to the first SCL positive-going edge after the IBI ACK</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TASYN</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description>Target ASYN Timing Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_C2</name>
              <description>Target counter from the first SCL positive-going edge after the IBI ACK to the first SCL positive-going edge after the T-Bit of the IBI's MDB</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>T_C1</name>
              <description>Target counter from IBI start to the first SCL positive-going edge after the IBI ACK</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCTRL</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description>DEVCTRL Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEVCTRL3</name>
              <description>Byte 3 Data payload for CCC.DEVCTRL; when IPCR.INTEL = 1 or JESD =1
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DEVCTRL2</name>
              <description>Byte 2 Data payload for CCC.DEVCTRL; when IPCR.INTEL = 1 or JESD =1
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DEVCTRL1</name>
              <description>Byte 1 Data payload for CCC.DEVCTRL; when IPCR.INTEL = 1 or JESD =1
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DEVCTRL0</name>
              <description>Byte 0 Data payload for CCC.DEVCTRL; when IPCR.INTEL = 1 or JESD =1
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCAP</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description>DEVCAP Register</description>
          <resetValue>0x000000FC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEVCAP</name>
              <description>Data payload for CCC.DEVCAP 
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTIME</name>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <description>Exchange Timing Support Information Register</description>
          <resetValue>0x02001900</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTIME3</name>
              <description>Data byte (Supported Modes) for CCC.GETXTIME
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTIME2</name>
              <description>Data byte (State) for CCC.GETXTIME
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTIME1</name>
              <description>Data byte (Frequency) for CCC.GETXTIME
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XITME0</name>
              <description>Data byte (Inaccuracy) for CCC.GETXTIME
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENDXFER</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description>ENDXFER Early Termination Parameters Register</description>
          <resetValue>0x00FF0040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>METM_CAP</name>
              <description>Indicate Monitoring Device Early Termination Capability
8'hff: Disable all
8'h01: Enable on SDR
8'hfe: Disable on SDR
8'h02: Enable on HDR-DDR
8'hfd: Disable on HDR-DDR
Other settings are not supported
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_CRC</name>
              <description>2'b11: No CRC Word follows Early Termination request 
2'b01: CRC Word follows Early Termination
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_ETM</name>
              <description>Enable HDR WRITE Early Termination Request 
1'b0: Enable 
1'b1: Disable
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_NACK</name>
              <description>Enable ACK/NACK Capability for WRITE Command
1'b0: Enable 
1'b1: Disable
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
