Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>MXL_MIN</name>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <description>MRL/MRL defined Minimum value</description>
          <resetValue>0x00020002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MRL_MIN</name>
              <description>MRL defined minimum value</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MWL_MIN</name>
              <description>MWL defined minimum value</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MXDS_RT</name>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <description>Max Data ReadTurn Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MXDS_RTEN</name>
              <description>1'b1: IP will provide 3-byte RdTurn for CCC.GETMXDS
1'b0: No MaxRdTurn Bytes
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MXDS_RT</name>
              <description>3-byte MaxRdTurn</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTACT</name>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <description>RSTACT Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSTACT</name>
              <description>[31:24]: to store the defining byte previously received in Direct SET (contain 0x0-0x4). (auto_clear when receiving Start, not Sr) data for CCC.RSTACT direct get with def_byte = 0x0-0x3, 0x80
[23:16]: data for CCC.RSTACT direct get with def_byte = 0x83 (reserved)
[15:8]: data for CCC.RSTACT direct get with def_byte = 0x82 
[7:0]: data for CCC.RSTACT direct get with def_byte = 0x81
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_DR</name>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <description>Data register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEM_DR</name>
              <description>If CR_DBGI.CR_TEST = 1 &amp;&amp; CR_DBGI.CR_TEST_MEM = 1, then enable mem-type read/write
For private write, I3CC will update data from byte 0 to byte 3, other byte will be dropped (register index is needed, don't care about index value).
For private read, I3CC will proivide data from byte 0 to byte 3 (length default is 4, can be set to 1/2/3 by CCC.SETMRL)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RW_CMD</name>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <description>Vendor Direct CCC for access to CRs</description>
          <resetValue>0x000000EF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RW_CMD</name>
              <description>The code for Vender - Direct CCCs read/write access to CRs
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDB</name>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <description>MDB list Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MDB</name>
              <description>Indicate the index of MDB list to read/write the MDB information of the each Target device for Control device mode</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR0</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_0</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR1</name>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_1</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR2</name>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_2</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR3</name>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_3</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR4</name>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_4</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR5</name>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_5</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR6</name>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_6</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR7</name>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_7</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR8</name>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_8</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR9</name>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_9</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR10</name>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_10</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR11</name>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_11</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR12</name>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_12</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR13</name>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_13</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR14</name>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_14</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR15</name>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <description>Control BYFM FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYFM_FIFO_15</name>
              <description>BYFM FIFO index register to write 4-byte data toBYFM FIFO used to program I3C/I2C transaction operations. 
Support fixed or increased address.
And max addess is to write 64 byte data (&lt;= config:TXDA_DEPTH /4)
ex: 
1. Fixed address: 0x100 to read data of BYFM FIFO 
2. Increased address: 0x100~(0x100 +BYFM FIFO Depth/4 ) to write data of BYFM FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR0</name>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_0</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR1</name>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_1</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR2</name>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_2</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR3</name>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_3</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR4</name>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_4</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
