Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>TBDFR5</name>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_5</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR6</name>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_6</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR7</name>
          <addressOffset>0x0000015C</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_7</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR8</name>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_8</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR9</name>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_9</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR10</name>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_10</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR11</name>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_11</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR12</name>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_12</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR13</name>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_13</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR14</name>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_14</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBDFR15</name>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <description>Byte-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_15</name>
              <description>Tag &lt;= 2.2.0
TXDA FIFO index register to write 1/2/4-byte data. 
Tag &gt;= 2.2.1
TXDA FIFO index register to wirte 0/1-byte data 
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x140 to write data into TXDA FIFO 
2. Increased address: 0x140~ 0x17C to write data into TXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR0</name>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_0</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR1</name>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_1</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR2</name>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_2</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR3</name>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_3</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR4</name>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_4</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR5</name>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_5</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR6</name>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_6</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR7</name>
          <addressOffset>0x0000019C</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_7</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR8</name>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_8</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR9</name>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_9</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR10</name>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_10</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR11</name>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_11</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR12</name>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_12</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR13</name>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_13</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR14</name>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_14</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBDFR15</name>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <description>Byte-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_15</name>
              <description>Tag &lt;= 2.2.0
RXDA FIFO index register to read 4-byte data. 
Tag &gt;= 2.2.1
RXDA FIFO index register to read 1-byte data. 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x180 to read data from RXDA FIFO 
2. Increased address: 0x180~0x1BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
