Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CAPS</name>
          <addressOffset>0x000001F0</addressOffset>
          <size>32</size>
          <description>Capabilities register</description>
          <resetValue>0x00183101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GETCAP4</name>
              <description>Reserved</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GETCAP3</name>
              <description>[20] = 1: Defining Byte Support in GETSTATUS
[19] = 1: Defining Byte Support in GETCAPS</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GETCAP2</name>
              <description>[13:12] = 3: Group Address Capabilities , can be assigned three Group address
[11:8] = 1: I3C 1.x Specification Version = V1.1 
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GETCAP1</name>
              <description>[0] = 1: HDR Mode; 0: HDR-DDR
Exists: TAG &gt;= 2.1.0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GIT</name>
          <addressOffset>0x000001F8</addressOffset>
          <size>32</size>
          <description>GIT num register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAG_NUM</name>
              <description>Indicate the commit number of the released RTL code 
ex: tag 2.0.1 GIT_NUM = 0x00_02_00_01</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <addressOffset>0x000001FC</addressOffset>
          <size>32</size>
          <description>Identification Register</description>
          <resetValue>0x03560000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP_NUM</name>
              <description></description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RELEASE_DATE</name>
              <description>Indicate the IP release date for the particular project 
ex: the released date is 01/26, ELEASE_DAT =0x0126</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR0</name>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_0</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR1</name>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_1</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR2</name>
          <addressOffset>0x00000248</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_2</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR3</name>
          <addressOffset>0x0000024C</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_3</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR4</name>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_4</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR5</name>
          <addressOffset>0x00000254</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_5</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR6</name>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_6</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR7</name>
          <addressOffset>0x0000025C</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_7</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR8</name>
          <addressOffset>0x00000260</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_8</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR9</name>
          <addressOffset>0x00000264</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_9</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR10</name>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_10</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR11</name>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_11</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR12</name>
          <addressOffset>0x00000270</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_12</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR13</name>
          <addressOffset>0x00000274</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_13</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR14</name>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_14</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDFR15</name>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <description>Word-access TXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDA_FIFO_15</name>
              <description>TXDA FIFO index register to write 0/1/2/4-byte data. 
Default: 4-byte data, also support 0/1/2-byte data, decided by APB.PSTRB[3:0]
TXDA FIFO is used to program I3C/I2C transaction data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x240 to write data into TXDA FIFO 
2. Increased address: 0x240~ 0x27C to write data into TXDA FIFO 
Exist: Tag &gt;= 2.2.1</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR0</name>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_0</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR1</name>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_1</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR2</name>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_2</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR3</name>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_3</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR4</name>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_4</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR5</name>
          <addressOffset>0x00000294</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_5</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR6</name>
          <addressOffset>0x00000298</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_6</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
