Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>RWDFR7</name>
          <addressOffset>0x0000029C</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_7</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR8</name>
          <addressOffset>0x000002A0</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_8</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR9</name>
          <addressOffset>0x000002A4</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_9</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR10</name>
          <addressOffset>0x000002A8</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_10</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR11</name>
          <addressOffset>0x000002AC</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_11</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR12</name>
          <addressOffset>0x000002B0</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_12</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR13</name>
          <addressOffset>0x000002B4</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_13</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR14</name>
          <addressOffset>0x000002B8</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_14</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDFR15</name>
          <addressOffset>0x000002BC</addressOffset>
          <size>32</size>
          <description>Word-access RXDA FIFO register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDA_FIFO_15</name>
              <description>RXDA FIFO index register to read 4-byte data. 
Default: 4-byte data, also support pop 0-3 byte data when RXDA empty meets BUS/I3CC IDLE 
RXDA FIFO is used to read I3C/I2C recevied data.
Support fixed or increased address.
ex: 
1. Fixed address: 0x280 to read data from RXDA FIFO 
2. Increased address: 0x280~0x2BC to read data from RXDA FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
