Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>IPC_ISR</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>isr_tx0_empty_int15</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int14</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int13</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int12</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int11</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int10</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int9</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int8</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int7</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int6</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int5</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int4</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int3</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int2</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int1</name>
              <description>Refer to the description of the isr_tx0_empty_int0</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_tx0_empty_int0</name>
              <description>When all the data in ch0 is read by cpu1,it will be set to 1</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int15</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int14</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int13</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int12</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int11</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int10</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int9</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int8</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int7</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int6</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int5</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int4</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int3</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int2</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int1</name>
              <description>Refer to the description of the isr_rx0_int0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_rx0_int0</name>
              <description>fifo next pop chn0 data.when all the data in ch0 is read,it will be cleard</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_IMR</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>imr_tx0_empty</name>
              <description>0: Mask
1: Unmask</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>imr_rx0</name>
              <description>just useful  when  ipc_work_mode is 1.
0: Mask
1: Unmask</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_TX_ST</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x09C40080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx0_fifo_timeout_th</name>
              <description>If the number of data in the FIFO is below the threshold for a period longer than that set by this register, an interrupt will be triggered.</description>
              <bitRange>[30:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx0_fifo_af_level</name>
              <description>User define the full level for afifo. the vaule must &gt;=1.</description>
              <bitRange>[11:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx0_fifo_clr</name>
              <description>clear the FIFO data</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>tx0_fifo_wfull</name>
              <description>fifo full state</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx0_fifo_wspace</name>
              <description>the remaining writable space for the current fifo</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_RX_ST</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx0_fifo_empty</name>
              <description>When fifo is empty, rx0 _ch,rx0_data is invalid</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_RX_DATA</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx0_data</name>
              <description>Data info about fifo next pop data 
0: fifo next pop chn0 data
1: fifo next pop chn1 data
......</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_SW</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rsvd_sw1</name>
              <description>rsvd for sw</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_MODE</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ipc_work_mode</name>
              <description>0: without share mem
1:  with share mem</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_TIM</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>apb_timeout_flag</name>
              <description>If apb_rdy does not reply within a certain period of time, it will be pulled.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>apb_timeout_th</name>
              <description>If apb_rdy does not reply within a certain period of time, it will automatically reply.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_SEM_0</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sem_0_data</name>
              <description>It is used to indicate who owns this semaphore .</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_SEM_1</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sem_1_data</name>
              <description>It is used to indicate who owns this semaphore .</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_SEM_CPUID0</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sem_CPUID0_data</name>
              <description>It is used to indicate who owns this semaphore .</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_SEM_CPUID1</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sem_CPUID1_data</name>
              <description>It is used to indicate who owns this semaphore .</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_SEM_CPUID2</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sem_CPUID2_data</name>
              <description>It is used to indicate who owns this semaphore .</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_SEM_CPUID3</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sem_CPUID3_data</name>
              <description>It is used to indicate who owns this semaphore .</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC_DUMMY</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>Dummy reg</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
