Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LCDC_REG</name>
      <baseAddress>0x41888000</baseAddress>
      <size>0x00000100</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LCDC_CTRL</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>LCDC control register</description>
          <resetValue>0x00090000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lcdc_if_mode</name>
              <description>*0000: 8-bit MCU (RGB565/RGB888 support)
*0001: 16-bit MCU (RGB565 support)
*0010: 9-bit MCU (RGB666 support)
*0011: 18-bit MCU (RGB666 support)
*0100: 24-bit MCU (RGB888 support)
*1000: 6-bit RGB parallel interface (RGB565/RGB666 support)
*1001: 16-bit RGB parallel interface (RGB565 support)
*1010: 18-bit RGB parallel interface (RGB666 support)
*1011: 8-bit RGB parallel interface (RGB888 support)
*1100: 24-bit RGB parallel interface (RGB888 support)
*Others: Reserved</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcdc_if_mipi</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcdc_inst_dis</name>
              <description>Disable LCDC instantly.
Reset LCDC internal states and disable LCDC then clear both this bit and LCDCEN.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcdc_en</name>
              <description>Write 1 to enable LCDC.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_PLANE_SIZE</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>LCDC plane size register</description>
          <resetValue>0x014000F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>imageheight</name>
              <description>The height of panel (Y-channel based), the min. value is 0x1.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>imagewidth</name>
              <description>The width of panel (X-channel based), the min. value is 0x1.
*For LCD, it means pixel number per line.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_UNDFLW_CFG</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>LCDC underflow configuration register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dma_udf_opt</name>
              <description>0: output error data at current frame when dma underflow occurs
1: pause panel interface(clk and data) until underflow timeout counter reaches threshold value, then entering error mode
2: entering drop mode immediately when dma underflow occurs
3: pause panel interface(clk and data) until underflow timeout counter reaches threshold value, then  entering drop mode</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_un_mode</name>
              <description>*0:Output last data
*1:Output erroutdata</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>errout_data</name>
              <description>Output data when DMA FIFO underflow occurred. (directly mapping to output D[23:0])</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_DMA_MODE_CFG</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>LCDC DMA mode configuration register</description>
          <resetValue>0xF400000C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pif_hs_eol</name>
              <description>threshold value to check if panelif hs_cnt almost reaching end of line</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_udf_timeout</name>
              <description>threshold value for dma underflow timeout counter</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_fetched_thld</name>
              <description>threshold value for dma data_fetched indicator(start panelif FSM)</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_te_mode</name>
              <description>1: TE trigger-mode open, DMA refreshes frame manually based on panel TE input
0: use dma_triger_mode(bit 0 setting, auto or onetime)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rd_otsd</name>
              <description>The value of read outstanding -1, for DMA burst size configuration</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>triger_onetime</name>
              <description>Write '1', hardware DMA one frame from DMA buffer based on synchronous signal.
After DMA completed,this bit is cleared automatically.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_triger_mode</name>
              <description>DMA Trigger-mode enable.
*0: Auto-mode, open, DMA refreshes automatically based on synchronous signal.
*1: Trigger-mode open, DMA refreshes frame manually based on TRIGER_ONETIME bit of this register.
Trigger mode is useful for LCD with internal GRAM.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_SHW_RLD_CFG</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>LCDC shadow reload configuration register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dma_burst_opt</name>
              <description>0: axi 64-byte burst
1: axi 128-byte burst
2: axi 256-byte burst</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_auto_intvl</name>
              <description>interval between two dma transfer in auto-mode</description>
              <bitRange>[27:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VBR</name>
              <description>vertical blanking reload.
This bit is set by software and cleared only by hardware after reload (it cannot be cleared through register write once it is set).
0: no effect
1: The shadow registers are reloaded during the vertical blanking period (at the beginning of the first line after the active display area).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_COLOR_CFG</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>color config</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>color_format</name>
              <description>0000: RGB888
0001: RGB565
0010: RGB666
1000: BGR888
1001: BGR565
1010: BGR666</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_IRQ_EN</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>LCDC interrupt enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>panel_te_inten</name>
              <description>panel TE input interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>frm_start_inten</name>
              <description>DMA Frame start interrupt Enable. This bit can be set and cleared by software.
* 0: DMA Frame start interrupt disable
* 1: DMA Frame start interrupt enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>io_timeout_inten</name>
              <description>Write or read timeout interrupt Enable in MCU I/F I/O mode. This bit can be set and cleared by software.
* 0: MCU I/O mode write/read timeout interrupt disable
* 1: MCU I/O mode write/read  timeout interrupt enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcd_lin_inten</name>
              <description>Line Interrupt Enable. This bit can be set and cleared by software.
* 0: Line interrupt disable
* 1: Line Interrupt enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lcd_frd_inten</name>
              <description>LCD refresh frame done interrupt enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_un_inten</name>
              <description>DMA FIFO underflow interrupt enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_IRQ_STATUS</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>LCDC interrupt status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>panel_te_ints</name>
              <description>panel TE input interrupt status. Write 1 to clear it.
* 0: No panel TE input interrupt generated
* 1: A panel TE input interrupt is generated</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>frm_start_ints</name>
              <description>DMA frame start interrupt status. Write 1 to clear it.
* 0: No DMA frame start interrupt generated
* 1: A DMA frame start interrupt is generated</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>io_timeout_ints</name>
              <description>Write or read timeout interrupt status in MCU I/F I/O mode. Write 1 to clear it.
* 0: No write/read timeout interrupt generated.
* 1: A write/read timeout interrupt is generated.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>lcd_lin_ints</name>
              <description>Line Interrupt status. Write 1 to clear it.
* 0: No Line interrupt generated
* 1: A Line interrupt is generated, when a programmed line is reached
Note: When this bit is set and DMA fetches the first pixel data of the specified line number from frame buffer, the line interrupt happens. The line number depends on LCDC_LINE_INT_POS register value.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>lcd_frd_ints</name>
              <description>LCD refresh frame done interrupt status. Write 1 to clear it.
* 0: No LCD refresh frame done interrupt generated.
* 1: This interrupt generated, when sending LCD frame done.
Note: When this bit is set and DMA fetch the last pixel data from frame buffer, the After LCD refresh frame done, interrupt happens.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>dma_un_ints</name>
              <description>DMA FIFO underflow interrupt status. Write 1 to clear it.
* 0: No DMA FIFO underflow interrupt generated
* 1: Interrupt generated when DMA FIFO underflow happens</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_IRQ_RAW</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>LCDC raw interrupt register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>panel_te_intrs</name>
              <description>panel TE input raw interrupt status. No matter panel TE input interrupt is enabled or disabled, this bit is set when panel TE input interrupt happens. Writting 1 to the PANEL_TE_INTS field in register LCDC_IRQ_STATUS is to clear this bit.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>frm_start_intrs</name>
              <description>DMA frame start raw interrupt status. No matter DMA frame start interrupt is enabled or disabled, this bit is set when DMA frame start interrupt happens. Writting 1 to the FRM_START_INTS field in register LCDC_IRQ_STATUS is to clear this bit.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>io_timeout_intrs</name>
              <description>Write or read timeout interrupt raw interrupt status in MCU I/F I/O mode. No matter the I/O write/read timeout interrupt is enabled or disabled, this bit is set when I/O write/read timeout interrupt happens. Write 1 to the IO_TIMEOUT_INTS field in register LCDC_IRQ_STATUS to clear this bit.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>lcd_lin_intrs</name>
              <description>Line Interrupt raw status. No matter the line interrupt is enabled or disabled, this bit is set when line interrupt happens. Writting 1 to the LCD_LIN_INTS field in register LCDC_IRQ_STATUS is to clear this bit.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>lcd_frd_intrs</name>
              <description>LCD refresh frame done raw interrupt status. No matter the refresh done interrupt is enabled or disabled, this bit is set when refresh done interrupt happens. Writting 1 to the LCD_FRD_INTS field in register LCDC_IRQ_STATUS is to clear this bit.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>dma_un_intrs</name>
              <description>DMA FIFO underflow raw interrupt status. When LCDC DMA FIFO under flow event happens, this bit is set. Write 1 to the DMAUNINTS field in register LCDC_IRQ_STATUS to clear this bit.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_LINE_INT_POS</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>LCDC line interrupt position register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>line_int_pos</name>
              <description>Line Interrupt Position
These bits configure the line interrupt position.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_CUR_POS_STATUS</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>Display current position</description>
          <resetValue>0x00010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cur_pos_y</name>
              <description>Current Y Position
These bits return the current Y position.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cur_pos_x</name>
              <description>Current X Position
These bits return the current X position.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_DEBUG_STATUS</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>Debug signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lcdc_debug_states</name>
              <description>LCDC critial signal for debug</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_RGB_CFG</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>LCDC RGB mode config</description>
          <resetValue>0x00280000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rgb_sync_mode</name>
              <description>* 00: DE mode, frame synchronized with ENABLE signal
* 01: HV mode, frame synchronized with synchronous signal
* 10: TE mode
* Others: Reserved</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rgbif_update</name>
              <description>Force Hardware updates RGB I/F parameters after current LCD refresh frame done. 
CPU writes 1 to force Hardware updating parameters. After updating, this bit is cleared.
When the LCDC is running, if the following values related with RGB I/F mode are modified dynamically, only writing 1 to this bit can the newer value be used by hardware after the current frame refresh done.
* The CLKDIV field in the LCDC_CLK_DIV register
* The VFP, VBP, VSW fields in the LCDC_RGB_VSYNC_CFG register
* The HBP, HFP, HSW fields in the LCDC_RGB_HSYNC_CFG register</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rgbtepl</name>
              <description>The TE pulse polarity.
* 0: Low level for active pulse
* 1: High level for active pulse</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rgb_datpl</name>
              <description>The Data pulse polarity. 
* 0: Normal
* 1: Inverted</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>enpl</name>
              <description>The ENABLE pulse polarity.
* 0: Low level for active data
* 1: High level for active data</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hspl</name>
              <description>The HSYNC pulse polarity.
* 0: Low level synchronous clock
* 1: High level synchronous clock</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vspl</name>
              <description>The VSYNC pulse polarity.
* 0: Low level synchronous clock
* 1: High level synchronous clock</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dclkpl</name>
              <description>The polarity of the DCLK active edge.
* 0: Data fetched at DCLK rising edge
* 1: Data fetched at DCLK falling edge</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rgb_tedelay</name>
              <description>The delay interval -5. This interval is from detected TE signal to starting frame transfer. Unit: WR pulse width.
The maximum value is 65535.
The real delay interval is TEDELAY + 4 or TEDELAY + 5.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
