Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>LCDC_RGB_VSYNC_CFG</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>RGB Vsync config</description>
          <resetValue>0x00030301</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>vfp</name>
              <description>Front porch line number-1. The number of inactive lines at the end of a frame, before vertical synchronization period.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vbp</name>
              <description>Back porch line number-1. The number of inactive lines at the start of a frame, after vertical synchronization period.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vsw</name>
              <description>Vertical synchronization signal width -1. Unit: inactive lines</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_RGB_HSYNC_CFG</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>RGB Hsync config</description>
          <resetValue>0x001F1F17</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>hfp</name>
              <description>Horizontal front porch -1. The number of DCLK periods between the end of active data and the rising edge of HSYNC.
HFP's minimum value is 1</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hbp</name>
              <description>Horizontal back porch -1. The number of DCLK periods between the falling edge of HSYNC and the start of active data.
HBP's minimum value is 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hsw</name>
              <description>Horizontal synchronization signal width -1. Unit: DCLK
HSW's minimum value is 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_RGB_CLK_DIV</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>RGB clock divide</description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>clkdiv</name>
              <description>DCLK clock divider depends on this value. The relationship between them is as follows:
*0 : The DCLK clock divider is 2
*1 : The DCLK clock divider is 4
*2 : The DCLK clock divider is 6
*3 : The DCLK clock divider is 8
*...
The frequency of DCLK is derived from the following equation:
DCLK = SYS_CLK/((CLKDIV+1)*2) 
where CLKDIV is any even value between 0 and 65534.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_RGB_SYNC_STATUS</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>RGB HSYNC/VSYNC status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>vsstatus</name>
              <description>VSYNC Status.
00: VSYNC
01: VBP
11: ACTIVE
10: VFP</description>
              <bitRange>[3:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>hsstatus</name>
              <description>HSYNC Status.
00: HSYNC
01: HBP
11: ACTIVE
10: HFP</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CFG</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>LCDC mcu mode config</description>
          <resetValue>0x00000220</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tedelay</name>
              <description>The delay interval -5. This interval is from detected TE signal to starting frame transfer. Unit: WR pulse width.
The maximum value is 65535.
The real delay interval is TEDELAY + 4 or TEDELAY + 5.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dat_swap</name>
              <description>swap dat[15:8] with dat[7:0] in mcu 8-bit RGB565</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mcu_io_mode_run</name>
              <description>MCU I/F I/O mode run
* 0: DMA mode run
* 1: I/O mode run</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>mcu_io_mode_en</name>
              <description>MCU I/F I/O mode enable
* 0: Disable I/O mode and open DMA mode after I/O mode FIFO empty.
* 1: Enable I/O mode after current frame refresh.
Poll MCU_IO_MODE_RUN after updating this bit.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mcu_sync_mode</name>
              <description>* 00: Synchronized with the internal clock
* 01: Synchronized with VSYNC input
* 10: Tearing effect line on (Mode1, VSYNC)
* Others: Reserved</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mcuif_update</name>
              <description>Force Hardware to update MCU I/F Timing shadow register at specific timing. CPU writes 1 to force Hardware updating. After Hardware updating finished, this bit is cleared. Software can't write related shadow registers when MCUIFUPDATE is still active.
When the LCDC is running, if the following values related with MCU I/F mode are modified dynamically, only writing 1 to this bit can the newer value be used by hardware after the current frame refresh done.
* The TEDELAY field in the LCDC_MCU_CFG register
* The MCUVSW, MCUVSPD fields in the LCDC_MCU_VSYNC_CFG register
* The WRPULW, RDACTW, RDINACTW fields in the LCDC_MCU_TIMING_CFG register</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mcusypl</name>
              <description>The MCU VSYNC pulse polarity
* 0: Low level for active pulse
* 1: High level for active pulse</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tepl</name>
              <description>The TE pulse polarity.
* 0: Low level for active pulse
* 1: High level for active pulse</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mcu_datpl</name>
              <description>The Data pulse polarity.
* 0: Normal
* 1: Inverted</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rdpl</name>
              <description>The RD pulse polarity.
* 0: Data fetched at rising edge
* 1: Data fetched at falling edge</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wrpl</name>
              <description>The WR pulse polarity.
* 0: Data fetched at rising edge
* 1: Data fetched at falling edge</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rspl</name>
              <description>The RS pulse polarity.
* 0: Low level for command address
* 1: High level for command parameter</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cspl</name>
              <description>The CS pulse polarity.
* 0: Low level for active pulse
* 1: High level for active pulse</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_VSYNC_CFG</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>MCU Vsync config</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcuvspd</name>
              <description>* MCUIFMODE = 1: VSYNC idle period. This value equals to VSYNC period - IMAGEWIDTH * IMAGEHEIGHT * WR_pulse_per_pixel-5. Unit: WR pulse width.
* MCUIFMODE = 0: The buffer time between frames. This value equals to the time of a frame's end to the next start -5. Unit: WR pulse width.
* MCUIFMODE = 2: Invalid usage.
The maximum value is 1048571.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mcuvsw</name>
              <description>VSYNC signal width - 1. Unit: WR pulse width. (only for MCU VSYNC mode)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_TIMING_CFG</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>MCU timing config</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rdinactw</name>
              <description>RD inactive pulse width -1. Unit: system clock</description>
              <bitRange>[31:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rdactw</name>
              <description>RD active pulse width -1. Unit: system clock</description>
              <bitRange>[20:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wrpulw</name>
              <description>Write clock divider depends on this value. The relationship between them is as follows:
* 0:  The write clock divider is 2
* 1:  The write clock divider is 4
* 2:  The write clock divider is 6
* 3:  The write clock divider is 8
*...
The frequency of write clock is derived from the following equation:
Write clock = SYS_CLK/((WRPULW+1) * 2) 
where WRPULW is any even value between 0 and 1022.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_IO_DATA</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>MCU IO mode config</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_rw_data</name>
              <description>When reading this register, this lower 24 bits represent the data read from LCM through MCU I/O mode I/F.
Note: When TX FIFO not full and I/O timeout interrupt not happen ,this data can be read.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_IO_TO_CFG</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>MCU IO timeout config</description>
          <resetValue>0x00000042</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>io_timeout_num</name>
              <description>The I/O write/read timeout interrupthappens, When writing or reading is timeout for IO_RDY_TO_DOTCLK_NUM system clocks in MCU I/F I/O mode, t. When MCU I/F I/O mode is used, the recommand value is: 
16 * WRPULW + RDACTW + RDINACTW</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_IMG_CFG</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>source image config</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>img_format_yuv</name>
              <description>enable yuv422torgb888</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>img_format</name>
              <description>Image layer data format, it supports the following values:
*0000: ARGB8888
*0001: RGB888
*0010: RGB565
*0011: ARGB1555
*0100: ARGB4444
*0101: RGB666
*0110: ARGB8666
*1000: ABGR8888
*1001: BGR888
*1010: BGR565
*Others: Reserved</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_IMG_A_BASE_ADDR</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>LCDC image A base address</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>img_a_base_addr</name>
              <description>Image layer DMA source address.
After a frame refresh done, hardware loads the newer base address from this register automatically.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_IMG_B_BASE_ADDR</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>LCDC image B base address</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>img_b_base_addr</name>
              <description>Image layer DMA source address.
After a frame refresh done, hardware loads the newer base address from this register automatically.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_IMG_SLIDE</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>LCDC image slide</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>img_vs_ofst</name>
              <description>pixel offset for image vertical slide</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>img_hs_ofst</name>
              <description>pixel offset for image horizontal slide</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD0_0</name>
          <addressOffset>0x000000E0</addressOffset>
          <size>8</size>
          <description>mcu predefined cmd</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword0_0</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD0_1</name>
          <addressOffset>0x000000E1</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword0_1</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD0_2</name>
          <addressOffset>0x000000E2</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword0_2</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD0_3</name>
          <addressOffset>0x000000E3</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword0_3</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD1_0</name>
          <addressOffset>0x000000E4</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword1_0</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD1_1</name>
          <addressOffset>0x000000E5</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword1_1</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD1_2</name>
          <addressOffset>0x000000E6</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword1_2</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD1_3</name>
          <addressOffset>0x000000E7</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword1_3</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD2_0</name>
          <addressOffset>0x000000E8</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword2_0</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD2_1</name>
          <addressOffset>0x000000E9</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword2_1</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD2_2</name>
          <addressOffset>0x000000EA</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword2_2</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD2_3</name>
          <addressOffset>0x000000EB</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword2_3</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD3_0</name>
          <addressOffset>0x000000EC</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword3_0</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
