Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>LCDC_MCU_CMD_DWORD3_1</name>
          <addressOffset>0x000000ED</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword3_1</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD3_2</name>
          <addressOffset>0x000000EE</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword3_2</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_DWORD3_3</name>
          <addressOffset>0x000000EF</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_dword3_3</name>
              <description>mcu predefined cmd before data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_MCU_CMD_WRNUM</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description>number of mcu predefined cmd</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_cmd_wrnum</name>
              <description>number of mcu predefined cmd, unit: byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDC_DUMMY</name>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>UARTLOG_REG</name>
      <baseAddress>0x41005000</baseAddress>
      <size>0x000000F4</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000000F4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UART_DLL</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>UART divisor length register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>baud</name>
              <description>The low 8 bits of divisor coefficient (not used)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_IER</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>UART interrupt enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>etpfei</name>
              <description>Tx Path FIFO Empty interrupt (ETPFEI) (Tx Path FIFO empty) enable control
*000: All Tx Path FIFO empty interrupt disabled
*001: Tx Path1 FIFO Empty interrupt enabled
*010: Tx Path2 FIFO Empty interrupt enabled
*011: Tx Path3 FIFO Empty interrupt enabled
*100: Tx Path4 FIFO Empty interrupt enabled
*Others: Reserved</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>etoi</name>
              <description>Rx timeout interrupt (ETOI) enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>emdi</name>
              <description>Rx path monitor done interrupt (EMDI) enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>edssi</name>
              <description>Modem Status Interrupt (EDSSI) (modem status transition) enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>elsi</name>
              <description>Receiver Line Status Interrupt (ELSI) (receiver line status) enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>erbi</name>
              <description>Received Data Available Interrupt (ERBFI) (Rx trigger) enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_IIR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>UART interrupt identification register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>int_pend</name>
              <description>Indicate if the interrupt is pending.
*0: Pending, and the IIR contents may be used as a pointer to the appropriate interrupt service routine.
*1: No interrupt is pending.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_LCR</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>UART line control register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dlab</name>
              <description>Divisor Latch Access bit, and control the accessibility of the DLL, DLM and IER registers
* 0: The divisor latches not accessible; IER accessible
* 1: The divisor latches accessible; DLL and DLM accessible
Note: THR/RBR don't care the value of dlab bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>brctl</name>
              <description>Break Control bit
* 0: break signal disable
* 1: break signal enable (logic '0')</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>stkp</name>
              <description>Stick Parity bit
* 0: Not stick parity, the parity type is ODD or EVEN (depending on eps)
* 1: Stick parity, eps=1: low parity (1'b0); eps=0: high parity (1'b1)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>eps</name>
              <description>Even Parity select
* 0: Odd parity, the number of Logic "1" is odd.
* 1: Even parity, the number of Logic "1" is even.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pen</name>
              <description>Parity Enable
* 0: No parity bit
* 1: Parity bit is generated on each outgoing character and is checked on each incoming one</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>stb</name>
              <description>Stop bits length selection
* 0: 1 stop bit
* 1: 2 stop bits
Note: The receiver always checks the first stop bit only.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wls0</name>
              <description>Word length selection
* 0: 7 bits data
* 1: 8 bits data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MCR</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>UART modem control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>afe</name>
              <description>Auto flow control enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>loop_en</name>
              <description>LoopBack mode
* 0: Normal operation mode
* 1: Loopback mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>out2</name>
              <description>Auxiliary output 2
Bit[3] affects the OUT2_ output in a manner identical to that described above set to 0
In loopback mode, connected to Data Carrier Detect (DCD)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>out1</name>
              <description>Auxiliary output 1
Bit3 affects the OUT1_ output in a manner identical to that described above set to 0
In loopback mode, connected to Ring Indicator (RI)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts</name>
              <description>Request to Send (RTS) signal control
* 0: RTS is logic 1.
* 1: RTS is logic 0.
This bit controls the RTS_ output, Bit 1 affects the RTS_ output in a manner identical to that described above set to 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dtr</name>
              <description>Data Terminal Ready (DTR) signal control
* 0: DTR is logic 1.
* 1: DTR is logic 0.
This bit controls the DTR output.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_LSR</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>UART line status register</description>
          <resetValue>0x00000200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_fifo_ptr</name>
              <description>Data bytes count in the receive FIFO: the value of rx_fifo_ptr[7:0] indicates the data bytes number received in the FIFO.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tp4f_not_full</name>
              <description>Tx Path4 FIFO not full indicator</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tp3f_not_full</name>
              <description>Tx Path3 FIFO not full indicator</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tp2f_not_full</name>
              <description>Tx Path2 FIFO not full indicator</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tp1f_not_full</name>
              <description>Tx Path1 FIFO not full indicator</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tp4f_empty</name>
              <description>Tx Path4 FIFO empty indicator</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tp3f_empty</name>
              <description>Tx Path3 FIFO empty indicator</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tp2f_empty</name>
              <description>Tx Path2 FIFO empty indicator</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tp1f_empty</name>
              <description>Tx Path1 FIFO empty indicator</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rp_rxfifo_err</name>
              <description>Relay Path rx_error,only valid when the FCR[12] set to 1
* 0: Clear when the CPU reads the LSR, if there are no subsequent errors in the relay path FIFO
* 1: Parity error, framing error or break indication in the relay path FIFO</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMEOUT_INT</name>
              <description>This bit is only set when Rx Timeout interrupt is enabled(ETOI is set)
1: at least one character in the FIFO but no character has been input to the FIFO or reading from it for the time duration, which depends on the value in register REG_RX_PATH_CTRL[31:16]</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIFO_INT</name>
              <description>This bit is only set when Received Data Available Interrupt interrupt is enabled(ERBI is set)
1: FIFO Trigger level reached or Rx FIFO full</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rp_frm_err</name>
              <description>Relay Path Framing Error (FE) indicator
* 0: No framing error in the current character
* 1: The received character does not have a valid stop bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rp_par_err</name>
              <description>Relay Path Parity Error (PE) indicator
* 0: No parity error in current character
* 1: The received character does not have the correct parity bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rpf_ovr_err</name>
              <description>Relay Path FIFO Overrun Error (OE) indicator
* 0: No Overrun state
* 1: The transmission is continue although the Relay FIFO is full</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rpf_not_full</name>
              <description>Relay Path FIFO Not FULL (NF) indicator
* 0: Relay path FIFO is full
* 1: Relay path FIFO is not full</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rpf_drdy</name>
              <description>Relay Path FIFO Data Ready (DR) indicator
* 0: No characters in the Relay Receiver FIFO
* 1: At least one character has been received and transferred into the Relay path FIFO</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rxfifo_err</name>
              <description>Uart_rx_error, only valid when the FCR bit [0] set to 1
* 0: Clear when the CPU reads the LSR, if there are no subsequent errors in the FIFO
* 1: Parity error, overrun error,framing error or break indication in the FIFO</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_empty</name>
              <description>TX fifo empty indicator</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>monitor_done_int</name>
              <description>This bit is only set when Rx Path Monitor Done interrupt is enabled(EMDI is set)
1: Rx path monitor done</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>break_int</name>
              <description>Break Interrupt (BI) indicator
* 0: No break condition in the current character
* 1: The received data input held in the Spacing ( logic 0) state is longer than a full word transmission time</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>frm_err</name>
              <description>Framing Error (FE) indicator
* 0: No framing error in the current character
* 1: The received character does not have a valid stop bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>par_err</name>
              <description>Parity Error (PE) indicator
* 0: No parity error in current character
* 1: The received character does not have the correct parity bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ovr_err</name>
              <description>Overrun Error (OE) indicator
* 0: No Overrun state
* 1: The transmission is continue although the Rx FIFO is full</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>drdy</name>
              <description>Data Ready (DR) indicator
* 0: No characters in the Receiver FIFO
* 1: At least one character has been received and transferred into the FIFO</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MSR</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>UART modem status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>r_dcd</name>
              <description>Complement of the DCD input or equals to Out2 in loopback mode.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>r_ri</name>
              <description>Complement of the RI input or equals to Out1 in loopback mode.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>r_dsr</name>
              <description>Complement of the DSR input or equals to DTR in loopback mode.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>r_cts</name>
              <description>Complement of the CTS input or equals to RTS in loopback mode.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>d_dcd</name>
              <description>Delta Data Carrier Detect (DDCD) indicator
* 0: Otherwise
* 1: The DCD line has changed its state</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>teri</name>
              <description>Trailing Edge of Ring Indicator (TERI) detector
* 0: Otherwise
* 1: The RI line has changed its state from low to high state</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>d_dsr</name>
              <description>Delta Data Set Ready (DDSR) indicator
* 0: Otherwise
* 1: The DSR line has changed its state</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>d_cts</name>
              <description>Delta Clear to Send (DCTS) indicator
* 0: Otherwise
* 1: The CTS line has changed its state</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_SCR</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>UART scratch pad register</description>
          <resetValue>0x00000030</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xfactor_adj</name>
              <description>One factor of Baud rate calculation for Tx path</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dbg_sel</name>
              <description>Debug port selection</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>scratch_7</name>
              <description>clear Rx break signal interrupt status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>scratch_6_0</name>
              <description>*Bit[6]: Rx break signal interrupt enable
*Bit[5]: fl_set_bi_err
*Bit[4]: fl_frame_err
*Bit[3]: pin_lb_test
*Bit[2:0]: reserved</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
