Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>UART_STSR</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>UART STS register</description>
          <resetValue>0x00010470</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xfactor</name>
              <description>Factor of Baud rate calculation for Tx path</description>
              <bitRange>[23:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RBR</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>UART receiver buffer register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rxdatabit</name>
              <description>Tx data bit 0~7
Note: Bit[0] is the least significant bit. It is the first bit serially received/transmitted.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MISCR</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>UART MISC control register</description>
          <resetValue>0x00000420</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>clr_dummy_flag</name>
              <description>Indicate the clearing of dummy data</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>dummy_data</name>
              <description>Store dummy data, when UART is DMA flow controller, dummy data is padded for last RXDMA burst request</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rxdma_owner</name>
              <description>Indicate the DMA flow controller for UART Rx DMA1
* 0: GDMA
* 1: UART, interrupt enable signal other than erpd should be masked</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>irda_rx_inv</name>
              <description>irda_rx_i reverse input enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>irda_tx_inv</name>
              <description>irda_tx_o reverse output enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rxdma_burstsize</name>
              <description>RXDMA burstsize, maximum value is 16</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>txdma_burstsize</name>
              <description>TXDMA burstsize, maximum value is 16</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rxdma_en</name>
              <description>RXDMA enable, valid when dma_mode in FCR is 1'b1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>txdma_en</name>
              <description>TXDMA enable, valid when dma_mode in FCR is 1'b1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>irda_enable</name>
              <description>IrDA SIR mode enable
* 0: UART mode only
* 1: UART is co-work with IRDA SIR mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_REG_SIR_TX_PWC0</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>UART IRDA SIR Tx pulse width control 0 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>upperbound_shiftright</name>
              <description>Indicate the shift type of SIR Tx pulse's right edge
* 0: Shift left, minus offset value of upperbound_shiftval
* 1: Shift right, plus offset value of upperbound_shiftval</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>upperbound_shiftval</name>
              <description>The shift value of SIR Tx pulse's right edge</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lowbound_shiftright</name>
              <description>Indicate the shift type of SIR Tx pulse's left edge
* 0: Shift left, minus offset value of lowbound_shiftval
* 1: Shift right, plus offset value of lowbound_shiftval</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lowbound_shiftval</name>
              <description>The shift value of SIR Tx pulse's left edge</description>
              <bitRange>[14:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_REG_SIR_RX_PFC</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>UART IRDA SIR Rx pulse filter control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>r_sir_rx_filter_thrs</name>
              <description>The threshold of SIR Rx filter. Rx pulse is valid only when Rx pulse width is larger than the threshold.</description>
              <bitRange>[15:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>r_sir_rx_filter_en</name>
              <description>IrDA SIR Rx filter enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_REG_BAUD_MON</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>UART baud monitor register</description>
          <resetValue>0x07000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>toggle_mon_en</name>
              <description>Toggle monitor enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mon_data_vld</name>
              <description>Indicate valid monitoring data</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>falling_thresh</name>
              <description>Indicate the threshold of Rx data rising edge</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>min_low_period</name>
              <description>Minimum space of consecutive logic "0" of Rx data</description>
              <bitRange>[23:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>min_fall_space</name>
              <description>Minimum space of adjacent falling edge of Rx data</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_REG_DBG</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>UART debug register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dbg_uart</name>
              <description>The output value of debug port, depend on dbg_sel value in SCR[2:0]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_REG_RX_PATH_CTRL</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>UART Rx path control register</description>
          <resetValue>0x00400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>r_rxto_thrs</name>
              <description>Indicate the timeout threshold of Rx path, unit in one-bit time</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rxbaud_adj_10_0</name>
              <description>One factor of Baud rate calculation for Rx path, similar with xfactor_adj</description>
              <bitRange>[13:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>r_rst_newrx_n</name>
              <description>Reset new Rx path, low active</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_REG_MON_BAUD_CTRL</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>UART monitor baud rate control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>r_upd_osc_in_xtal</name>
              <description>Update parameter r_cycnum_perbit_osc(during the update of parameter r_cycnum_perbit_xtal) enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>r_cycnum_perbit_osc</name>
              <description>Indicate the average OSC clock cycle number of one bit, for Rx path OSC clock
Note: Sortware sets the initial value; hardware updates it depending on the monitor result.</description>
              <bitRange>[28:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>r_bit_num_thres</name>
              <description>Indicate the bit number threshold of one monitor period, max value is 127.</description>
              <bitRange>[8:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>r_mon_baud_en</name>
              <description>Monitor Rx baud enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_REG_MON_BAUD_STS</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>UART monitor baud rate status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ro_mon_total_bit</name>
              <description>Indicate the number of bits actually monitored</description>
              <bitRange>[28:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ro_mon_rdy</name>
              <description>Indicate the finish of calculation of actual cycle number per bit. It's cleared when r_mon_baud_en is 0.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>r_cycnum_perbit_xtal</name>
              <description>Indicate the fractional xtal clock cycle number of one bit, for Rx path xtal clk
Note: Sortware sets the initial value; hardware updates it depending on the monitor result.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_REG_MON_CYC_NUM</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>UART monitored cycle number register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ro_mon_total_cycle</name>
              <description>Indicate the number of clock cycle actually monitored</description>
              <bitRange>[27:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_REG_Rx_BYTE_CNT</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>UART Rx data byte count register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>clr_rx_byte_cnt</name>
              <description>Write 1 to clear ro_rx_byte_cnt</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ro_rx_byte_cnt</name>
              <description>Count the byte number of data read from rxfifo</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_FCR</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>UART FIFO control register</description>
          <resetValue>0x000050C1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>log_full_en</name>
              <description>Function enable: when disable agg, and log byte is 0x0a or this fifo is empty timeout, switch tx fifo</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rp_recv_clr</name>
              <description>Clear Relay Path receiving</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>rp_fifo_en</name>
              <description>Error report of Relay Path RCVR FIFO field enable,</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>recvtrg</name>
              <description>Define the 32-entry Receiver FIFO Interrupt trigger level (0~31 bytes)
* 00: 1 byte
* 01: FIFO_DEPTH/4
* 10: FIFO_DEPTH/2
* 11: FIFO_DEPTH-2</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_mode</name>
              <description>Support DMA mode (cooperating with DW DDMA in the data path)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>recv_clr</name>
              <description>Clear receiving</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>fifo_en</name>
              <description>Error report of RCVR FIFO field enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_AGGC</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>UART AGG control register</description>
          <resetValue>0x00BB87FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rp_en</name>
              <description>Relay Rx Path enable
*0: Disable
*1: Enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tp4_en</name>
              <description>Tx Path4 enable
*0: Disable
*1: Enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tp3_en</name>
              <description>Tx Path3 enable
*0: Disable
*1: Enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tp2_en</name>
              <description>Tx Path2 enable
*0: Disable
*1: Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tp1_en</name>
              <description>Tx Path1 enable
*0: Disable
*1: Enable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>agg_en</name>
              <description>Tx AGG function enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>agg_to</name>
              <description>AGG timeout
Data should be sent from log FIFO to tx_fifo if idle time &gt; AGG timeout, even if there is just only one byte in log FIFO of the path.
when agg_en=0: Unit is 25ns.
when agg_en=1: Unit is one baudrate period of loguart Tx, default is 1ms if Tx baudrate is 3Mbps.</description>
              <bitRange>[25:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>agg_th</name>
              <description>AGG threshold 
4'0000: 1
4'0111: 8
Numbers above 4'0111 are reserved.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>agg_sync_pat</name>
              <description>AGG packet Start</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_THR0</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>UART transmitter holding register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx0databit</name>
              <description>Tx data bit 0~7
Note: Bit 0 is the least significant bit. It is the first bit serially received/transmitted</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_THR1</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>UART transmitter holding register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx1databit</name>
              <description>Tx data bit 0~7
Note: Bit 0 is the least significant bit. It is the first bit serially received/transmitted</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_THR2</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>UART transmitter holding register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx2databit</name>
              <description>Tx data bit 0~7
Note: Bit 0 is the least significant bit. It is the first bit serially received/transmitted</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_THR3</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>UART transmitter holding register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx3databit</name>
              <description>Tx data bit 0~7
Note: Bit 0 is the least significant bit. It is the first bit serially received/transmitted</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
