Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>UART_RP_LCR</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>UART Relay Rx Path line control register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rp_rxbaud_19_0</name>
              <description>Factor of Baud rate calculation for Relay path</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rp_dlab</name>
              <description>Divisor Latch Access bit, and control the accessibility of the DLL, DLM and IER registers
* 0: The divisor latches not accessible; IER accessible
* 1: The divisor latches accessible; DLL and DLM accessible
Note: THR/RBR don not care the value of dlab bit.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rp_stkp</name>
              <description>Stick Parity bit
* 0: Not stick parity, the parity type is ODD or EVEN (depend on eps)
* 1: Stick parity, eps=1: low parity (1'b0); eps=0: high parity (1'b1)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rp_eps</name>
              <description>Even Parity select
* 0: Odd parity, the number of Logic "1" is odd.
* 1: Even parity, the number of Logic "1" is even.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rp_pen</name>
              <description>Parity Enable
* 0: No parity bit
* 1: Parity bit is generated on each outgoing character and is checked on each incoming one.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rp_stb</name>
              <description>Stop bits length selection
* 0: 1 stop bit
* 1: 2 stop bits
Note: the receiver always checks the first stop bit only.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rp_wls0</name>
              <description>Word length selection
* 0: 7 bits data
* 1: 8 bits data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RP_RX_PATH_CTRL</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>UART Relay Rx path control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rp_rxbaud_adj_10_0</name>
              <description>One factor of Baud rate calculation for Relay path, similar with xfactor_adj</description>
              <bitRange>[13:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>r_rst_rp_rx_n</name>
              <description>Reset Relay Rx path, low active</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_ICR</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>UART interrupt clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RPRLSICF</name>
              <description>Relay Path Receiver Line Statue Interrupt Clear Flag
Writing 1 to this bit clears relay path's PARITY_ERR, OVERRUN_ERR, FRAMING_ERR and RXFIFO_ERR  in the USART_LSR register.</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MDICF</name>
              <description>Monitor done clear flag</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TOICF</name>
              <description>Timeout Interrupt Clear Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RLSICF</name>
              <description>Receiver Line Statue Interrupt Clear Flag
Writing 1 to this bit clears PARITY_ERR, OVERRUN_ERR, FRAMING_ERR, BREAK_ERR_INT and RXFIFO_ERR  in the USART_LSR register.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOGUART_INTERRUPT_MASK</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description>loguart interrupt mask Register</description>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>loguart_intr_mask_ap</name>
              <description>Mask loguart interrupt to AP
1:unmask
 0:mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>loguart_intr_mask_np</name>
              <description>Mask loguart interrupt to NP
1:unmask
 0:mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOGUART_DUMMY</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description>Loguart Dummy Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>rsvd for hw</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
