Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SDM_REG</name>
      <baseAddress>0x41001000</baseAddress>
      <size>0x00000024</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000024</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SDM_CTRL0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>SDM Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDM_EN</name>
              <description>Enable SDM</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDM_RST</name>
              <description>0: Reset SDM</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDM_BYPASSS_MOD_EN</name>
              <description>Bypass mode enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDM_MOD_SEL</name>
              <description>0: Default mode
1: User-defined parameter mode</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CAL_DONE</name>
              <description></description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIME_LOSS_SET</name>
              <description>Time loss set
1: User-defined</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIME_LOSS_HIGH</name>
              <description>Decide 32k output compensation direction
1: Mask
0: Add</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALWAYS_CAL_EN</name>
              <description>1: Enable always_cal</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CAL_EN</name>
              <description>1: Enable timer_cal</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_SEL</name>
              <description>XTAL frequency select, default 40M
* 4'h0: XTAL40M
* 4'h1: XTAL25M
* 4'h4: XTAL20M
* 4'h5: XTAL26M
* 4'hD: XTAL27M
* 4'hE: XTAL24M</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDM_CTRL1</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Config observed 128K cycle</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDM_OBS_CYC</name>
              <description>Set observed 128k cycle, default 1024 128k cycles</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDM_CTRL2</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>Set ref counter value</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDM_OBS_REF_CYC</name>
              <description>Set in observed cycles, refer to counters value, default 312500 XTAL cycles</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDM_CTRL3</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>Set XTAL period</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_PERIOD</name>
              <description>Set reference xtal period (ns)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDM_CTRL4</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>SDM Debug Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDM_DBG_EN</name>
              <description>1: Enable SDM debug</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDM_DBG_SEL</name>
              <description>Set in observed cycles, refer to counters value</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDM_CTRL5</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>Time loss Set</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME_LOSS_REG</name>
              <description>Source clock time loss every cycle</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDM_TIMEOUT</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>Set Timer Trigger Counter Value</description>
          <resetValue>0x02000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMEOUT_CNT</name>
              <description>Set SDM timer trigger calibration timeout value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SDM_DUMMY</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>SDM Dummy Register</description>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
