Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_KEY_NS_IPSEC2_3</name>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_NS_IPSEC2_3</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_NS_IPSEC2_4</name>
          <addressOffset>0x00000270</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_NS_IPSEC2_4</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_NS_IPSEC2_5</name>
          <addressOffset>0x00000274</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_NS_IPSEC2_5</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_NS_IPSEC2_6</name>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_NS_IPSEC2_6</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_NS_IPSEC2_7</name>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_NS_IPSEC2_7</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY1_0</name>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY1_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY1_1</name>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY1_1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY1_2</name>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY1_2</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY1_3</name>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY1_3</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY1_4</name>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY1_4</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY1_5</name>
          <addressOffset>0x00000294</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY1_5</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY1_6</name>
          <addressOffset>0x00000298</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY1_6</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY1_7</name>
          <addressOffset>0x0000029C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY1_7</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY2_0</name>
          <addressOffset>0x000002A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY2_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY2_1</name>
          <addressOffset>0x000002A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY2_1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY2_2</name>
          <addressOffset>0x000002A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY2_2</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY2_3</name>
          <addressOffset>0x000002AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY2_3</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY2_4</name>
          <addressOffset>0x000002B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY2_4</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY2_5</name>
          <addressOffset>0x000002B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY2_5</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY2_6</name>
          <addressOffset>0x000002B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY2_6</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_PKE_PRI_KEY2_7</name>
          <addressOffset>0x000002BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_PKE_PRI_KEY2_7</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_ECB_0</name>
          <addressOffset>0x000002C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_ECB_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_ECB_1</name>
          <addressOffset>0x000002C4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_ECB_1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_ECB_2</name>
          <addressOffset>0x000002C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_ECB_2</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_ECB_3</name>
          <addressOffset>0x000002CC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_ECB_3</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_ECB_4</name>
          <addressOffset>0x000002D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_ECB_4</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_ECB_5</name>
          <addressOffset>0x000002D4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_ECB_5</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_ECB_6</name>
          <addressOffset>0x000002D8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_ECB_6</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_ECB_7</name>
          <addressOffset>0x000002DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_ECB_7</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_CTR_0</name>
          <addressOffset>0x000002E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_CTR_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_CTR_1</name>
          <addressOffset>0x000002E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_CTR_1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_CTR_2</name>
          <addressOffset>0x000002E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_CTR_2</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_CTR_3</name>
          <addressOffset>0x000002EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_CTR_3</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_CTR_4</name>
          <addressOffset>0x000002F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_CTR_4</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_CTR_5</name>
          <addressOffset>0x000002F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_CTR_5</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_CTR_6</name>
          <addressOffset>0x000002F8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_CTR_6</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_RSIP_CTR_7</name>
          <addressOffset>0x000002FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RSIP_CTR_7</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_SWD_PWD_0</name>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_SWD_PWD_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_SWD_PWD_1</name>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_SWD_PWD_1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_SWD_PWD_2</name>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_SWD_PWD_2</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_KEY_SWD_PWD_3</name>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_SWD_PWD_3</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NEWKEY_HUK_0</name>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HUK_0_3</name>
              <description></description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HUK_0_2</name>
              <description></description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HUK_0_1</name>
              <description></description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HUK_0_0</name>
              <description></description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
