Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_OTA_ADDR</name>
          <addressOffset>0x0000036C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTLOADER_addr</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rsvd2_sw</name>
              <description></description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CRC0</name>
          <addressOffset>0x00000370</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>crc_entry0</name>
              <description>valid crc
Note : this field will be autoloaded twice time, and sticked to L.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>crc_entry1</name>
              <description>valid crc
Note : this field will be autoloaded twice time, and sticked to L.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CRC1</name>
          <addressOffset>0x00000374</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>crc_entry2</name>
              <description>valid crc
Note : this field will be autoloaded twice time, and sticked to L.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>crc_entry3</name>
              <description>valid crc
Note : this field will be autoloaded twice time, and sticked to L.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOOT_VER0</name>
          <addressOffset>0x00000378</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTLOADER_VERSION0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BOOT_VER1</name>
          <addressOffset>0x0000037C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTLOADER_VERSION1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RMA</name>
          <addressOffset>0x00000700</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RMA_DATA</name>
              <description>If the number of 1 is odd, it will goto RMA state.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ROM_PATCH</name>
          <addressOffset>0x00000701</addressOffset>
          <size>8</size>
          <description></description>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ROM_PATCH_PG</name>
              <description>ROM patch enable.This Bit will programed by FT if ROM patch do not needed</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM_PATCH_LWE1</name>
              <description>ROM patch write protection(protect Low 256bits) : 500-51f</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM_PATCH_LWE2</name>
              <description>ROM patch write protection(protect Low 256bits) : 520-53f</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM_PATCH_LWE3</name>
              <description>ROM patch write protection(protect Low 256bits) : 540-55f</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM_PATCH_LWE4</name>
              <description>ROM patch write protection(protect Low 256bits): 560-57f</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM_PATCH_LWE5</name>
              <description>ROM patch write protection(protect low 1Kbits)    :580-5ff</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM_PATCH_HWE</name>
              <description>ROM patch write protection (protect High 2Kbits)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SEC_CFG3</name>
          <addressOffset>0x00000702</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RMA_SWD_PWD_R_Protection_EN</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RMA_SWD_PWD_W_Forbidden_EN</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RMA_PK_W_Forbidden_EN</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>otp_rsvd0</name>
              <description></description>
              <bitRange>[7:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SWD_RMA_PWD_0</name>
          <addressOffset>0x00000710</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PWD_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SWD_RMA_PWD_1</name>
          <addressOffset>0x00000714</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PWD_1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SWD_RMA_PWD_2</name>
          <addressOffset>0x00000718</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PWD_2</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SWD_RMA_PWD_3</name>
          <addressOffset>0x0000071C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PWD_3</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PKKEY1_RMA_PK_0</name>
          <addressOffset>0x00000720</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PK_0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PKKEY1_RMA_PK_1</name>
          <addressOffset>0x00000724</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PK_1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PKKEY1_RMA_PK_2</name>
          <addressOffset>0x00000728</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PK_2</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PKKEY1_RMA_PK_3</name>
          <addressOffset>0x0000072C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PK_3</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PKKEY1_RMA_PK_4</name>
          <addressOffset>0x00000730</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PK_4</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PKKEY1_RMA_PK_5</name>
          <addressOffset>0x00000734</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PK_5</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PKKEY1_RMA_PK_6</name>
          <addressOffset>0x00000738</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PK_6</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PKKEY1_RMA_PK_7</name>
          <addressOffset>0x0000073C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key_RMA_PK_7</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_DUMMY</name>
          <addressOffset>0x00000740</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy reg  for hw</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
