Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PSRAM_PHY_REG</name>
      <baseAddress>0x41908000</baseAddress>
      <size>0x000000FC</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000000FC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_CAL_CTRL</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000031</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_CAL_NBDR_OVF</name>
              <description>The N reachs the boundary , which is 0 or Nmax .
Cleared by write 1 .</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CAL_NBDR_ALMOST</name>
              <description>The N-J or N+J reachs the boundary , which is 0 or Nmax .
Cleared by write 1 .</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CAL_ERR_UNSURE</name>
              <description>The Pre N/J may cause current burst receive error  , but it is not sure because the burst len is too small.
Cleared by write 1 .</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CAL_ERR_ALREADY</name>
              <description>The Pre N/J may cause current burst receive error  , even change J to Jmin , the error still remain .
Cleared by write 1 .</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CAL_ERR_ALMOST</name>
              <description>The current burst receive correct , but next burst will set J = Jmin .
Cleared by write 1 .</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CAL_INTR_MASK</name>
              <description>Calibration fail interrupt mask , every bit control one event above (1: enable , 0: disable)
[0] : err almost
[1] : err already
[2] : err unsure
[3] : nbdr almost
[4] : nbdr ovf</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_CAL_EN</name>
              <description>Hardware auto calibration enable ,  if disable , N,J will be fixed .</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CAL_PAR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x020E0A0F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_CAL_JMIN</name>
              <description>Minimum J . Hardware may adjust J , if J reach this value , an interrup will be raised to alerm software.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_CAL_JMAX</name>
              <description>Maximum J . Hardware may adjust J , but will not exceed this value.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_CAL_J</name>
              <description>Initial value J calibrated by software .</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_CAL_N</name>
              <description>Initial value N calibrated by software .</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CAL_STATUS</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_CAL_CUR_ST</name>
              <description>Calibration current state .
Cleared by write all 1 .</description>
              <bitRange>[28:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CAL_PDST</name>
              <description>Calibration check result for last read burst .
[0] : indicate phase n+j , if 1 , means dn == dn+j
[1] : indicate phase n-j , if 1 , means dn == dn-j
[2] : if 1 , means the state is under j = jmin condition</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CAL_CUR_J</name>
              <description>Current value J read from hardware.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CAL_CUR_N</name>
              <description>Current value N read from hardware.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PRE_CAL_PAR</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DQ_DLY_PHASE</name>
              <description>8-tap delay line to adjust dq[7:0] phase, delay dq[7:0], rwds no change
min: 0, max: 8
pad_rwds -------------------------&gt; calibration
pad_dq[7:0] -&gt; delay x-tap -&gt; calibration</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_CAL_PHASE</name>
              <description>8-tap delay line to adjust rwds phase, delay rwds, dq[7:0] no change
min: 0, max: 8
pad_rwds -&gt; delay x-tap -&gt; calibration
pad_dq[7:0] -------------------&gt; calibration</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PHY_INFO</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00100000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_TIME_OUT_MASK</name>
              <description>read time out interrupt mask</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TIME_OUT</name>
              <description>read time out interrupt if there's no DQS/DQ from psram, write 1 to clear</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_INFO</name>
              <description>Command information, 1st Byte of Command/Address transaction</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PHY_CTRL</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x80000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSRAM_SW_RST_N</name>
              <description>low active, except for phy register(using system reset), psram software reset: psram, phy_ctrl, calibration</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_DQ16_EN</name>
              <description>1: enable to support DQ16 psram</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWDS_CHK_OPT</name>
              <description>0: synced psram_rwds_i direct to controller
1: only check psram_rwds_i at last valid cycle of CA stage, sync this pulse to controller</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWDS_PD_EN</name>
              <description>psram_phy can control PD pin of rwds iopad, bypass high-Z state at CMD/ADDR stage</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LATENCY_TYPE</name>
              <description>set this bit according to spic &amp; psram latency settings
0: variable latency
1: fixed latency</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CAL_RWDS_PHASE</name>
              <description>one-hot phase select, delay cal_rwds to push sampling data into rfifo</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFIFO_RDY_DLY</name>
              <description>variable latency: delay read data cycles(phy clk) after detecting first DQS rising edge, must &lt; 4
fixed latency: delay read data cycles(phy clk) after asserting spi_rx_data_en, must &gt; 5
                    4*read_latency - rd_dummy_length + rfifo_rdy_dly = in_physical_cyc</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DBG_SEL</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_PHY_DBG_SEL</name>
              <description>psram phy debug select signal.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DBG_INFO</name>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSRAM_PHY_DBG</name>
              <description>psram phy debug signals.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
