Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC_REG</name>
      <baseAddress>0x41000a00</baseAddress>
      <size>0x0000002C</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0000002C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RTC_TR</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>RTC Time Reg</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAY</name>
              <description>DAY in binary format</description>
              <bitRange>[31:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PM</name>
              <description>PM:AM/PM notation
*0: AM or 24-hour foramt
*1: PM</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HT</name>
              <description>Hour tens in BCD format</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HU</name>
              <description>Hour units in BCD format</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MNT</name>
              <description>Minute tens in BCD format</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MNU</name>
              <description>Minute units in BCD format</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST</name>
              <description>Second tens in BCD format</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SU</name>
              <description>Second units in BCD format</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_CR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>RTC Ctrl Reg</description>
          <resetValue>0xFF800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAY_THRES</name>
              <description>Day threshold in binary format</description>
              <bitRange>[31:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVTHIE</name>
              <description>Day over threshold interrupt enable
*0: Day over threshold interrupt disabled
*1: Day over threshold interrupt enabled</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUTIE</name>
              <description>Wakeup timer interrupt enable
*0: Wakeup timer interrupt disabled
*1: Wakeup timer interrupt enabled</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALMIE</name>
              <description>Alarm interrupt enable
*0: Alarm interrupt disabled
*1: Alarm interrupt enabled</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUTE</name>
              <description>Wakeup timer enable
*0: Wakeup timer disabled
*1: Wakeup timer enabled</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALME</name>
              <description>Alarm enable
*0: Alarm disabled
*1: Alarm enabled</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FMT</name>
              <description>Hour format
*0: 24 hour/day format
*1: AM/PM hour format</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSEL</name>
              <description>Output selection.There bits are used to select the flag to be routed to RTC_OUT output.
*00: Output disabled
*01: Alarm output enabled
*10: Clock output is clk_spre (default:1Hz)
*11: Clock output is clk_apre (default:256Hz)</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPSHAD</name>
              <description>Bypass the shadow registers.
*0: Calendar values (when reading from RTC_TR) are taken from the shadow register, which are updated once every two RTCCLK cycles.
*1: Calendar values (when reading from RTC_TR) are taken directly from the calendar counters.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BKP</name>
              <description>Backup
This bit can be written by the user to memorize whether the daylight saving time change has been performed or not.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUB1H</name>
              <description>Subtract one hour(winter time change),when this bit is set outside initialization mode,1 hour is subtracted to the calendar time if the current hour is not 0,this bit is always read as 0.
*0:No effect
*1:subtract one hour to the current time</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADD1H</name>
              <description>Add one hour(summer time change),when this bit is set outside initialization mode,1 hour is add to the calendar time,this bit is always read as 0.
*0:No effect
*1:add one hour to the current time</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_ISR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>RTC Init And Status Reg</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECALPF</name>
              <description>Recalibration pending flag
The RECALPF status flag is automatically set to '1' when software writes to the RTC_CALIBR register, indicating that the RTCCALIBR register is blocked. When the new calibration settings are taken into account, this bit returns to '0'. Refer to Re-calibration on-the-fly.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVTHF</name>
              <description>Day over threshold flag
This flag is set by hardware when the Day in RTC_TR over the DAY_THRES set in RTC_CR register.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUTF</name>
              <description>Wakeup timer flag
This flag is set by hardware when the wakeup auto-reload counter reaches to.
This flag must be cleared by software at least 2 RTCCLK periods before WUTF is set to '1' again.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ALMF</name>
              <description>Alarm flag
This flag is set by hardware when the time register (RTC_TR) matches the Alarm registers (RTC_ALMR1L and RTC_ALMR1H).</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INIT</name>
              <description>Initialization mode
*0: Free running mode.
*1: Initialization mode used to program time and date register (RTC_TR), and prescaler register (RTC_PRER). Counters are stoped and start counting from the new value when INIT is set.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INITF</name>
              <description>Initialization flag.
When this bit is set to '1', the RTC is in initialization state, and the time, date, and prescaler registers can be updated.
*0: Calendar registers update is not allowed.
*1: Calendar registers update is allowed.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSF</name>
              <description>Registers synchronization flag.
This bit is set by hardware each time the calendar registers are copied into the shadow registers (RTC_TR). This bit is cleared by hardware in initialization mode or when in bypass shadow register mode (BYPSHAD=1). This bit can also be cleared by software.
It is cleared either by software or by hardware in initialization mode.
*0: Calendar shadow registers are not yet synchronized.
*1: Calendar shadow registers are synchronized.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INITS</name>
              <description>This bit is set by hardware when the calendar day field is different from 0 (RTC domain reset state).
*0: Calendar has not been initialized.
*1: Calendar has been initialized.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUTWF</name>
              <description>Wakeup timer write flag
This flag is set by hardware when WUT value can be changed, after the WUTE bit has been set to '0' in RTC_CR.
*0: Wakeup timer configuration update not allowd except in initialization mode
*1: Wakeup timer configuration update allowed</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUTRSF</name>
              <description>This bit is set by hardware each time the WUTE bit is copied into the shadow register. This bit is cleared by hardware in initialization mode. This bit can also be cleared by software.
It is cleared either by software or by hardware in initialization mode.
*0: WUTE is not yet synchronized.
*1: WUTE is synchronized.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ALMWF</name>
              <description>Alarm write flag
This bit is set by hardware when Alarm values can be changed, after the ALME bit has been set to '0' in RTC_CR.
It is cleared by hardware when ALME bit has been set to '1' in RTC_CR.
*0: Alarm update not allowed
*1: Alarm update allowed</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_PRER</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>RTC Prescaler Reg</description>
          <resetValue>0x007F00FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREDIV_A</name>
              <description>Asynchronous prescaler factor
This is the asynchronous division factor: clk_apre freq = RTCCLK freq/(PREDIV_A + 1)</description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PREDIV_S</name>
              <description>Synchronous prescaler factor
This is the synchronous division factor: clk_spre freq = clk_apre freq/(PREDIV_S + 1)</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_CALIBR</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>RTC Calibration Reg</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CALP</name>
              <description>Calibration period</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCE</name>
              <description>Digital calibration enable
*0: Digital calibration disabled
*1: Digital calibration enabled</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCS</name>
              <description>Digital calibration signal
*0: Positive calibration, time update frequency is increased.
*1: Negative calibration, time update frequency is decreased.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC</name>
              <description>Digital calibration</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_ALMR1L</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>RTC Alarm 1 Reg Low</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSK2</name>
              <description>Alarm hour mask
*0: Alarm set if the hours match
*1: Hours don't care in Alarm comparison</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALR_PM</name>
              <description>AM/PM notation.
*0: AM or 24-hour format
*1: PM</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALR_HT</name>
              <description>Hour tens in BCD format</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALR_HU</name>
              <description>Hour units in BCD format</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK1</name>
              <description>Alarm minutes mask.
*0: Alarm set if the minutes match
*1: Minutes don't care in Alarm comprison</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALR_MNT</name>
              <description>Minute tens in BCD format</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALR_MNU</name>
              <description>Minute units in BCD format</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK0</name>
              <description>Alarm seconds mask
*0: Alarm set if the seconds match
*1: Seconds don't care in Alarm comprison</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALR_ST</name>
              <description>Second tens in BCD format</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALR_SU</name>
              <description>Second units in BCD format</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_ALMR1H</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>- RTC Alarm 1 Reg High</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSK3</name>
              <description>Alarm day mask
*0: Alarm set if the days match
*1: Days don't care in Alarm comprison</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALR_DAY</name>
              <description>DAY in binary format</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_WPR</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>RTC Write Protect Reg</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Write protection key
This byte is written by software. Refer to RTC register write protection for a description of how to unlock RTC register write protection.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_YEAR</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>RTC Year Reg</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESTORE</name>
              <description>Reset Flag. Indicates whether any reset conditions have occurred (except POR/PDR/BOD), so that the bit is set to '1' before reset, and then the global variable that determines whether the recovery time information is needed depending on whether the bit is '1'.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>YEAR</name>
              <description>Year in binary format</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_WUTR</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>RTC Wakeup Timer Reg</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUT</name>
              <description>Wakeup auto-reload value bits
When the wakeup timer is enabled (WUTE is set to '1'), the WUTF flag is set every (WUT[16:0]+1) cycles. The first assertion of WUTF occurs between WUT and (WUT+1) cycles after WUTE is set.</description>
              <bitRange>[16:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RTC_DUMMY</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>RTC Dummy Register</description>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
