Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PSRAM_REG</name>
      <groupName>SPIC</groupName>
      <baseAddress>0x41909000</baseAddress>
      <size>0x00000400</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLR0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Control Register 0</description>
          <resetValue>0x01000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USER_MODE</name>
              <description>User mode bit. Enable to enter user mode. Disable to enter auto mode. It can not be changed while SPIC is busy (28 [0] BUSY).
1: User mode. User can push data to FIFO and set SSIENR to 1. SPIC won't accept auto read/write command.
0: Auto mode. User can't push data to FIFO and set SSIENR to 1. SPIC will accept auto read/write command.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UAR</name>
              <description>User mode bit auto reset.
Enable to auto reset USER_MODE to 0 after current user mode transaction is over (SPIC_EN reset to 0).</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_DATA_EN</name>
              <description>Indicate the data path should go through ECC in NAND user mode read write. 
ECC mode. User should program 0x170 and 0x174. The read/write data flow will go through ECC module. 
Normal mode. The read/write data flow will bypass ECC module.
Exists: TAG &gt;= 2.0.11.
Available only if configuration of NAND_EN and ECC_EN are defined.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CK_MTIMES</name>
              <description>Indicates the check times. If Flash is always busy in auto-check times, it causes ACEIR interrupt. The delay time (cycles) is related to bus_clk. 
The cycles of the parameter = (CK_MTIMES &lt;&lt; (11+ATCK_BIT_EXTEND).). User should ensure the timeout &gt; Write time of Flash 
The timeout time(ns) = 2*BAUDR*(1/SPIC_freq)(8/CH) (CK_MTIMES &lt;&lt; (11+ATCK_BIT_EXTEND).) 
Example 1: Flash Program time= 1ms, BAUDR=1, CH=1 (SPI) and (1/SPIC_freq) = 10ns. ATCK_MTIMES should be to set 4. 
Example 2: SPIC_freq = 200MHz, BAUDR = 1, CH =4 (QSPI), and ATCK_BIT_EXTEND = 2, the maximum auto_check time should be 
= 2*1*(1/200MHz)(8/4) (5'b11111&lt;&lt;13) 
= 2*1*(1/200MHz)(8/4) (18'b11_1110_0000_0000_0000) 
= 2*1*(1/200MHz)(8/4) (18'h3_e000) 
= 2*1*(1/200MHz)(8/4) (253952) 
= 5079040 ns 
= 5.07 ms 
Suggestion: If ACEIR interrupt occurs, the user should check the flash status by the software itself. 
Note: Before SVN 8369 Version, CK_MTIMES is fixed to shift 10bit. The formula becomes 2*BAUDR*(1/SPIC_freq)(8/CH) (CK_MTIMES &lt;&lt; (10))</description>
              <bitRange>[27:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_RD</name>
              <description>Indicates to use fast read command in user mode. If setting to 1, SPIC would use FBAUDR to generate spi_sclk.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_CH</name>
              <description>Indicates channel number of command phase in transmitting or receiving data. Command phase is usually used to send SPI command. 
0: single channel
1: dual channels
2: quad channels
3: octal channel</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_CH</name>
              <description>Indicates channel number of data phase in transmitting or receiving data. Data phase is used to send data after address phase. 
0: single channel
1: dual channels
2: quad channels
3: octal channel</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR_CH</name>
              <description>Indicates channel number of address phase after command phase. Addr phase is used to send address or data. Addr phase is between one-byte command and a data phase. The number of bytes is determined by the ADDR_LENGTH.
0: single channel
1: dual channels
2: quad channels
3: octal channel</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDR_EN</name>
              <description>Indicates the DDR mode in CMD_CH/DATA_CH/ADDR_CH. 
CTRLR0[15]: CMD_CH (always 2-Byte CMD type) 
CTRLR0[14]: DATA_CH 
CTRLR0[13]: ADDR_CH 
0: Disable
1: Enable
Available only if configuration of DDR_EN is defined.</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GCLK_DIS</name>
              <description>Set to disable gated clock of icg cell</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TMOD</name>
              <description>Indicates transfer mode. 
2'b00: transmit mode
Others (or 2'b11): receive mode</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCPOL</name>
              <description>Indicates serial clock polarity. It is used to select the polarity of the inactive serial clock. 
0: inactive state of serial clock is low 
1: inactive state of serial clock is high</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCPH</name>
              <description>Indicates serial clock phase. The serial clock phase selects the relationship the serial clock with the slave select signal. 
0: serial clock toggles in middle of first data bit
1: serial clock toggles at start of first data bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIPOL_EN</name>
              <description>Set to enable SIPOL</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIPOL</name>
              <description>While SIPOL_EN = 1 :
SPI_CS is inactive state (SPI_CS ==1): spi_sin[3:0] = SIPOL[3:0]
SPI_CS is active(SPI_CS ==0): spi_sin[3:1] = SIPOL[3:1] (single channel)
                                                     spi_sin[3:2] = SIPOL[3:2] (dual channel)
(SIPOL[4]: reserved for spi_in[7:4])</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_NDF</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Control Register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_NDF</name>
              <description>Indicates a number of data frames (unit: Byte).
When executing receives operation in user mode, SPIC receives data continuously until data frames are equal to RX_NDF.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIENR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>SPIC Enable Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NAND_WR</name>
              <description>Set to enable SPIC when start NAND auto command flow in user mode write transactions.
To start NAND auto command flow user write transaction, please do not set SSIENR.SPIC_EN.
If NAND_WR is activated, SPIC will send WEN command, Page Load program data command and Page execute command to NAND Flash.
Write:
0 - Not to activate NAND auto command flow user write
1 - Activate NAND auto command flow user write
Read:
0 - NAND auto command flow user write is done
1 - NAND auto command flow user write is still in progress</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAND_RD</name>
              <description>Set to enable SPIC when start NAND auto command flow in user read transactions.
To start NAND auto command flow user read transaction, please do not set SSIENR.SPIC_EN.
If NAND_RD is activated, SPIC will send Page read data command and Read data command to NAND Flash.
Write:
0 - Not to activate NAND auto command flow user read
1 - Activate NAND auto command flow user read
Read:
0 - NAND auto command flow user read is done
1 - NAND auto command flow user read is still in progress</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CUR_GP</name>
              <description>Only used in frequency change function.
Used to identify which group register data is internal used. When frqc_req and frqc_ack are both high, CUR_GP will switch to the group which in GP_NUM. 
Exists: TAG &gt;= 1.0.4.</description>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GP_NUM</name>
              <description>Only used in frequency change function.
Set to determine which group register user want to read or write. Base on different operation frequency, some control register setting will change.
Therefore we build second group register on USER_LENGTH.USER_RD_DUMMY_LENGTH, AUTO_LENGTH.RD_DUMMY_LENGTH, AUTO_LENGTH.RDSR_DUMMY_LENGTH, AUTO_LENGTH.IN_PHYSICAL_CYC, TPR0.CS_TCEM, TPR0.CS_ACTIVE_HOLD, TPR0.CS_H_WR_DUM_LEN, TPR0.CS_H_RD_DUM_LEN, AUTO_LENGTH2.WR_DUMMY_LENGTH, TPR1.CR_TPWR, TPR1.CR_IDLE_WINDOW, TPR1.CS_ACTICE_SETUP. 
Exists: TAG &gt;= 1.0.4.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDEX</name>
              <description>Set to trigger device enter sleep mode or deep power down mode. After setting PDEX_CTRL0, PDEX_CTRL1, PDEX_CTRL2 and TPR2, then set this bit to trigger PDEX flow.
Write:
0 - Not to activate PDEX
1 - Activate PDEX
Read:
0 - PDEX is still in progress
1 - PDEX is done
Exists: TAG &gt;= 2.0.5.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRQC</name>
              <description>Set to enable frequency change function. SPIC will chop current transaction and then set frqc_req = 1 after setting this bit. Frquency change is finished when frqc_req and frqc_ack are both high and then the choped transaction will return and continue.
Write:
0: Not to activate FRQC
1: Activate FRQC
Read:
0: FRQC is still in progress
1: FRQC is done
Exists: TAG &gt;= 1.0.4.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATCK_CMD</name>
              <description>Set to enable ATCK_CMD implementation. After setting SPIC would not accept any command until checking Flash is not busy or checking time out. (Use in User Mode, especially for Erase/Program to check status automatically.)
If CTRLR2.SEQ_SET setting, this function needs to disable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIC_EN</name>
              <description>Set to enable SPIC and start user mode transaction.
SPIC will reset SPIC_EN to 0 after user mode transaction is finished.
SPIC_EN can only be set when BOOT_FIN=1 (boot finished) and USER_MODE=1 (user mode).
(User can read SPIC_EN to check whether current user mode transaction is finished.)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SER</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Slave Enable Register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSN_SW</name>
              <description>Set to determine the switch of csn0 and csn1~3. 
3'b000: no switch
3'b001: csn0 switch with cs1
3'b010: csn0 switch with cs2
3'b100: csn0 switch with cs3
Exists: TAG &gt;= 2.0.8.</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SER</name>
              <description>Each bit in the register corresponds to one SPI Flash. In user mode user program the register to select target flash. 
0: Not selected 
1: Selected</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUDR</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>Baud Rate Select</description>
          <resetValue>0x00000014</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CKPS_EN</name>
              <description>CKPS enable bit. Set this bit to use CKPS feature.
Exists: TAG &gt;= 2.0.8.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKPS</name>
              <description>Indicate the shift range of device clk (SCLK) when CKPS_EN is set. (unit: bus_clk)
Exists: TAG &gt;= 2.0.8.</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCKDV</name>
              <description>Define spi_sclk divider value. The frequency of spi_sclk is derived from:
The frequency of spi_sclk = The frequency of bus_clk/(2*SCKDV).</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFTLR</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>Transmit FIFO Threshold level</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TFT</name>
              <description>Transmit FIFO threshold. To Control FIFO entries of valid data in normal transfer except in receiving mode. When a number of FIFO entry is equal or smaller than TFT, SPIC triggers a spi_txeir interrupt. 
Ex: If TXFTLR = 5'h1, set spi_txeir when FIFO entries &lt;= TFT (1)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFTLR</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>Receive FIFO Threshold level</description>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFT</name>
              <description>Receive FIFO threshold. To Control FIFO entries of valid data in receiving mode. When a number of FIFO entry is greater than RFT, SPIC triggers a spi_rxfir interrupt. 
Ex: If RXFTLR = 5'h1, set spi_rxfir when FIFO entries &gt; RFT (1)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFLR</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>Transmit FIFO level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXFLR</name>
              <description>Transmit FIFO level. Indicates the FIFO entry level of valid data in normal mode except in receiving data. (or as FIFO_FLR in any mode)</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFLR</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>Receive FIFO level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXFLR</name>
              <description>Receive FIFO level. Indicates the FIFO entries of valid data in receiving data.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>Status Register</description>
          <resetValue>0x00000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDE_ST</name>
              <description>PDE state. Set if device has entered DPD/Sleep Mode
Exists: TAG &gt;= 2.0.7.
Available only if configuration of SPI_PDEX_ENABLE is defined.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ATWR_RDSR_N</name>
              <description>The previous auto write cmd didn't check the status register (RDSR). User should check the status register of Flash before next user mode transaction.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOT_FIN</name>
              <description>Boot Finish. Set if count waiting cycles (Boot Delay Count) for SPI Flash becomes a stable state after power on (or system reset). 1: Boot Finish Note: Auto_mode would be blocked until boot finish. User cannot set CR until boot finish.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOL</name>
              <description>Data Collision, or in Transmitting Status.
1: Status shows that SPIC is transmitting spi_flash_cmd/spi_flash_addr/spi_flash_data to SPI Flash.
Suggest not reading DR during this transmitting state. (Check this status can avoid reading wrong data and cause SPIC error.)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>Transmission error. Set if FIFO is empty and starting to transmit data to SPI Flash. This bit is cleared when read.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RFF</name>
              <description>Receive FIFO full. Set if FIFO is full in receiving mode. This bit is cleared when read.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RFNE</name>
              <description>Receive FIFO is not empty. Set if FIFO is not empty in receiving mode. This bit is cleared when read.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit FIFO is empty. Set if FIFO is empty in transmit mode, else it is cleared when it has data in FIFO.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFNF</name>
              <description>Transmit FIFO is not full. Set if FIFO is not full in transmit mode, else it is cleared when FIFO is full.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>SPIC busy flag. Set if SPIC is still transmitting to or receiving data from SPI Flash, or TX_FIFO/RX_FIFO are not empty.
User should check BUSY=0 before setting 0x00[31]USER_MODE.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
