Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>DM_DR6</name>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 6</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND6</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR6</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR7</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 7</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND7</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR7</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR8</name>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 8</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND8</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR8</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR9</name>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 9</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND9</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR9</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR10</name>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 10</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND10</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR10</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR11</name>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 11</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND11</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR11</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR12</name>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 12</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND12</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR12</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR13</name>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 13</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND13</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR13</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR14</name>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 14</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND14</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR14</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR15</name>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 15</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND15</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR15</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_FAST_SINGLE</name>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <description>Fast Read Data Command of SPI Flash</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRD_CMD</name>
              <description>Indicate SPI Flash command value of fast read command. The baud rate is used with FBAUDR.
FRD_CMD[15:8] is for RD_OCTA_IO_CMD_2nd_BYTE (only available when configuration of DDR_EN is defined)
FRD_CMD[7:0] is for RD_OCTA_IO_CMD_1st_BYTE</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_DUAL_DATA</name>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <description>Dual Output Read Command of SPI Flash</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_DUAL_O_CMD</name>
              <description>Indicates SPI Flash command value of dual data read command.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_DUAL_ADDR_DATA</name>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <description>Dual I/O Read Command of SPI Flash</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_DUAL_IO_CMD</name>
              <description>Indicates SPI Flash command value of dual address and data read command.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_QUAD_DATA</name>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <description>Qaud Output Read Command of SPI Flash</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_QUAD_O_CMD</name>
              <description>Indicates SPI Flash command value of quad data read command.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_QUAD_ADDR_DATA</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description>Quad I/O Read Command of SPI Flash</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXIT_PRM_CMD</name>
              <description>Exit High Performance Read Mode commend.
Note: Available only if configuration of PRM_EN is defined (SPIC Lite ver).</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRM_VAL</name>
              <description>High Performance Read Mode Value.
Note: Available only if configuration of PRM_EN is defined (SPIC Lite ver).</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXIT_PRM_DUM_LEN</name>
              <description>If Exit PRM commend is more than 1 byte, use EXIT_PRM_DUM_LEN to extend the commend. It is referenced by bus_clk.
Ex. In qpi mode (4-4-4), FFFFFFFFh data cycle should be issued (4-byte data in 8 spi cycles). EXIT_PRM_CMD only push 1 byte (2 spi cycles), so use EXIT_PRM_DUM_LEN to extend 6 spi cycles.
EXIT_PRM_DUM_LEN = 6 (spi_cycle) * (2 * baurd_rate)
Note: Available only if configuration of PRM_EN is defined (SPIC Lite ver).</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_QUAD_IO_CMD</name>
              <description>Indicates SPI Flash command value of quad address and data read command.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITE_SIGNLE</name>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <description>Page Program Command of SPI Flash</description>
          <resetValue>0x000000CA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WR_CMD</name>
              <description>Indicate SPI Flash command value of write command.
WR_CMD[15:8] is for WR_OCTA_IO_CMD_2nd_BYTE (only available when configuration of DDR_EN is defined)
WR_CMD[7:0] is for WR_OCTA_IO_CMD_1st_BYTE</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITE_DUAL_DATA</name>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <description>Dual Data Input Program Command of SPI Flash</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WR_DUAL_I_CMD</name>
              <description>Indicates SPI Flash command value of dual data write command.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITE_DUAL_ADDR_DATA</name>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <description>Dual Address and Data Output Read Command of SPI Flash</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WR_DUAL_II_CMD</name>
              <description>Indicates SPI Flash command value of dual address and data write  command.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITE_QUAD_DATA</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description>Quad Data Input Program Command of SPI Flash</description>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WR_QUAD_I_CMD</name>
              <description>Indicates SPI Flash command value of quad data write command.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITE_QUAD_ADDR_DATA</name>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <description>Quad Address and Data Output Read Command of SPI Flash</description>
          <resetValue>0x00000026</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WR_QUAD_II_CMD</name>
              <description>Indicates SPI Flash command value of quad address and data write command.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITE_ENABLE</name>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <description>Write Enable Command of SPI Flash</description>
          <resetValue>0x00000606</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WR_EN_CMD_2nd_BYTE</name>
              <description>Indicates SPI Flash command value of 2nd byte of write enable.
Available only if configuration of DDR_EN is defined.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_EN_CMD_1st_BYTE</name>
              <description>Indicates SPI Flash command value of 1st byte of write enable.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
