Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>READ_STATUS</name>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <description>Read Status Command of SPI Flash</description>
          <resetValue>0x10000505</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTERVAL_EN</name>
              <description>Set to enable INTERVAL_ODD.
Available only if configuration of SPIC_LITE is not defined (SPIC Full ver).</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERVAL_ODD</name>
              <description>Indicates SPI Flash read status with 2-Byte status but checking only odd byte or even byte.
0: even byte (2, 4, 6, ...)
1: odd byte (1, 3, 5, ...)
Available only if configuration of SPIC_LITE is not defined (SPIC Full ver).</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST_CMD_LEN</name>
              <description>Indicates the number of bytes in read status command.
ST_CMD_LEN can be 1~3.
Available only if configuration of SPIC_LITE is not defined (SPIC Full ver).</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST_CMD_CH</name>
              <description>Indicates channel number of read status command in transmitting and receiving data.
0: single channel
1: dual channels
2: quad channels
3: octal channel</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST_CMD_DDR_EN</name>
              <description>Indicates the DDR mode in ST_CMD_CH.
Available only if configuration of DDR_EN is defined.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_ST_CMD_3rd_BYTE</name>
              <description>Indicates SPI Flash command value of 3rd byte of read status.
Available only if configuration of SPIC_LITE is not defined (SPIC Full ver).</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_ST_CMD_2nd_BYTE</name>
              <description>Indicates SPI Flash command value of 2nd byte of read status.
Available only if configuration of SPIC_LITE is not defined (SPIC Full ver).</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_ST_CMD_1st_BYTE</name>
              <description>Indicates SPI Flash command value of 1st byte of read status.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLR2</name>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <description>Control Register 2</description>
          <resetValue>0x00103551</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_WEIGHT</name>
              <description>Set to determine the read and write priority. RD_WEIGHT should &gt;= 2 (if set to 0 or 1, RD_WEIGHT will use the previous value).
Ex: if RD_WEIGHT = 5, SPIC will accept 1 write cmd after accepting 4 read cmd.</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_VL_EN</name>
              <description>Set to enable variable write latency. SPIC will set variable write latency according to RWDS.
If WR_VL_EN = 0, SPIC will set fix write latency.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_VALID_EN</name>
              <description>Set to enable variable read latency. SPIC will not sample read data until rx_data_valid = 1.
If RD_VALID_EN = 0, SPIC will sample read data according to internal counter.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRAP_IMPR_DIS</name>
              <description>Set to disable wrap_align function (convert wrap to incremental through aligning start address to burst boundary) in auto mode.
If DIS_WRAP_ALIGN = 1, SPIC will chop wrap transation into two incremental transactions.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DM_CA_DIS</name>
              <description>Set to disable spi_dm_oe_n (let the device to drive DM) when SPIC pushing CMD and ADDR for both user mode and auto mode.
Used to implement write variable latency in Winbond psram.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FULL_WR</name>
              <description>Set to enable full write in both user mode and auto mode.
If FULL_WR=1, SPIC will ignore pushing DM_DR in user mode.
If FULL_WR = 0, SPIC will use spi_dm to do partial write in auto mode.
Available only if configuration of DM_EN is defined.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DM_ACT</name>
              <description>DM (Data Mask) is active high or low, which is defined by specific PSRAM SPEC. 
If DM is active high (DM=1 means "don't write"), DM_ACT should be set to 1 and the corresponding byte of write data will not be written into the PSRAM.
Available only if configuration of DM_EN is defined.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FIFO_ENTRY</name>
              <description>If using SPIC_HAS_DMA (NO_MERGE_FIFO) SPIC, this field indicates the valid entry of RX FIFO. It is an index of 2 and it should be equal or smaller than 5. The user can modify it to profile with a different entry. 
Ex: if RX_FIFO entry is 32, RX_FIFO_ENTYR &lt;=5.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_FIFO_ENTRY</name>
              <description>If using SPIC_HAS_DMA (NO_MERGE_FIFO) SPIC, this field indicates the valid entry of TX_FIFO. If using MERGE_FIFO SPIC, there is only one FIFO is in the SPIC design, and this field indicates the valid entry of the FIFO. It is an index of 2 and it should be equal or smaller than FIFO_ABW. The user can modify it to profile with a different entry. 
Ex: if FIFO entry is 32, FIFO_ENTYR &lt;=5.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DR_FIXED</name>
              <description>Indicate the AXI FIXED read mode on DR. (after 2021/01).
It can only work on address that aligns to request size.
Ex:
(1) arsize=0, addr[1:0] can be 00, 01, 10, 11
(2) arsize=1, addr[1:0] can be 00, 10
(3) arsize=2, addr[1:0] can be 00.
If setting 1, user mode read DR will be FIXED.
Otherwise, user mode read DR will be INCR.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPN_DNUM</name>
              <description>Indicates the WPn input pin of SPI Flash is connected to spi_sout[2]or [3]. 
If setting 0, it connects to spi_sdata[2]. Otherwise, it connects to spi_sdata[3].</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPN_SET</name>
              <description>To implement write protect function. spi_wen_out and the bit of spi_sout which connects to WPN would be initial to 0. 
WPN_SET: If setting 1 is protected. Otherwise, is not protected.(Configuration Form is using "WPN_SET_n": If setting 1 is NOT protected. Otherwise, is protected.)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SO_DNUM</name>
              <description>Indicates SO input pin of SPI Flash is connected to spi_sout[0]or [1]. It refers to SPI Flash and also the system connection with SPI_Flash (see 6.1.3) 
If setting 0, it connects to spi_sout[0] (single-channel connection). 
Otherwise, it connects to spi_sout[1] (multi-channels connection). 
(Default is configured to 1to support multi-channel connection)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBAUDR</name>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <description>Fast Baud Rate Select</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSCKDV</name>
              <description>Indicate the divider of Fast read command when FAST_RD is setting in user mode or using fast read command in auto mode. The frequency of spi_sclk is derived from:
Frequency of spi_sclk = Frequency of bus_clk/(2*FSCKDV).</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_LENGTH</name>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <description>User Length Register</description>
          <resetValue>0x00030000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USER_ADDR_LENGTH</name>
              <description>Indicates number of bytes in address phase (between command phase and write/read phase) in user mode.
If it is set to 4, it will transmit 4-byte Address to support 4-byte address mode in SPI Flash.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USER_CMD_LENGHT</name>
              <description>Indicates number of bytes in command phase in user mode.
USER_CMD_LENGHT can be 0~3.</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USER_RD_DUMMY_LENGTH</name>
              <description>Indicates delay cycles for receiving data in user mode (USER_MODE == 1).
It is referenced by bus_clk.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTO_LENGTH</name>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <description>Auto Address Length Register</description>
          <resetValue>0x00030000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUTO_CMD_LENGTH</name>
              <description>Indicate byte numbers of read/write command in auto mode.
AUTO_CMD_LENGTH should be 1 or 2 bytes.
Note: If set 0, it will transmit 1 byte command to device.
Exists: TAG &gt;= 2.0.8.</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDSR_DUMMY_LENGTH</name>
              <description>Indicates delay cycles for receiving data after Read Status Register (RDSR) command. (auto write or user mode with auto check) 
It is referenced by bus_clk.</description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTO_ADDR_LENGTH</name>
              <description>Indicates number of bytes address in read/write command in auto mode. 
AUTO_ADDR_LENGTH should be 1, 2, 3, 4 bytes. 
If it is set to 4, it will transmit 4-byte Address to support 4-byte address mode in SPI Flash. 
Note: PRM in auto mode should set VALID_CMD[11] (PRM_EN) with correct AUTO_ADDR_LENGTH.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_PHYSICAL_CYC</name>
              <description>Indicates how many SPIC CLK (bus_clk) cycles from pad to internal SPIC.
It is used in both auto mode and user mode.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_DUMMY_LENGTH</name>
              <description>Indicates delay cycles for receiving data.
It is referenced by bus_clk.
Note: Don't include SPIC CLK (bus_clk) cycles from pad to internal SPIC</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VALID_CMD</name>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <description>Valid Command Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_SWAP</name>
              <description>Set to enable address swap based on CR.FLASH_SIZE in auto mode
If address swap is enable, memory space is divided by two and address will be swapped between two spaces
ex. if CR.FLASH_SIZE is 0x9, axi_axaddr is 0x00000000. The real address transmitted to device will be 0x00800000
Exists: TAG &gt;= 2.0.14.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR_PUIN</name>
              <description>Set (1) to pull in first address to negedge of spi_clk. (negedge of last cmd)
Set (0) indicate first address start at next posedge of last cmd phase.
Used when DDR address and need to pull in address.
Exists: TAG &gt;= 2.0.6.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_TRANS_DIS</name>
              <description>Set (1) to disable sequential read and sequential write function in auto mode.
If two bus read/write transactions are sequential (address is consecutive), SPIC can access second transaction data without sending CMD/ADDR/DUMMY.
Once disable (1) this bit field, spi_csn will inactive immediately and also disable this function.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUM_EN</name>
              <description>Enable to push one dummy byte (DUM_BYTE_VAL) after pushing address to Flash in auto read. If PRM_EN is active, it will push PRM_Value instead of DUM_BYTE_VAL.
If RD_DUMMY_LENGTH = 0, it won't push the dummy byte.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRLR0_CH</name>
              <description>Set (1) to use CTRLR0 CMD_CH/DATA_CH/ADDR_CH and DDR_EN field in Auto mode; Otherwise, SPIC will decode according to which VALID_CMD you choose in auto mode.
Suggestion while use this bit field: 
Read Flash mode: (1-4-8), (4-4-8), (1-4D-8D), (4-4D-8D) with using RD_QUAD_IO[7:0] 
Read Flash mode (with 2-Byte CMD): (1-8-8), (8-8-8), (8D-8D-8D), (4D-4D-4D) with using RD_FAST_SINGLE_IO[15:0] (always using FBAUD) 
Write Flash mode: (1-4-8), (4-4-8) with using WR_QUAD_IO[7:0] 
Write Flash mode (with 2-Byte CMD): (1-8-8), (8-8-8), (8D-8D-8D) with using WR_SINGLE_IO[15:0]</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRM_EN</name>
              <description>Set to enable SPIC performance read mode in Auto Mode. RXI-312 SPIC will auto exit performance read mode before auto write or enter to user mode.
Enter PRM Flow:
1. Set CR_VALID_CMD[11] (PRM_EN) with CR_VALID_CMD[4] (RD_QUAD_IO) or with (CR_VALID_CMD[0] and CR_VALID_CMD[12])
2. Set CR_READ_QUAD_ADDR_DATA[23:16] (PRM_VALUE) and [7:0] (RD_QUAD_IO_CMD)
3. Set correct Dummy Cycle, and Valid Command then access in Auto Mode address range
If PRM_EN, at 1st time Auto Rd, it will access with CMD, and store this condition. At 2nd Auto Rd or later, it will access without CMD but with Address and Mode Value. Our SPIC will check PRM_VALUE (CR_READ_QUAD_ADDR_DATA [23:16]), if PRM_VALUE ==00 (not a valid PRM value), and PRM_EN is set, SPIC will always access SPI Flash with (CMD+ADDR+MODE+DUMMY+...) format.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RM_WEN</name>
              <description>Remove write enable command in auto write.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RM_RDSR</name>
              <description>Remove read status register in auto write.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_QUAD_II</name>
              <description>Indicates quad address/data write is a valid command to execute. (known as (1-4-4))</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_QUAD_I</name>
              <description>Indicates quad data write is a valid command to execute. (known as (1-1-4))</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_DUAL_II</name>
              <description>Indicates dual address/data write is a valid command to execute. (known as (1-2-2))</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_DUAL_I</name>
              <description>Indicates dual data write is a valid command to execute. (known as (1-1-2))</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_QUAD_IO</name>
              <description>Indicates quad address/data read is a valid command to execute. (known as (1-4-4))</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_QUAD_O</name>
              <description>Indicates quad data read is a valid command to execute. (known as (1-1-4))</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_DUAL_IO</name>
              <description>Indicates dual address/data read is a valid command to execute. (known as (1-2-2))</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_DUAL_I</name>
              <description>Indicates dual data read is a valid command to execute. (known as (1-1-2))</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRD_SINGLE</name>
              <description>Indicates fast read command is a valid command to execute. (known as (1-1-1))</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASE_SIZE</name>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <description>Flash Size Register</description>
          <resetValue>0x0000000C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASH_SIZE</name>
              <description>Indicate the size of flash size to select the target SPI Flash in auto mode. (flash size unit is byte)
If TAG &gt;= 2.0.3: CR_FLASH_SIZE = log2 (flash size) -15. 
Ex: flash size is 4MB, CR_FLASH_SIZE = log2 (4MB) -15 = 22 - 15 = 7</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLUSH_FIFO</name>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <description>Flush FIFO Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLUSH_ST_FIFO</name>
              <description>Clear all data in the ST_FIFO when writing to FLUSH_ST_FIFO register.</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>FLUSH_DR_FIFO</name>
              <description>Clear all data in the TX_FIFO and RX_FIFO when writing to FLUSH_DR_FIFO register.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>FLUSH_ALL</name>
              <description>Clear all data in all FIFO (include TX_FIFO, RX_FIFO and ST_FIFO) and reset all FSM when writing to FLUSH_ALL register.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DUM_BYTE</name>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <description>Dummy byte value</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUM_BYTE_VAL</name>
              <description>Push dummy byte value.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
