Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>SEC_END_1</name>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <description>SEC region 1 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_END1</name>
              <description>SEC region 1 end address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R1_MODE</name>
              <description>SEC region 1 - function mode/seed selection.
Select one of mode/seed from SEC_NONCE0~SEC_NONCE7</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R1_EN</name>
              <description>Set to enable SEC region 1 to scramble write data and descramble read data.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_NONCE_1</name>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <description>SEC region 1 nonce register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_NONCE1</name>
              <description>Only present if SEC_CONF_MODE &gt; 0.
Seed of scrambler mode 1.
This register value cannot be 0, otherwise the encrypted data will be equal to the original data.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_BASE_2</name>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <description>SEC region 2 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_BASE2</name>
              <description>SEC region 2 base address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_END_2</name>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <description>SEC region 2 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_END2</name>
              <description>SEC region 2 end address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R2_MODE</name>
              <description>SEC region 2 - function mode/seed selection.
Select one of mode/seed from SEC_NONCE0~SEC_NONCE7</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R2_EN</name>
              <description>Set to enable SEC region 2 to scramble write data and descramble read data.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_NONCE_2</name>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <description>SEC region 2 nonce register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_NONCE2</name>
              <description>Only present if SEC_CONF_MODE &gt; 0.
Seed of scrambler mode 2.
This register value cannot be 0, otherwise the encrypted data will be equal to the original data.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_BASE_3</name>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <description>SEC region 3 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_BASE3</name>
              <description>SEC region 3 base address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_END_3</name>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <description>SEC region 3 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_END3</name>
              <description>SEC region 3 end address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R3_MODE</name>
              <description>SEC region 3 - function mode/seed selection.
Select one of mode/seed from SEC_NONCE0~SEC_NONCE7</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R3_EN</name>
              <description>Set to enable SEC region 3 to scramble write data and descramble read data.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_NONCE_3</name>
          <addressOffset>0x0000022C</addressOffset>
          <size>32</size>
          <description>SEC region 3 nonce register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_NONCE3</name>
              <description>Only present if SEC_CONF_MODE &gt; 0.
Seed of scrambler mode 3.
This register value cannot be 0, otherwise the encrypted data will be equal to the original data.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_BASE_4</name>
          <addressOffset>0x00000230</addressOffset>
          <size>32</size>
          <description>SEC region 4 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_BASE4</name>
              <description>SEC region 4 base address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_END_4</name>
          <addressOffset>0x00000234</addressOffset>
          <size>32</size>
          <description>SEC region 4 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_END4</name>
              <description>SEC region 4 end address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R4_MODE</name>
              <description>SEC region 4 - function mode/seed selection.
Select one of mode/seed from SEC_NONCE0~SEC_NONCE7</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R4_EN</name>
              <description>Set to enable SEC region 4 to scramble write data and descramble read data.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_NONCE_4</name>
          <addressOffset>0x00000238</addressOffset>
          <size>32</size>
          <description>SEC region 4 nonce register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_NONCE4</name>
              <description>Only present if SEC_CONF_MODE &gt; 0.
Seed of scrambler mode 4.
This register value cannot be 0, otherwise the encrypted data will be equal to the original data.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_BASE_5</name>
          <addressOffset>0x0000023C</addressOffset>
          <size>32</size>
          <description>SEC region 5 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_BASE5</name>
              <description>SEC region 5 base address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_END_5</name>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <description>SEC region 5 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_END5</name>
              <description>SEC region 5 end address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R5_MODE</name>
              <description>SEC region 5 - function mode/seed selection.
Select one of mode/seed from SEC_NONCE0~SEC_NONCE7</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R5_EN</name>
              <description>Set to enable SEC region 5 to scramble write data and descramble read data.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_NONCE_5</name>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <description>SEC region 5 nonce register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_NONCE5</name>
              <description>Only present if SEC_CONF_MODE &gt; 0.
Seed of scrambler mode 5.
This register value cannot be 0, otherwise the encrypted data will be equal to the original data.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_BASE_6</name>
          <addressOffset>0x00000248</addressOffset>
          <size>32</size>
          <description>SEC region 6 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_BASE6</name>
              <description>SEC region 6 base address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_END_6</name>
          <addressOffset>0x0000024C</addressOffset>
          <size>32</size>
          <description>SEC region 6 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_END6</name>
              <description>SEC region 6 end address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R6_MODE</name>
              <description>SEC region 6 - function mode/seed selection.
Select one of mode/seed from SEC_NONCE0~SEC_NONCE7</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R6_EN</name>
              <description>Set to enable SEC region 6 to scramble write data and descramble read data.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_NONCE_6</name>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <description>SEC region 6 nonce register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_NONCE6</name>
              <description>Only present if SEC_CONF_MODE &gt; 0.
Seed of scrambler mode 6.
This register value cannot be 0, otherwise the encrypted data will be equal to the original data.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_BASE_7</name>
          <addressOffset>0x00000254</addressOffset>
          <size>32</size>
          <description>SEC region 7 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_BASE7</name>
              <description>SEC region 7 base address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_END_7</name>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <description>SEC region 7 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_END7</name>
              <description>SEC region 7 end address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R7_MODE</name>
              <description>SEC region 7 - function mode/seed selection.
Select one of mode/seed from SEC_NONCE0~SEC_NONCE7</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R7_EN</name>
              <description>Set to enable SEC region 7 to scramble write data and descramble read data.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_NONCE_7</name>
          <addressOffset>0x0000025C</addressOffset>
          <size>32</size>
          <description>SEC region 7 nonce register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_NONCE7</name>
              <description>Only present if SEC_CONF_MODE &gt; 0.
Seed of scrambler mode 7.
This register value cannot be 0, otherwise the encrypted data will be equal to the original data.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_IDR</name>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
          <description>SEC ID register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_IDR</name>
              <description>SEC ID register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
