Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>IMR</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>Interrupt Mask Register</description>
          <resetValue>0x000001EE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWEIM</name>
              <description>Nor Flash auto write error interrupt mask.
1: spi_aweir_r is not masked.
0: spi_aweir_r is masked.
Exists: TAG &gt;= 2.0.0.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NWEIM</name>
              <description>NAND Flash write error interrupt mask. 
1: spi_nweir_r is not masked. 
0: spi_nweir_r is masked.
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STFIM</name>
              <description>Status FIFO full interrupt mask. 
1: spi_stfir is not masked. 
0: spi_stfir is masked.
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STOIM</name>
              <description>Status FIFO overflow interrupt masked. 
1: spi_stoir_r is not masked. 
0: spi_stoir_r is masked.
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STUIM</name>
              <description>Status FIFO underflow interrupt masked. 
1: spi_stuir_r is not masked. 
0: spi_stuir_r is masked.
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DREIM</name>
              <description>DR timeout error interrupt mask. 
1: spi_dreir_r is not masked. 
0: spi_dreir_r is masked.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACSIM</name>
              <description>Auto-check Flash Status raw interrupt mask. 
1: spi_acsir_r is not masked. 
0: spi_acsis_r is masked.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TFSIM</name>
              <description>Transmit finish interrupt mask. 
1: spi_tfsir_r is not masked. 
0: spi_tfsir_r is masked.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USEIM</name>
              <description>User_mode error interrupt mask. 
1: spi_useir_r is not masked. 
0: spi_useir_r is masked.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACEIM</name>
              <description>Auto-check timeout error interrupt mask. 
1: spi_aceir_r is not masked. 
0: spi_aceir_r is masked.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BYEIM</name>
              <description>The Byte-Enable error interrupt mask. 
1: spi_byeir_r is not masked. 
0: spi_byeir_r is masked.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WBEIM</name>
              <description>Write burst error interrupt mask. 
1: spi_wbier_r is not masked. 
0: spi_wbeir_r is masked.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSEIM</name>
              <description>FIFO size error interrupt mask. 
1: spi_fseir_r is not masked. 
0: spi_fseir _r is masked</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIM</name>
              <description>Receive FIFO full interrupt mask. 
1: spi_rxfir is not masked. 
0: spi_rxfir is masked.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOIM</name>
              <description>Receive FIFO overflow interrupt masked. 
1: spi_rxoir_r is not masked. 
0: spi_rxoir_r is masked.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXUIM</name>
              <description>Receive FIFO underflow interrupt masked. 
1: spi_rxuir_r is not masked. 
0: spi_rxuir_r is masked.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXOIM</name>
              <description>Transmit FIFO overflow interrupt mask. 
1: spi_txoir_r is not masked. 
0: spi_txoir_r is masked.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEIM</name>
              <description>Transmit FIFO empty interrupt masked. 
1: spi_txeir is not masked. 
0: spi_txeir is masked.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWEIS</name>
              <description>Nor Flash auto write error interrupt status after masking.
1: spi_aweir_r is active after masking.
0: spi_aweir_r is not active after masking.
Exists: TAG &gt;= 2.0.0.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NWEIS</name>
              <description>NAND Flash write error interrupt status raw interrupt status after masking. 
1: spi_nweir_r is active after masking. 
0: spi_nweir_r is not active after masking.
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STFIS</name>
              <description>Status FIFO full raw interrupt status after masking. 
1: spi_stfir_r is active after masking. 
0: spi_stfir_r is not active after masking.
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STOIS</name>
              <description>Status FIFO overflow interrupt status after masking. 
1: spi_stoir_r is active after masking. 
0: spi_stoir_r is not active after masking.
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STUIS</name>
              <description>Status FIFO underflows interrupt status after masking. 
1: spi_stuir_r is active after masking. 
0: spi_stuir_r is not active after masking.
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DREIS</name>
              <description>DR timeout error status after masking. 
1: spi_dreir_r is active after masking. 
0: spi_dreir_r is not active after masking.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ACSIS</name>
              <description>Auto-check Flash Status after masking. 
1: spi_aceir_r is active after masking. 
0: spi_aceir_r is not active after masking.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFSIS</name>
              <description>Transmit finish interrupt status after masking. 
1: spi_tfsir_r is active after masking. 
0: spi_tfsir_r is not active after masking.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USEIS</name>
              <description>User mode error status after masking. 
1: spi_useir_r is active after masking. 
0: spi_useir_r is not active after masking.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ACEIS</name>
              <description>Auto-check timeout error status after masking. 
1: spi_aceir_r is active after masking. 
0: spi_aceir_r is not active after masking.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BYEIS</name>
              <description>The byte-Enable error interrupts status after masking. 
1: spi_byeir_r is active after masking. 
0: spi_byeir_r is not active after masking.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WBEIS</name>
              <description>Write burst error interrupt status after masking. 
1: spi_wbeir_r is active after masking. 
0: spi_wbeir_r is not active after masking.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FSEIS</name>
              <description>FIFO size error interrupts status after masking. 
1: spi_fesir_r is active after masking. 
0: spi_fesir_r is not active after masking.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIS</name>
              <description>Receive FIFO full interrupt status after masking 
1: spi_rxfir is active after masking. 
0: spi_rxfir is not active after masking.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXOIS</name>
              <description>Receive FIFO overflow interrupt status after masking. 
1: spi_rxoir_r is active after masking. 
0: spi_rxoir_r is not active after masking.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXUIS</name>
              <description>Receive FIFO underflows interrupt status after masking. 
1: spi_rxuir_r is active after masking. 
0: spi_rxuir_r is not active after masking.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXOIS</name>
              <description>Transmit FIFO overflow raw interrupt status after masking. 
1: spi_txoir_r is active after masking. 
0: spi_txoir_r is not active after masking.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXEIS</name>
              <description>Transmit FIFO empty raw interrupt status after masking. 
1: spi_txeir is active after masking. 
0: spi_txeir is not active after masking.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RISR</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>Raw Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWEIR</name>
              <description>Nor Flash auto write error interrupt status prior to masking.
1: spi_aweir_r is active prior to masking.
0: spi_aweir_r is not active prior to masking.
Exists: TAG &gt;= 2.0.0.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NWEIR</name>
              <description>NAND Flash write error interrupt status raw interrupt status prior to masking. 
1: spi_nweir_r is active prior to masking. 
0: spi_nweir_r is not active prior to masking.
Note: Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STFIR</name>
              <description>Status FIFO full raw interrupt status prior to masking 
1: spi_stfir is active prior to masking. 
0: spi_stfir is not active prior to masking.
Note: Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STOIR</name>
              <description>Status FIFO overflows raw interrupt status prior to masking. 
1: spi_stoir_r is active prior to masking. 
0: spi_stoir_r is not active prior to masking.
Note: Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STUIR</name>
              <description>Status FIFO underflows raw interrupt status prior to masking. 
1: spi_stuir_r is active prior to masking. 
0: spi_stuir_r is not active prior to masking.
Note: Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DREIR</name>
              <description>DR Timeout error status raw interrupt status prior to masking 
1: spi_dreir_r is active prior to masking. 
0: spi_dreir_r is not active prior to masking.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ACSIR</name>
              <description>Auto-check Flash Status raw interrupt status prior to masking 
1: spi_acsir_r is active prior to masking. 
0: spi_acsir_r is not active prior to masking.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFSIR</name>
              <description>Transmit Finish Status raw interrupt status prior to masking 
1: spi_tfsir_r is active prior to masking. 
0: spi_tfsir_r is not active prior to masking.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USEIR</name>
              <description>User_mode error status raw interrupt status prior to masking 
1: spi_useir_r is active prior to masking. 
0: spi_useir_r is not active prior to masking.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ACEIR</name>
              <description>Auto-check timeout error status raw interrupt status prior to masking 
1: spi_aceir_r is active prior to masking. 
0: spi_aceir_r is not active prior to masking.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BYEIR</name>
              <description>The Byte-Enable error interrupt status raw interrupt status prior to mask. 
1: spi_byeir_r is active prior to masking. 
0: spi_byeir_r is not active prior to masking.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WBEIR</name>
              <description>Write burst error interrupt status raw interrupt status prior to masking. 
1: spi_wbeir_r is active prior to masking. 
0: spi_wbeir_r is not active prior to masking.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FSEIR</name>
              <description>FIFO size error interrupt status raw interrupt status prior to masking. 
1: spi_fseir_r is active prior to masking. 
0: spi_fseir _r is not active prior to masking.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIR</name>
              <description>Receive FIFO full raw interrupt status prior to masking 
1:spi_rxfir is active prior to masking. 
0: spi_rxfir is not active prior to masking.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXOIR</name>
              <description>Receive FIFO overflows raw interrupt status prior to masking. 
1: spi_rxoir_r is active prior to masking. 
0: spi_rxoir_r is not active prior to masking.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXUIR</name>
              <description>Receive FIFO underflows raw interrupt status prior to masking. 
1: spi_rxuir_r is active prior to masking. 
0: spi_rxuir_r is not active prior to masking.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXOIR</name>
              <description>Transmit FIFO overflow raw interrupt status prior to masking. 
1: spi_txoir_r is active prior to masking. 
0: spi_txoir_r is not active prior to masking.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXEIR</name>
              <description>Transmit FIFO empty raw interrupt status prior to masking. 
1: spi_txeir is active prior to masking. 
0: spi_txeir is not active prior to masking.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXOICR</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>Transmit FIFO Overflow Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXOICR</name>
              <description>When reading/writing the register, spi_rxoir_r would be cleared.
Note: Only response value 0 when read.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXOICR</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>Receive FIFO Overflow Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXOICR</name>
              <description>When reading/writing the register, spi_rxoir_r would be cleared.
Note: Only response value 0 when read.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXUICR</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Receive FIFO Underflow Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXUICR</name>
              <description>When reading/writing the register, spi_rxuir_r would be cleared.
Note: Only response value 0 when read.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSTICR</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Master error Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSTICR</name>
              <description>When reading/writing the register, spi_mstir_r would be cleared.
Note: Only response value 0 when read.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICR</name>
              <description>When reading/writing the register, all interrupt would be cleared.
Note: Only response value 0 when read.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACR</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>DMA Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_DMAC_EN</name>
              <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel. 
0: Transmit DMA disabled
1: Transmit DMA enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DMAC_EN</name>
              <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel 
0: Receive DMA disabled
1: Receive DMA enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
