Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>DMATDLR</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>DMA Transmit Data Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMATDL</name>
              <description>Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARDLR</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>DMA Receive Data Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMARDL</name>
              <description>Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or above this field value + 1, and RDMAE=1.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>Identification Register</description>
          <resetValue>0x0400FF01</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDCODE</name>
              <description>Contain the decimal value of SPIC version.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPIC_VERSION</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>SPIC version ID Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPIC_VERSION</name>
              <description>Contain the decimal value of SPIC version. 
(After 201612: SVN_NUM changes to Git Counter)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR0</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>Data Register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR0</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR1</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>Data Register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR1</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR2</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>Data Register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR2</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR3</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>Data Register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR3</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR4</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>Data Register 4</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR4</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR5</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>Data Register 5</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR5</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR6</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description>Data Register 6</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR6</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR7</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>Data Register 7</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR7</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR8</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>Data Register 8</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR8</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR9</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>Data Register 9</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR9</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR10</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>Data Register 10</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR10</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR11</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>Data Register 11</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR11</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR12</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>Data Register 12</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR12</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR13</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>Data Register 13</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR13</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR14</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description>Data Register 14</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR14</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR15</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description>Data Register 15</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR15</name>
              <description>It is a data buffer with 8-bit width FIFO. If accessing in word data byte, it would read/write 4 entries of FIFO.
SPIC will set SSIENR.SPIC_EN=1 automatically if user continues to push DR when DR is full in user write mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR0</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND0</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR0</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR1</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND1</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR1</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR2</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND2</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR2</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR3</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND3</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR3</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR4</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 4</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND4</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR4</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DM_DR5</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description>Data Mask Data Register 5</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_MASK_DR_EXTEND5</name>
              <description>It is a extended data buffer for spi_dm[1] signal in user mode when the width of spi_dm is 2-bit (DQ16). The output value of spi_dm[1] is the data that has been pushed to DM_FIFO [1]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN and DQ16 are defined.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA_MASK_DR5</name>
              <description>It is a data buffer for spi_dm signal in user mode. The output value of spi_dm is the data that has been pushed to DM_FIFO [0]. If DM_FIFO is empty, the output value of spi_data_en will be (~DM_ACT).
Available only if configuration of DM_EN are defined.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
