Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>TX_NDF</name>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <description>TX_NDF</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_NDF</name>
              <description>Indicates a number of data frames (Unit: Byte). After transmitting command and address, SPIC transmits data continuously until data frames are equal to TX_NDF. TX_NDF can set larger than TX_FIFO size.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICE_INFO</name>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <description>Device info</description>
          <resetValue>0x00000118</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USER_DEFINED_ATOM</name>
              <description>Enable user defined DEVICE_INFO[30:29].ATOM_SIZE
1: users can program ATOM_SIZE
0: SPIC sets ATOM_SIZE dynamically
Exists: TAG &gt;= 2.0.12.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATOM_SIZE</name>
              <description>Indicate the atomic size of read/write transactions
2'b00: 1 byte
2'b01: 2 byte
2'b10: 4 byte
2'b11: 3 byte
The equation of atomic size:
data_channel * data_rate
e.g., if DQ16 and DDR, atomic size is (16*2/8) = 4 byte
*Minimun atomic size is 1 byte
*For exception of this equaltion, refer to PSRAM Format for devices with special requirements
For TAG &lt; 2.0.12, ATOM_SIZE is [7:6] and is set automatically by SPIC</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_UNIT_4B</name>
              <description>Set (1) when the SPI device stores 4-byte data for each address.
Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DQ16_DATA_CH</name>
              <description>Set (1) when DQ16 PSRAM uses 16-bit data channel.
When DQ16_DATA_CH = 1'b1, set CTRLR0[19:18] DATA_CH = 2'b00.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_UNIT_2B</name>
              <description>Set (1) when the SPI device stores 2-byte data for each address.
Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JEDEC_P2CMF</name>
              <description>Set (1) when the SPI cmd is JEDEC Profile 2.0 Command Modifier Formats. (6-byte command and address)
Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM</name>
              <description>Set (1) when the SPI device is PSRAM. PSRAM will disable WEN and RDSR in auto write.
Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAND_FLASH</name>
              <description>Set (1) when the SPI device is NAND Flash. (not support yet)
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOR_FLASH</name>
              <description>Set (1) when the SPI device is NOR Flash.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_PAGE_EN</name>
              <description>Enable SPIC to chop the burst read command across page boundaries in auto mode.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_PAGE_EN</name>
              <description>Enable SPIC to chop the burst write command across page boundaries in auto mode.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGE_SIZE</name>
              <description>The page size of device (byte) = 2^(PAGE_SIZE)
The minimum value of page size is 128-byte. Please set PAGE_SIZE &gt;= 7.
ex. If the page size of device is 256-byte, PAGE_SIZE should be set to 8.
0x7: 128-byte
0x8: 256-byte
0x9: 512-byte
0xa: 1024-byte
0xb: 2048-byte
0xc: 4096-byte</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR0</name>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <description>Timing parameters</description>
          <resetValue>0x000A0C30</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CS_TCEM</name>
              <description>Set to chop auto cmd when CSN low pulse width = (CS_TCEM*32) bus_clk. If set CS_TCEM = 0 will disable this function.
ex. PSRAM tCEM = 4us, SPIC frequency = 100Mhz. 
CS_TCEM = ((4000 ns/10 ns)/32) - BYTE_DELAY = 12 (c) - BYTE_DELAY
If ((16*baud_rate)/data_channel) &lt;=32. BYTE_DELAY = 0.
If ((16*baud_rate)/data_channel) &gt; 32. BYTE_DELAY = (((16*baud_rate)/data_channel) - 32)/32.
ex. If baud_rate = 3, data_channel = 1. 
BYTE_DELAY = (((16*3)/1) - 32)/32 = 16/32 = 0.5
Therefore, BYTE_DELAY should be 1 in this example.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_SEQ_TIMEOUT</name>
              <description>The timeout setting of auto command after sequential read command. If set CS_SEQ_TIMEOUT = 00 will disable this function. 
If set CS_SEQ_TIMEOUT &gt; 00, SPIC will exit sequential transaction read and inactive CS when there is no auto read/write command for (CS_SEQ_TIMEOUT *4) bus_clocks.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_ACTIVE_HOLD</name>
              <description>For Flash chip select active hold time after SCLK rising edge (refer to tSLCH/CHSH, tCSS/tCSH)
Note: Wait most 16 bus_clk cycles before CS inactive. (Implement CS_ACTIVE_Hold timing only, CS_ACTIVE_Setup timing using D-PHY to shift)</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_H_WR_DUM_LEN</name>
              <description>Dummy cycle between sending write command to SPI Flash. Using the dummy cycles to avoid the timing violation of CS high time.</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_H_RD_DUM_LEN</name>
              <description>Dummy cycle between sending read command to SPI Flash. Using the dummy cycles to avoid the timing violation of CS high time.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTO_LENGTH2</name>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <description>Auto Address Length Register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WR_DUMMY_LENGTH</name>
              <description>Indicates delay cycles for transmitting data in auto mode.
It is referenced by bus_clk.
Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR1</name>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <description>Timing Parameters Register 1</description>
          <resetValue>0x00280A01</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPWR</name>
              <description>It is used to configure the cycle counts before spi_csn becomes low when spi_pwr turns from low to high.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_WINDOW</name>
              <description>It is used to configure the cycle counts before turn off the spi_pwr when SPIC is IDLE.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_ACTIVE_SETUP</name>
              <description>It is used to configure the setup time before the first edge (rising edge for mode0 and falling edge for mode3) of spi_sclk(refer to tCSS or tSLCH ).
Note: It can't be configured 0 (if you configure 0 to this 4 bits field, this field will not be updated).</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOT_STAVRE</name>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <description>Slot Starvation Control Register</description>
          <resetValue>0x00000030</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDLE_TIMEOUT</name>
              <description>If the current slot has no command and another slot has command, or both write/read slot have no command and current slot is write slot, to wait IDLE_TIMEOUT cycles and turnaround slot if current slot still has no command
Exists: TAG &gt;= 2.0.5.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE_STARVE_CYC</name>
              <description>This is basic starvation counter cycles for WR_STARVE_CYC and RD_STARVE_CYC.
Exists: TAG &gt;= 2.0.5.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_STARVE_CYC</name>
              <description>The timeout of write slot would be set when write cmd is no servicing in the interval time= (WR_STARVE_CYC+1) x (BASE_STARVE_CYC+1)
Exists: TAG &gt;= 2.0.5.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_STARVE_CYC</name>
              <description>The timeout of read slot would be set when read cmd is no servicing in the interval time= (RD_STARVE_CYC+1) x (BASE_STARVE_CYC+1)
Exists: TAG &gt;= 2.0.5.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDEX_CTRL0</name>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <description>PDEX Control Register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDE_CMD0</name>
              <description>Indicate the [3-0] byte of SPI PDE command value.
Exists: TAG &gt;= 2.0.5.
Available only if configuration of SPI_PDEX_ENABLE is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDEX_CTRL1</name>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <description>PDEX Control Register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDE_CMD1</name>
              <description>Indicate the [7-4] byte of SPI PDE command value.
Exists: TAG &gt;= 2.0.5.
Available only if configuration of SPI_PDEX_ENABLE is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDEX_CTRL2</name>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <description>PDEX Control Register 2</description>
          <resetValue>0x10010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDE_CMD_LEN</name>
              <description>Indicate the SPI PDE command length.
The PDE command length indicates the valid command in PDE_CMD0 and PDE_CMD1
Exists: TAG &gt;= 2.0.5.
Available only if configuration of SPI_PDEX_ENABLE is defined.</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDX_CMD_LEN</name>
              <description>Indicate the SPI PDX command length.
The PDE command length indicates the valid command in PDX_CMD.
If device is PSRAM, the equation is CR_PDX_CMD_LEN = (SPIC_CLK_FRQ * tXDPD)/1000. (SPIC_CLK_FRQ unit is MHz, tXDPD unit is ns)
Exists: TAG &gt;= 2.0.5.
Available only if configuration of SPI_PDEX_ENABLE is defined.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDX_CMD</name>
              <description>Indicate the [1-0] byte of SPI PDX command value.
If device is PSRAM, PDX command value is not care.
Exists: TAG &gt;= 2.0.5.
Available only if configuration of SPI_PDEX_ENABLE is defined.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR2</name>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <description>Timing Parameters Register 2</description>
          <resetValue>0x00000604</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDX_CS_H_CNT</name>
              <description>Indicate the time of cs required keep high after PDX
The expression of PDX_CS_H_CNT is following
PDX_CYCLE_NUM = SPIC_CLK_FRQ * tDP (unit of SPIC_CLK_FRQ is MHz, and tDP is us).
If 768&gt;=PDX_CYCLE_NUM &gt; 0, CR_PDX_CS_H_CNT = ceil (PDE_CYCLE_NUM/256).
If 15872&gt;=PDX_CYCLE_NUM &gt; 768, CR_PDX_CS_H_CNT = ceil (PDE_CYCLE_NUM/512).
If 524288&gt;=PDX_CYCLE_NUM &gt; 15872, CR_PDX_CS_H_CNT = ceil (PDE_CYCLE_NUM/16384) + 31. 
Ex: SPIC_CLK_FRQ = 400MHz, tDP = 100us, so PDX_CYCLE_NUM = 400*100=40000
524288 &gt;= 40000 &gt; 15872, so CR_PDX_CS_H_CNT = ceil(40000/512) + 31= 3+31 = 34.
Exists: TAG &gt;= 2.0.5.
Available only if configuration of SPI_PDEX_ENABLE is defined.</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDE_CS_H_CNT</name>
              <description>Indicate the time of cs required keep high after PDE
The expression of PDE_CS_H_CNT is following
PDE_CYCLE_NUM = SPIC_CLK_FRQ * tDP ( unit of SPIC_CLK_FRQ is MHz, and tDP is us).
If 768&gt;=PDX_CYCLE_NUM &gt; 0, CR_PDX_CS_H_CNT = ceil (PDE_CYCLE_NUM/256).
If 15872&gt;=PDX_CYCLE_NUM &gt; 768, CR_PDX_CS_H_CNT = ceil (PDE_CYCLE_NUM/512).
If 524288&gt;=PDX_CYCLE_NUM &gt; 15872, CR_PDX_CS_H_CNT = ceil (PDE_CYCLE_NUM/16384) + 31. 
Ex: SPIC_CLK_FRQ = 400MHz, tDP = 100us, so PDX_CYCLE_NUM = 400*100=40000
524288 &gt;= 40000 &gt; 15872, so CR_PDX_CS_H_CNT = ceil(40000/512) + 31= 3+31 = 34.
Exists: TAG &gt;= 2.0.5.
Available only if configuration of SPI_PDEX_ENABLE is defined.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICG_EN</name>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <description>Clock gating enable control register</description>
          <resetValue>0x00001FFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CGATE_EN_ECC</name>
              <description>Nand ECC controller module clock gating enable.
Exists: TAG &gt;= 2.0.11</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_WRCR</name>
              <description>Write cr module clock gating enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_BPGM_CR</name>
              <description>bpgm_cr module clock gating enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_BPGM</name>
              <description>bpgm module clock gating enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_PDEX</name>
              <description>pdex module clock gating enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_ATCK</name>
              <description>atck module clock gating enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_FRQC</name>
              <description>frqc module clock gating enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_ATRD</name>
              <description>Auto read module clock gating enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_ATWR</name>
              <description>Auto write module clock gating enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_USRD</name>
              <description>User read module clock gating enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_USWR</name>
              <description>User write module clock gating enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_NATIVE</name>
              <description>Native chop module clock gating enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGATE_EN_BOOT</name>
              <description>Boot module clock gating enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WBUF_ID</name>
          <addressOffset>0x0000015C</addressOffset>
          <size>32</size>
          <description>WBUF ID control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WBID_MSK</name>
              <description>WBID_ORI bit mask.
0: Interrupt bit is masked.
1: Interrupt bit enable.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WBID_ORI</name>
              <description>Indicate the awid prior mask are able to push to WBUF in write buffer function.
Example: 
If awid = 0x80 ~ 0x8f are able to push to WBUF. 
Set WBID_ORI = 0x80
Set WBID_MSK = 0xfff0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
