Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>DCX_CTRL</name>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <description>LCDC DCX control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_CTRL</name>
              <description>This field can only be active when DATA_CTRL_BIT is not 0.
0: only one DCX control bit in data phase;
1: DCX control bit for each byte in data phase;
2: DCX control bit for every 2-byte in data phase;
3: DCX control bit for every 4-byte in data phase;
4: DCX control bit for every 8-byte in data phase;
5: DCX control bit for every 16-byte in data phase;</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_CTRL_BIT</name>
              <description>DCX control bit for data phase.
0: independent DCX signal
1: DCX control bit = 1-bit;
2: DCX control bit = 2 bit;
3: DCX control bit = 4-bit;
4: DCX control bit = 8-bit;
5: DCX control bit = 16-bit;</description>
              <bitRange>[20:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_TAIL_EN</name>
              <description>0: without tail in data phase
1: insert tail in data phase</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_HEAD_EN</name>
              <description>0: without header in data phase
1: insert header in data phase</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR_CTRL</name>
              <description>This field can only be active when ADDR_CTRL_BIT is not 0.
0: only one DCX control bit in addr phase;
1: DCX control bit for each byte in addr phase;
2: DCX control bit for every 2-byte in addr phase;
3: DCX control bit for every 4-byte in addr phase;
4: DCX control bit for every 8-byte in addr phase;
5: DCX control bit for every 16-byte in addr phase;</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR_CTRL_BIT</name>
              <description>DCX control bit for addr phase.
0: independent DCX signal
1: DCX control bit = 1-bit;
2: DCX control bit = 2 bit;
3: DCX control bit = 4-bit;
4: DCX control bit = 8-bit;
5: DCX control bit = 16-bit;</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR_TAIL_EN</name>
              <description>0: without tail in address phase
1: insert tail in address phase</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR_HEAD_EN</name>
              <description>0: without header in address phase
1: insert header in address phase</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_CTRL</name>
              <description>This field can only be active when CMD_CTRL_BIT is not 0.
0: only one DCX control bit in cmd phase;
1: DCX control bit for each byte in cmd phase;
2: DCX control bit for every 2-byte in cmd phase;
3: DCX control bit for every 4-byte in cmd phase;
4: DCX control bit for every 8-byte in cmd phase;
5: DCX control bit for every 16-byte in cmd phase;</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_CTRL_BIT</name>
              <description>DCX control bit for cmd phase.
0: independent DCX signal
1: DCX control bit = 1-bit;
2: DCX control bit = 2 bit;
3: DCX control bit = 4-bit;
4: DCX control bit = 8-bit;
5: DCX control bit = 16-bit;</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_TAIL_EN</name>
              <description>0: without tail in cmd phase
1: insert tail in cmd phase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_HEAD_EN</name>
              <description>0: without header in cmd phase
1: insert header in cmd phase</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCX_CMD</name>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <description>LCDC cmd phase DCX control bit value register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMD_TAIL_VAL</name>
              <description>Value of DCX tail control bit in cmd phase.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_HEAD_VAL</name>
              <description>Value of DCX header control bit in cmd phase.
In 4-wire format cmd phase, spi_dcx = CMD_HEAD_VAL[0].</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCX_ADDR</name>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <description>LCDC address phase DCX control bit value register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_TAIL_VAL</name>
              <description>Value of DCX tail control bit in address phase.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR_HEAD_VAL</name>
              <description>Value of DCX header control bit in address phase.
In 4-wire format address phase, spi_dcx = ADDR_HEAD_VAL[0].</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCX_DATA</name>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <description>LCDC data phase DCX control bit value register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_TAIL_VAL</name>
              <description>Value of DCX tail control bit in data phase.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_HEAD_VAL</name>
              <description>Value of DCX header control bit in data phase.
In 4-wire format data phase, spi_dcx = DATA_HEAD_VAL[0].</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_CTRL0</name>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <description>NAND ECC control Register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PAGE_ADDR</name>
              <description>NAND Page address setting. 
Exists: TAG &gt;= 2.0.11</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGE_CMD</name>
              <description>NAND page command setting.
Ex.
READ: Page Data Read (13h)
WRITE: Page Execute (10h)
Exists: TAG &gt;= 2.0.11</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_CTRL1</name>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <description>NAND ECC control Register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_CMD</name>
              <description>NAND data command setting.
Ex.
READ: Read data (03h)
WRITE: Load Program Data (02h)
Exists: TAG &gt;= 2.0.11</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR0</name>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <description>Status Data Register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR0</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR1</name>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <description>Status Data Register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR1</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR2</name>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <description>Status Data Register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR2</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR3</name>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <description>Status Data Register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR3</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR4</name>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <description>Status Data Register 4</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR4</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR5</name>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <description>Status Data Register 5</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR5</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR6</name>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <description>Status Data Register 6</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR6</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR7</name>
          <addressOffset>0x0000019C</addressOffset>
          <size>32</size>
          <description>Status Data Register 7</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR7</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR8</name>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <description>Status Data Register 8</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR8</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR9</name>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <description>Status Data Register 9</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR9</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR10</name>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <description>Status Data Register 10</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR10</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR11</name>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <description>Status Data Register 11</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR11</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR12</name>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <description>Status Data Register 12</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR12</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR13</name>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <description>Status Data Register 13</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR13</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR14</name>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <description>Status Data Register 14</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR14</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_DR15</name>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <description>Status Data Register 15</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_DR15</name>
              <description>It is a data buffer with 8-bit width FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STFLR</name>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <description>Status FIFO level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STFLR</name>
              <description>Status FIFO level. Indicates the FIFO entries of valid data in status data.
Note: Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAGE_READ</name>
          <addressOffset>0x000001D0</addressOffset>
          <size>32</size>
          <description>Page Read Command of NAND Flash</description>
          <resetValue>0x000C000D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PAGE_RD_ADDR_LEN</name>
              <description>Indicates number of bytes in address phase in page read command.
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGE_RD_CH</name>
              <description>Indicates channel number of command and address phase in transmitting page read command.
0: single channel
1: dual channels
2: quad channels
3: octal channel
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGE_RD_CMD</name>
              <description>Indicates SPI Flash command value of page read command
Available only if configuration of NAND_EN is defined.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_BASE_0</name>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <description>SEC region 0 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_BASE0</name>
              <description>SEC region 0 base address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_END_0</name>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <description>SEC region 0 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_END0</name>
              <description>SEC region 0 end address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R0_MODE</name>
              <description>SEC region 0 - function mode/seed selection.
Select one of mode/seed from SEC_NONCE0~SEC_NONCE7</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_R0_EN</name>
              <description>Set to enable SEC region 0 to scramble write data and descramble read data.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_NONCE_0</name>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <description>SEC region 0 nonce register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_NONCE0</name>
              <description>Only present if SEC_CONF_MODE &gt; 0.
Seed of scrambler mode 0.
This register value cannot be 0, otherwise the encrypted data will be equal to the original data.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_BASE_1</name>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <description>SEC region 1 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_BASE1</name>
              <description>SEC region 1 base address[31:12].
This is 4KB aligned address.
Note: Available only if configuration of PSRAM_EN is defined.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
