Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI0_REG</name>
      <groupName>SPI</groupName>
      <baseAddress>0x41885000</baseAddress>
      <size>0x00000B0C</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000B0C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLR0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Control Register 0</description>
          <resetValue>0x00000009</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SS_T</name>
              <description>When SCPH is 0 (Relevant only when the SPI is configured as a serial-master device)
0: ss_n_out doesn't toggle between successive frames
1: ss_n_out does toggle between successive frames</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBITSWAP</name>
              <description>0: Order of receive bit doesn't swap
1: Order of receive bit does swap</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBYTESWAP</name>
              <description>0: Order of receive byte doesn't swap
1: Order of receive byte does swap</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBITSWAP</name>
              <description>0: Order of transmit bit doesn't swap
1: Order of transmit bit does swap</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBYTESWAP</name>
              <description>0: Order of transmit byte doesn't swap
1: Order of transmit byte does swap</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSF_EN</name>
              <description>CS Force Control Enable. Relevant only when the SPI is configured as a serial-master device. This bit field enable SPI to force CS signal keep low until the amount of data bits (DFS * NDF) had been sent/received. SPI master will force the CS signal low even when the TX FIFO is empty during transmission. 
0: CS Force Control is disabled.
1: CS Force Control is enabled.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLV_OE</name>
              <description>Slave Output Enable. Relevant only when the SPI is configured as a serial-slave device. When configured as a serial master, this bit field has no functionality. This bit enables or disables the setting of the ssi_oe_n output from the SPI serial slave. 
When SLV_OE = 1, the ssi_oe_n output can never be active. When the ssi_oe_n output controls the tri-state buffer on the txd output from the slave, a high impedance state is always present on the slave txd output when SLV_OE = 1.
This is useful when the master transmits in broadcast mode (master transmits data to all slave devices). Only one slave may respond with data on the master rxd line. This bit is enabled after reset and must be disabled by software (when broadcast mode is used), if you do not want this device to respond with data.
0: Slave txd is enabled
1: Slave txd is disabled</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TMOD</name>
              <description>Transfer Mode. Relevant only when the SPI is configured as a serial-master device. Selects the mode of transfer for serial communication. This field does not affect the transfer duplicity. Only indicates whether the receive or transmit data are valid. 
In transmit-only mode, data received from the external device is not valid and is not stored in the receive FIFO memory; it is overwritten on the next transfer.
In receive-only mode, transmitted data are not valid. After the first write to the transmit FIFO, the same word is retransmitted for the duration of the transfer.
In transmit-and-receive mode, both transmit and receive data are valid. The transfer continues until the transmit FIFO is empty. Data received from the external device are stored into the receive FIFO memory, where it can be accessed by the host processor.
00: Transmit &amp; Receive
01: Transmit Only
10: Receive Only</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCPOL</name>
              <description>Serial Clock Polarity. Valid when the frame format (FRF) is set to Motorola SPI. Used to select the polarity of the inactive serial clock, which is held inactive when the SPI master is not actively transferring data on the serial bus.
0: Inactive state of serial clock is low
1: Inactive state of serial clock is high</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCPH</name>
              <description>Serial Clock Phase. Valid when the frame format (FRF) is set to Motorola SPI. The serial clock phase selects the relationship of the serial clock with the slave select signal.
When SCPH = 0, data are captured on the first edge of the serial clock. When SCPH = 1, the serial clock starts toggling one cycle after the slave select line is activated, and data are captured on the second edge of the serial clock.
0: Serial clock toggles in middle of the first data bit
1: Serial clock toggles at start of the first data bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRF</name>
              <description>Frame Format. Selects which serial protocol transfers the data.
00: Motorola SPI
Other: Reserved</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DFS</name>
              <description>Data Frame Size. Selects the data frame length. When the data frame size is programmed to be less than 16 bits, the receive data are automatically right-justified by the receive logic, with the upper bits of the receive FIFO zero-padded.
You must right-justify transmit data before writing into the transmit FIFO. The transmit logic ignores the upper unused bits when transmitting the data. For the DFS decode, refer to the following description:
0000/0001/0010: Reserved (undefined operation)
0011: 4-bit serial data transfer
0100: 5-bit serial data transfer
0101: 6-bit serial data transfer
0110: 7-bit serial data transfer
0111: 8-bit serial data transfer
1000: 9-bit serial data transfer
1001: 10-bit serial data transfer
1010: 11-bit serial data transfer
1011: 12-bit serial data transfer
1100: 13-bit serial data transfer
1101: 14-bit serial data transfer
1110: 15-bit serial data transfer
1111: 16-bit serial data transfer</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLR1</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Control Register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NDF</name>
              <description>Number of Data Frames. When TMOD = 10 or TMOD = 11, this register field sets the number of data frames to be continuously received by the SPI. The SPI continues to receive serial data until the number of data frames received is equal to this register value plus 1, which enables you to receive up to 64 KB of data in a continuous transfer.
When the SPI is configured as a serial slave, the transfer continues for as long as the slave is selected. Therefore, this register serves no purpose and is not present when the SPI is configured as a serial slave.
When CFS_EN is enabled, this bit field will be taken by SPI master to calculate the amount of data bits for all TMOD.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIENR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>SSI Enable Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSI_EN</name>
              <description>SPI Enable. Enables and disables all SPI operations. When disabled, all serial transfers are halted immediately. Transmit and receive FIFO buffers are cleared when the device is disabled. It is impossible to program some of the SPI control registers when enabled. When disabled, the ssi_sleep output is set (after delay) to inform the system that it is safe to remove the ssi_clk, thus saving power consumption in the system.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SER</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Slave Enable Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SER</name>
              <description>Slave Select Enable Flag. When this bit is set (1), the corresponding slave select line from the master is activated when a serial transfer begins. It should be noted that setting or clearing bits in this register have no effect on the corresponding slave select outputs until a transfer is started. Before beginning a transfer, you should enable the bit in this register that corresponds to the slave device with which the master wants to communicate.
1: Selected
0: Not selected</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUDR</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>Baud Rate Select</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCKDV</name>
              <description>SPI Clock Divider. The LSB for this field is always set to 0 and is unaffected by a write operation, which ensures an even value is held in this register. If the value is 0, the serial output clock (sclk_out) is disabled. The frequency of the sclk_out is derived from the  equation: Fsclk_out =Fssi_clk/SCKDV, where SCKDV is any even value between 2 and 65534.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFTLR</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>Transmit FIFO Threshold Level</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TFT</name>
              <description>Transmit FIFO Threshold. Controls the level of entries (or below) at which the transmit FIFO controller triggers an interrupt. The FIFO depth is 64; this register is sized to the number of address bits needed to access the FIFO.
If you attempt to set this value greater than or equal to the depth of the FIFO, this field is not written and retains its current value. When the number of transmit FIFO entries is less than or equal to this value, the transmit FIFO empty interrupt is triggered. For TFT decode, refer to the following description:
000000: ssi_txe_intr is asserted when 0 data entry is present in transmit FIFO.
000001: ssi_txe_intr is asserted when 1 data entry is present in transmit FIFO.
000010: ssi_txe_intr is asserted when 2 data entries are present in transmit FIFO.
000011: ssi_txe_intr is asserted when 3 data entries are present in transmit FIFO.
...
111100: ssi_txe_intr is asserted when 60 data entries are present in transmit FIFO.
111101: ssi_txe_intr is asserted when 61 data entries are present in transmit FIFO.
111110: ssi_txe_intr is asserted when 62 data entries are present in transmit FIFO.
111111: ssi_txe_intr is asserted when 63 data entries are present in transmit FIFO.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFTLR</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>Receive FIFO Threshold Level</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFT</name>
              <description>Receive FIFO Threshold. Controls the level of entries (or above) at which the receive FIFO controller triggers an interrupt. The FIFO depth is configurable in the range 2~64. This register is sized to the number of address bits needed to access the FIFO. If you attempt to set this value greater than the depth of the FIFO, this field is not written and retains its current value.
When the number of receive FIFO entries is greater than or equal to this value + 1, the receive FIFO full interrupt is triggered. For RFT decode, refer to the following description:
000000: ssi_rxf_intr is asserted when 1 or more data entries are present in receive FIFO.
000001: ssi_rxf_intr is asserted when 2 or more data entries are present in receive FIFO.
000010: ssi_rxf_intr is asserted when 3 or more data entries are present in receive FIFO.
000011: ssi_rxf_intr is asserted when 4 or more data entries are present in receive FIFO.
...
111110: ssi_rxf_intr is asserted when 61 or more data entries are present in receive FIFO.
111101: ssi_rxf_intr is asserted when 62 or more data entries are present in receive FIFO.
111110: ssi_rxf_intr is asserted when 63 or more data entries are present in receive FIFO.
111111: ssi_rxf_intr is asserted when 64 or more data entries are present in receive FIFO.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFLR</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>Transmit FIFO Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTFL</name>
              <description>Transmit FIFO Level. Contains the number of valid data entries in the transmit FIFO.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFLR</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>Receive FIFO Level Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTFL</name>
              <description>Receive FIFO Level. Contains the number of valid data entries in the receive FIFO.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>Status Register</description>
          <resetValue>0x00000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOL</name>
              <description>Data Collision Error. Relevant only when the SPI is configured as a master device. This bit is set if the SPI master is actively transmitting when another master selects this device as a slave. This informs the processor that the last data transfer was halted before completion. This bit is cleared when read.
0: No error
1: Transmit data collision error</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>Transmission Error. Set if the transmit FIFO is empty when a transfer is started. This bit can be set only when the SPI is configured as a slave device. Data from the previous transmission is resent on the txd line. This bit is cleared when read.
0: No error
1: Transmission error</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RFF</name>
              <description>Receive FIFO Full. When the receive FIFO is completely full, this bit is set. When the receive FIFO contains one or more empty location, this bit is cleared.
0: Receive FIFO is not full
1: Receive FIFO is full</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RFNE</name>
              <description>Receive FIFO Not Empty. Set when the receive FIFO contains one or more entries and is cleared when the receive FIFO is empty. This bit can be polled by software to completely empty the receive FIFO.
0: Receive FIFO is empty
1: Receive FIFO is not empty</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit FIFO Empty. When the transmit FIFO is completely empty, this bit is set. When the transmit FIFO contains one or more valid entries, this bit is cleared. This bit field does not request an interrupt.
0: Transmit FIFO is not empty
1: Transmit FIFO is empty</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFNF</name>
              <description>Transmit FIFO Not Full. Set when the transmit FIFO contains one or more empty locations, and is cleared when the FIFO is full.
0: Transmit FIFO is full
1: Transmit FIFO is not full</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>SSI Busy Flag. When set, indicates that a serial transfer is in progress; when cleared indicates that the SPI is idle or disabled.
0: SPI is idle or disabled
1: SPI is actively transferring data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>Interrupt Mask Register</description>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSRIM</name>
              <description>SS_N Rising Edge Detect Interrupt Mask. This bit field is present only if the SPI is configured as a serial-slave device.
0: ssi_ssr_intr is masked
1: ssi_ssr_intr is not masked</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUIM</name>
              <description>Transmit FIFO Underflow Interrupt Mask. This bit field is present only if the SPI is configured as a serial-slave device.
0: ssi_txu_intr is masked
1: ssi_txu_intr is not masked</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MSTIM_FAEIM</name>
              <description>When SPI is configured as serial-master, this bit field is present as Multi-Master Contention Interrupt Mask.
0: ssi_mst_intr interrupt is masked
1: ssi_mst_intr interrupt is not masked
When SPI is configured as serial-slave, this bit field is present as Frame Alignment Interrupt Mask. 
0: ssi_fae_intr interrupt is masked
1: ssi_fae_intr interrupt is not masked</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIM</name>
              <description>Receive FIFO Full Interrupt Mask.
0: ssi_rxf_intr interrupt is masked
1: ssi_rxf_intr interrupt is not masked</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOIM</name>
              <description>Receive FIFO Overflow Interrupt Mask.
0: ssi_rxo_intr interrupt is masked
1: ssi_rxo_intr interrupt is not masked</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXUIM</name>
              <description>Receive FIFO Underflow Interrupt Mask.
0: ssi_rxu_intr interrupt is masked
1: ssi_rxu_intr interrupt is not masked</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXOIM</name>
              <description>Transmit FIFO Overflow Interrupt Mask.
0: ssi_txo_intr interrupt is masked
1: ssi_txo_intr interrupt is not masked</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEIM</name>
              <description>Transmit FIFO Empty Interrupt Mask.
0: ssi_txe_intr interrupt is masked
1: ssi_txe_intr interrupt is not masked</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
