Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>ISR</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSRIS</name>
              <description>SS_N Rising Edge Detect Interrupt Status. This bit field is present only if the SPI is configured as a serial-slave device.
0: ssi_ssr_intr interrupt is not active after masking
1: ssi_ssr_intr interrupt is active after masking</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXUIS</name>
              <description>Transmit FIFO Under Flow Interrupt Status. This bit field is present only if the SPI is configured as a serial-slave device.
0: ssi_txu_intr interrupt is not active after masking
1: ssi_txu_intr interrupt is active after masking</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MSTIS_FAEIS</name>
              <description>When SPI is configured as serial-master, this bit field is present as Multi-Master Contention Interrupt Status.
0: ssi_mst_intr interrupt is not active after masking
1: ssi_mst_intr interrupt is active after masking
When SPI is configured as serial-slave, this bit field is present as Frame Alignment Interrupt Status. 
0: ssi_fae_intr interrupt not active after masking
1: ssi_fae_intr interrupt is active after masking</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIS</name>
              <description>Receive FIFO Full Interrupt Status.
0: ssi_rxf_intr interrupt is not active after masking
1: ssi_rxf_intr interrupt is full after masking</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXOIS</name>
              <description>Receive FIFO Overflow Interrupt Status.
0: ssi_rxo_intr interrupt is not active after masking
1: ssi_rxo_intr interrupt is active after masking</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXUIS</name>
              <description>Receive FIFO Underflow Interrupt Status.
0: ssi_rxu_intr interrupt is not active after masking
1: ssi_rxu_intr interrupt is active after masking</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXOIS</name>
              <description>Transmit FIFO Overflow Interrupt Status.
0: ssi_txo_intr interrupt is not active after masking
1: ssi_txo_intr interrupt is active after masking</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXEIS</name>
              <description>Transmit FIFO Empty Interrupt Status.
0: ssi_txe_intr interrupt is not active after masking
1: ssi_txe_intr interrupt is active after masking</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RISR</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>Raw Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSRIR</name>
              <description>SS_N Rising Edge Detect Raw Interrupt Status. This bit field is present only if the SPI is configured as a serial-slave device.
0: ssi_ssr_intr interrupt is not active prior to masking
1: ssi_ssr_intr interrupt is active prior to masking</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXUIR</name>
              <description>Transmit FIFO Under Flow Raw Interrupt Status. This bit field is present only if the SPI is configured as a serial-slave device.
0: ssi_txu_intr interrupt is not active prior to masking
1: ssi_txu_intr interrupt is active prior to masking</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MSTIR_FAEIR</name>
              <description>When SPI is configured as serial-master, this bit field is present as Multi-Master Contention Raw Interrupt Status.
0: ssi_mst_intr interrupt is not active prior to masking
1: ssi_mst_intr interrupt is active prior to masking
When SPI is configured as serial-slave, this bit field is present as Frame Alignment Error Raw Interrupt Status.
0: ssi_fae_intr interrupt not active prior to masking
1: ssi_fae_intr interrupt is active prior to masking</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIR</name>
              <description>Receive FIFO Full Raw Interrupt Status.
0: ssi_rxf_intr interrupt is not active prior to masking
1: ssi_rxf_intr interrupt is active prior to masking</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXOIR</name>
              <description>Receive FIFO Overflow Raw Interrupt Status.
0: ssi_rxo_intr interrupt is not active prior to masking
1: ssi_rxo_intr interrupt is active prior to masking</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXUIR</name>
              <description>Receive FIFO Underflow Raw Interrupt Status.
0: ssi_rxu_intr interrupt is not active prior to masking
1: ssi_rxu_intr interrupt is active prior to masking</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXOIR</name>
              <description>Transmit FIFO Overflow Raw Interrupt Status.
0: ssi_txo_intr interrupt is not active prior to masking
1: ssi_txo_intr interrupt is active prior to masking</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXEIR</name>
              <description>Transmit FIFO Empty Raw Interrupt Status.
0: ssi_txe_intr interrupt is not active prior to masking
1: ssi_txe_intr interrupt is active prior to masking</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXOICR</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>Transmit FIFO Overflow Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXOICR</name>
              <description>Clear Transmit FIFO Overflow Interrupt. This register reflects the status of the interrupt. A read from this register clears the ssi_txo_intr interrupt; writing has no effect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXOICR</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>Receive FIFO Overflow Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXOICR</name>
              <description>Clear Receive FIFO Overflow Interrupt. This register reflects the status of the interrupt. A read from this register clears the ssi_rxo_intr interrupt; writing has no effect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXUICR</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Receive FIFO Underflow Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXUICR</name>
              <description>Clear Receive FIFO Underflow Interrupt. This register reflects the status of the interrupt. A read from this register clears the ssi_rxu_intr interrupt; writing has no effect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSTICR_FAEICR</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Multi-Master &amp; Frame Alignment Error Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSTICR_FAEICR</name>
              <description>Multi-Master Interrupt Clear Register/Frame Alignment Error Interrupt Clear Register.
When SPI is configured as serial-master, this bit field is used to Clear Multi-Master Contention Interrupt. A read from this register clears the ssi_mst_intr interrupt; writing has no effect.
When SPI is configured as serial-slave, this bit field is used to Clear Frame Alignment Interrupt. A read from this register clears the ssi_fae_intr interrupt; writing has no effect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICR</name>
              <description>Clear Interrupt. This register is set if any of the interrupts below are active. A read clears the ssi_txo_intr, ssi_rxu_intr, ssi_rxo_intr, and the ssi_mst_intr/ssi_fae_intr interrupts. Writing to this register has no effect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACR</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>DMA Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDMAE</name>
              <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel.
0: Transmit DMA disabled
1: Transmit DMA enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDMAE</name>
              <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel
0: Receive DMA disabled
1: Receive DMA enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATDLR</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>DMA Transmit Data Level</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMATDL</name>
              <description>Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1. For DMATDL decode, refer to the following description:
000000: dma_tx_req is asserted when 0 data entry is present in transmit FIFO.
000001: dma_tx_req is asserted when 1 data entry is present in transmit FIFO.
000010: dma_tx_req is asserted when 2 data entries are present in transmit FIFO.
000011: dma_tx_req is asserted when 3 data entries are present in transmit FIFO.
...
111100: dma_tx_req is asserted when 60 data entries are present in transmit FIFO.
111101: dma_tx_req is asserted when 61 data entries are present in transmit FIFO.
111110: dma_tx_req is asserted when 62 data entries are present in transmit FIFO.
111111: dma_tx_req is asserted when 63 data entries are present in transmit FIFO.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARDLR</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>DMA Receive Data Level</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMARDL</name>
              <description>Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or above this field value + 1, and RDMAE=1. For DMARDL decode, refer to the following description:
000000: dma_rx_req is asserted when 1 or more data entries are present in transmit FIFO.
000001: dma_rx_req is asserted when 2 or more data entries are present in transmit FIFO.
000010: dma_rx_req is asserted when 3 or more data entries are present in transmit FIFO.
000011: dma_rx_req is asserted when 4 or more data entries are present in transmit FIFO.
...
111100: dma_rx_req is asserted when 61 or more data entries are present in transmit FIFO.
111101: dma_rx_req is asserted when 62 or more data entries are present in transmit FIFO.
111110: dma_rx_req is asserted when 63 or more data entries are present in transmit FIFO.
111111: dma_rx_req is asserted when 64 data entries are present in transmit FIFO.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXUICR</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>Transmit FIFO Underflow Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXUICR</name>
              <description>When SPI is configured as serial-slave, this register is used to Clear Transmit FIFO Underflow Interrupt. This register reflects the status of the interrupt. A read from this register clears the ssi_txu_intr interrupt; writing has no effect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSRICR</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>SS_N Rising Edge Detect Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSRICR</name>
              <description>When SPI is configured as serial-slave, this register is used to Clear SS_N Rinsing Edge Detect Interrupt. This register reflects the status of the interrupt. A read from this register clears the ssi_ssr_intr interrupt; writing has no effect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR0</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>Data Register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR0</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR1</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>Data Register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR1</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR2</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>Data Register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR2</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR3</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>Data Register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR3</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR4</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>Data Register 4</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR4</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR5</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>Data Register 5</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR5</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR6</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description>Data Register 6</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR6</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR7</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>Data Register 7</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR7</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR8</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>Data Register 8</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR8</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR9</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>Data Register 9</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR9</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
