Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>DR10</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>Data Register 10</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR10</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR11</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>Data Register 11</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR11</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR12</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>Data Register 12</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR12</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR13</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>Data Register 13</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR13</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR14</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description>Data Register 14</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR14</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR15</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description>Data Register 15</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR15</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR16</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description>Data Register 16</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR16</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR17</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description>Data Register 17</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR17</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR18</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description>Data Register 18</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR18</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR19</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description>Data Register 19</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR19</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR20</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description>Data Register 20</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR20</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR21</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description>Data Register 21</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR21</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR23</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description>Data Register 23</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR23</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR24</name>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <description>Data Register 24</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR24</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR25</name>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <description>Data Register 25</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR25</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR26</name>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <description>Data Register 26</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR26</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR27</name>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <description>Data Register 27</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR27</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR28</name>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <description>Data Register 28</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR28</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR29</name>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <description>Data Register 29</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR29</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR30</name>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <description>Data Register 30</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR30</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR31</name>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <description>Data Register 31</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR31</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR32</name>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <description>Data Register 32</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR32</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR33</name>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <description>Data Register 33</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR33</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR34</name>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <description>Data Register 34</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR34</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR35</name>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <description>Data Register 35</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR35</name>
              <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.
Read: Receive FIFO buffer
Write: Transmit FIFO buffer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_SAMPLE_DLY</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description>rxd Sample Delay Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSD</name>
              <description>Receive Data (rxd) Sample Delay. This register is used to delay the sample of the rxd input signal. Each value represents a single ssi_clk delay on the sample of the rxd signal.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DUMMY</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description>SPI Dummy Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>rsvd for hw</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
