Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC1_TIMER_REG</name>
      <groupName>PMCTIMER</groupName>
      <baseAddress>0x41007000</baseAddress>
      <size>0x00000034</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000034</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TIM_EN</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>TIM enable register</description>
          <resetValue>0x00000F0F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>reset_timer3</name>
              <description>Writing 1 will cause a pulse reset timer1. Please wait for 3 work clk before  new timer configuration
1: valid
0: not valid</description>
              <bitRange>[31:31]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>reset_timer2</name>
              <description>Writing 1 will cause a pulse reset timer1. Please wait for 3 work clk before  new timer configuration
1: valid
0: not valid</description>
              <bitRange>[30:30]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>reset_timer1</name>
              <description>Writing 1 will cause a pulse reset timer1. Please wait for 3 work clk before  new timer configuration
1: valid
0: not valid</description>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>reset_timer0</name>
              <description>Writing 1 will cause a pulse reset timer0. Please wait for 3 work clk before  new timer configuration
1: valid
0: not valid</description>
              <bitRange>[28:28]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>config_valid_timer3</name>
              <description>TIM_SET configuration valid or not. 
1: valid
0: not valid
if compare option enable,
1: vaild value is seted
0: set option is on going</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>config_valid_timer2</name>
              <description>TIM_SET configuration valid or not
1: valid
0: not valid</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>config_valid_timer1</name>
              <description>TIM_SET configuration valid or not
1: valid
0: not valid</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>config_valid_timer0</name>
              <description>TIM_SET configuration valid or not
1: valid
0: not valid</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cnt_start_timer3</name>
              <description>enable the timer3 counter.
1:enable
0:disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cnt_start_timer2</name>
              <description>enable the timer2 counter.
1:enable
0:disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cnt_start_timer1</name>
              <description>enable the timer1 counter.
1:enable
0:disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cnt_start_timer0</name>
              <description>enable the timer0 counter.
1:enable
0:disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_DIER</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>TIM interupt enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>uie_timer3</name>
              <description>1: enable update interrupt
0: disable update interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uie_timer2</name>
              <description>1: enable update interrupt
0: disable update interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uie_timer1</name>
              <description>1: enable update interrupt
0: disable update interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uie_timer0</name>
              <description>1: enable update interrupt
0: disable update interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_ISR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>TIM interrupt status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>isr_timer3</name>
              <description>Timer interrupt status
0: no interrupt
1: interrupt occurs
Write 1 to clear interrupts in interrupt handler.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_timer2</name>
              <description>Timer interrupt status
0: no interrupt
1: interrupt occurs
Write 1 to clear interrupts in interrupt handler.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_timer1</name>
              <description>Timer interrupt status
0: no interrupt
1: interrupt occurs
Write 1 to clear interrupts in interrupt handler.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>isr_timer0</name>
              <description>Timer interrupt status
0: no interrupt
1: interrupt occurs
Write 1 to clear interrupts in interrupt handler.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_CNT0</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>TIM counter0</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cnt0</name>
              <description>counter value, counter will stop automatically when it counts down to zero.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_CNT1</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>TIM counter1</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cnt1</name>
              <description>counter value, counter will stop automatically when it counts down to zero.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_CNT2</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>TIM counter2</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cnt2</name>
              <description>counter value, counter will stop automatically when it counts down to zero.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_CNT3</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>TIM counter3</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cnt3</name>
              <description>counter value, counter will stop automatically when it counts down to zero.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_SET0</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>TIM set register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tim_set0</name>
              <description>Set a countdown value.
This value come into force when TIM_EN register bit is enabled. counter will count down from this value immediately.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_SET1</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>TIM set register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tim_set1</name>
              <description>Set a countdown value.
This value come into force when TIM_EN register bit is enabled. counter will count down from this value immediately.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_SET2</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>TIM set register2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tim_set2</name>
              <description>Set a countdown value.
This value come into force when TIM_EN register bit is enabled. counter will count down from this value immediately.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_SET3</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>TIM set register3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tim_set3</name>
              <description>Set a countdown value.
This value come into force when TIM_EN register bit is enabled. counter will count down from this value immediately.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_com_en</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>TIM  compare register</description>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>com_en</name>
              <description>enable compare option.The set cnt value takes effect only when it is greater than the actual cnt value
0:disable
1:enable
[0] : control tim0 set
......
[3]: control tim3 set</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCTIM_DUMMY</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>PMCTimer Dummy Register</description>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
