Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMER2_REG</name>
      <groupName>TIMERBASIC</groupName>
      <baseAddress>0x41008400</baseAddress>
      <size>0x00000028</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000028</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TIM_EN</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>TIM enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cnt_en</name>
              <description>counter working status
* 0: counter is stoppped
* 1: counter is working</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cnt_run</name>
              <description>counter run status
* 0: counter is disabled
* 1: counter is enabled</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cnt_stop</name>
              <description>disable the counter. Poll CNT_RUN to see the counter status. If CNT_RUN is 0, it means that the counter has been disabled internally.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>cnt_start</name>
              <description>enable the counter.  Poll CNT_RUN to see the counter status. If CNT_RUN is 1, it means that the counter has been enabled internally.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_CR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>TIM control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARPE</name>
              <description>enable auto-reload preloading
* 0: TIM_ARR register is not buffered
* 1: TIM_ARR register is buffered</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URS</name>
              <description>update request source
* 0: counter overflow and setting the UG bit
* 1: counter overflow</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDIS</name>
              <description>disable UEV. Shadow registers keep their values. Otherwise, buffered registers are then loaded with their preload values when UEV happen.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_DIER</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>TIM interupt enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UIE</name>
              <description>enable update interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_SR</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>TIM status register</description>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UG_DONE</name>
              <description>UG operation status
This bit is cleared by hardware when the UG bit in the TIMx_EGR register is set. When the UG operation is done, hardware set this bit to '1'. So, software can poll this bit to see the UG operation status.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UIF</name>
              <description>update interrupt flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_EGR</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>TIM event generation register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UG</name>
              <description>update generation. Re-initialize the counter and generate an update of registers. Note that the prescaler counter is cleared too.(anyway the prescaler ratio is not affected)</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_CNT</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>TIM counter</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>counter value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_ARR</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>TIM auto-reload register</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARR</name>
              <description>the value to be loaded in the actual auto-reload register. It can be preloaded by setting ARPE bit in TIM_CR.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_SEC</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>TIM security control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC</name>
              <description>Secure timer enable.
0: This is a non-secure timer. All its registers except TIMx_SEC can be accessed from both secure and non-secure address. As a result, both secure and non-secure code can access it.
1: This is a secure timer. All its registers can only be accessed from secure address. As a result, only secure code can access it. Non-secure code can't access it through non-secure address.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TIM_BASIC_DUMMY</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>Timer Baisc Dummy Register</description>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
