Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CTC_REG</name>
      <baseAddress>0x4100b000</baseAddress>
      <size>0x00000338</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000338</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTC_CTRL</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Captouch Control Register</description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>baseline_ini</name>
              <description>1: Baseline initial function enable, HW will clear this bit to "0" after baseline initial</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ct_mode</name>
              <description>0: Comparator mode
1: SAR ADC mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ct_enable</name>
              <description>0: CTC disable
1: CTC enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAN_PERIOD</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Scan Parameters Register</description>
          <resetValue>0x400C34FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sample_ave_ctrl</name>
              <description>ADC sampled number for average function (SAR ADC mode)
average number=2^(sample_ave_ctrl+1)</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sleep_time_cnt</name>
              <description>clk40M
When this register is set to 0, HW will scan continuously and have no sleep time.</description>
              <bitRange>[24:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETC_CTRL</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>Environment Tracking Control Register</description>
          <resetValue>0x00001204</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>baseline_upd_step</name>
              <description>Baseline update step for all channel</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>baseline_wt_factor</name>
              <description>Baseline update weight factor (ETC_factor_th) for all channel
ETC_factor_th=2^baseline_wt_factor</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>etc_scan_interval</name>
              <description>ETC update interval between scan period (sleep time) for all channel
Interval=(etc_scan_interval+1)*scan_period</description>
              <bitRange>[7:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>etc_func_ctrl</name>
              <description>Environmental cap tracking calibration function
0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_STATUS</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>FIFO Status Register</description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>afifo_clear</name>
              <description>clear the FIFO data</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>afifo_full_lvl</name>
              <description>user define the full level for afifo, the valid value is from 0 to 63</description>
              <bitRange>[15:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>afifo_valid_cnt</name>
              <description>FIFO valid cnt(push unit number which can be read)</description>
              <bitRange>[9:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>afifo_over_lvl</name>
              <description>0: FIFO not over level
1: FIFO over level</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>afifo_empty</name>
              <description>0: FIFO not empty
1: FIFO empty</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>afifo_full</name>
              <description>0: FIFO not oveflow (not full)
1: FIFO overflow(full)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_READ</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>FIFO Read Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>afifo_rd_data_vld</name>
              <description>Read data from raw code FIFO valid</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fifo_mode</name>
              <description>Controls the write type of FIFO data
1:filtered data
0: raw data</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>afifo_rd_data</name>
              <description>Read data from FIFO
[15:0] : data
[19:16] : channel number</description>
              <bitRange>[19:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_ENABLE0</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>Interrupt Enable Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>scan_end_intr_en</name>
              <description>sample scan finish enable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>afifo_overlvl_intr_en</name>
              <description>Raw code FIFO over level enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>over_n_noise_th_intr_en</name>
              <description>Negative noise threshold overflow enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>afifo_overflow_intr_en</name>
              <description>Raw code FIFO overflow enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>over_p_noise_th_intr_en</name>
              <description>Positive noise threshold overflow enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_ENABLE1</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>Interrupt Enable Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>touch_release_intr_en</name>
              <description>Channelx single touch release enable, x is 0~8</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>touch_press_intr_en</name>
              <description>Channelx single touch press enable, x is 0~8</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_STATUS0</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>interrupt status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>scan_end_intr</name>
              <description>sample scan finish interrupt</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>afifo_overlvl_intr</name>
              <description>Raw code FIFO over level interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>over_n_noise_th_intr</name>
              <description>Negative noise threshold overflow interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>afifo_overflow_intr</name>
              <description>Raw code FIFO overflow interrupt</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>over_p_noise_th_intr</name>
              <description>Positive noise threshold overflow interrupt</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_STATUS1</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>interrupt status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>touch_release_intr</name>
              <description>Channelx single touch release interrupt, x is  0~8</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>touch_press_intr</name>
              <description>Channelx single touch press interrupt, x is  0~8</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAW_INTERRUPT_STATUS0</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>Raw Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>scan_end</name>
              <description>sample scan finish raw interrupt</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>afifo_overlvl</name>
              <description>Raw code FIFO over level raw interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>over_n_noise_th</name>
              <description>Negative noise threshold overflow raw interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>afifo_overflow</name>
              <description>Raw code FIFO overflow raw interrupt</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>over_p_noise_th</name>
              <description>Positive noise threshold overflow raw interrupt</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAW_INTERRUPT_STATUS1</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>Raw Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>touch_release</name>
              <description>Channelx single touch release raw interrupt, x is 0~8</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>touch_press</name>
              <description>Channelx single touch press raw interrupt, x is  0~8</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_ALL_CLR</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>Interrupt All Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>intr_all_clr</name>
              <description>Write "1" to this register to clear the combined interrupts, all individual interrupts, interrupt status register and raw interrupt status register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_STATUS_CLR0</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>scan_end_clr</name>
              <description>sample scan finish raw interrupt and related register</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>afifo_overlvl_clr</name>
              <description>Clear raw code FIFO over level raw interrupt and related register</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>over_n_noise_th_clr</name>
              <description>Clear negative noise threshold overflow interrupt and related register</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>afifo_overflow_clr</name>
              <description>Clear raw code FIFO overflow interrupt and related register</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>over_p_noise_th_clr</name>
              <description>Clear positive noise threshold overflow interrupt and related register</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_STATUS_CLR1</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>touch_release_clr</name>
              <description>Clear channelx single touch release interrupt and related register</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>touch_press_clr</name>
              <description>Clear channelx single touch press interrupt and related register</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRS</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>PRS Select Register</description>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>prs_lpsr_seed</name>
              <description>lpsr seed. it can't be 0.</description>
              <bitRange>[6:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>prs_size</name>
              <description>00: lpsr width is 2
01: lpsr width is 3
10: lpsr width is 4</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>prs_en</name>
              <description>PRS enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_SEL</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Debug Select Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dbg_sel</name>
              <description>Debug information selection
0: dbg_clkrst
1: dbg_apbslv
2: dbg_ctrl
3: dbg_decision
4: dbg_adc_arb
Others: dbg_clkrst</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_PORT</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Debug Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dbg_port</name>
              <description>Debug port output value,depend on dbg_sel value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_USE0</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>ECO USE0 Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eco_use0</name>
              <description>For ECO use</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_USE1</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>ECO USE1 Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eco_use1</name>
              <description>For ECO use</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_COMP_VERSION</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>Version Register</description>
          <resetValue>0x20250310</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>comp_version</name>
              <description>CTC version number</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SNR_INF</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>Signal Noise Ratio Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>snr_noise_data</name>
              <description>Noise peak to peak signal raw data for SNR monitor</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>snr_noise_ch</name>
              <description>Specify which channel you want to read the snr_noise_data data</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
