Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CH4_NOISE_TH</name>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <description>Channel 4 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch4_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch4_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_TOUCH_TH</name>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <description>Channel 4 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch4_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 4.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch4_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 4.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_BASELINE_DBC</name>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <description>Channel 4</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch4_baseline</name>
              <description>Digital baseline data of channel 4.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch4_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch4_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_CTRL</name>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <description>Channel 5 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch5_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch5_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch5_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch5_VCCS_sel</name>
              <description>ch5_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_NOISE_TH</name>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <description>Channel 5 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch5_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch5_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_TOUCH_TH</name>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <description>Channel 5 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch5_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 5.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch5_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 5.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_BASELINE_DBC</name>
          <addressOffset>0x0000019C</addressOffset>
          <size>32</size>
          <description>Channel 5</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch5_baseline</name>
              <description>Digital baseline data of channel 5.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch5_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch5_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_CTRL</name>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <description>Channel 6 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch6_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch6_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch6_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch6_VCCS_sel</name>
              <description>ch6_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_NOISE_TH</name>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <description>Channel 6 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch6_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch6_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_TOUCH_TH</name>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <description>Channel 6 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch6_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 6.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch6_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 6.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_BASELINE_DBC</name>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <description>Channel 6</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch6_baseline</name>
              <description>Digital baseline data of channel 6.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch6_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch6_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_CTRL</name>
          <addressOffset>0x000001C8</addressOffset>
          <size>32</size>
          <description>Channel 7 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch7_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch7_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch7_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch7_VCCS_sel</name>
              <description>ch7_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_NOISE_TH</name>
          <addressOffset>0x000001CC</addressOffset>
          <size>32</size>
          <description>Channel 7 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch7_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch7_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_TOUCH_TH</name>
          <addressOffset>0x000001D0</addressOffset>
          <size>32</size>
          <description>Channel 7 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch7_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 7.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch7_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 7.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_BASELINE_DBC</name>
          <addressOffset>0x000001D4</addressOffset>
          <size>32</size>
          <description>Channel 7</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch7_baseline</name>
              <description>Digital baseline data of channel 7.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch7_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch7_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH8_CTRL</name>
          <addressOffset>0x000001E4</addressOffset>
          <size>32</size>
          <description>Channel 8 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch8_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch8_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch8_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch8_VCCS_sel</name>
              <description>ch8_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH8_NOISE_TH</name>
          <addressOffset>0x000001E8</addressOffset>
          <size>32</size>
          <description>Channel 8 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch8_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch8_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH8_TOUCH_TH</name>
          <addressOffset>0x000001EC</addressOffset>
          <size>32</size>
          <description>Channel 8 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch8_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 8.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch8_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 8.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
