Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CH8_BASELINE_DBC</name>
          <addressOffset>0x000001F0</addressOffset>
          <size>32</size>
          <description>Channel 8</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch8_baseline</name>
              <description>Digital baseline data of channel 8.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch8_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch8_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH9_CTRL</name>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <description>Channel 9 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch9_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch9_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch9_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch9_VCCS_sel</name>
              <description>ch9_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH9_NOISE_TH</name>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <description>Channel 9 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch9_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch9_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH9_TOUCH_TH</name>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <description>Channel 9 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch9_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 9.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch9_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 9.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH9_BASELINE_DBC</name>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <description>Channel 9</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch9_baseline</name>
              <description>Digital baseline data of channel 9.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch9_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch9_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH10_CTRL</name>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <description>Channel 10 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch10_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch10_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch10_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch10_VCCS_sel</name>
              <description>ch10_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH10_NOISE_TH</name>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <description>Channel 10 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch10_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch10_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH10_TOUCH_TH</name>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <description>Channel 10 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch10_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 10.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch10_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 10.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH10_BASELINE_DBC</name>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <description>Channel 10</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch10_baseline</name>
              <description>Digital baseline data of channel 10.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch10_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch10_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH11_CTRL</name>
          <addressOffset>0x00000238</addressOffset>
          <size>32</size>
          <description>Channel 11 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch11_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch11_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch11_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch11_VCCS_sel</name>
              <description>ch11_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH11_NOISE_TH</name>
          <addressOffset>0x0000023C</addressOffset>
          <size>32</size>
          <description>Channel 11 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch11_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch11_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH11_TOUCH_TH</name>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <description>Channel 11 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch11_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 11.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch11_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 11.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH11_BASELINE_DBC</name>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <description>Channel 11</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch11_baseline</name>
              <description>Digital baseline data of channel 11.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch11_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch11_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH12_CTRL</name>
          <addressOffset>0x00000254</addressOffset>
          <size>32</size>
          <description>Channel 12 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch12_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch12_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch12_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch12_VCCS_sel</name>
              <description>ch12_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH12_NOISE_TH</name>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <description>Channel 12 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch12_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch12_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH12_TOUCH_TH</name>
          <addressOffset>0x0000025C</addressOffset>
          <size>32</size>
          <description>Channel 12 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch12_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 12.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch12_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 12.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH12_BASELINE_DBC</name>
          <addressOffset>0x00000260</addressOffset>
          <size>32</size>
          <description>Channel 12</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch12_baseline</name>
              <description>Digital baseline data of channel 12.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch12_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch12_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
