Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CH13_CTRL</name>
          <addressOffset>0x00000270</addressOffset>
          <size>32</size>
          <description>Channel 13 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch13_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch13_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch13_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch13_VCCS_sel</name>
              <description>ch13_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH13_NOISE_TH</name>
          <addressOffset>0x00000274</addressOffset>
          <size>32</size>
          <description>Channel 13 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch13_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch13_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH13_TOUCH_TH</name>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <description>Channel 13 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch13_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 13.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch13_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 13.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH13_BASELINE_DBC</name>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <description>Channel 13</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch13_baseline</name>
              <description>Digital baseline data of channel 13.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch13_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch13_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH14_CTRL</name>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <description>Channel 14 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch14_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch14_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch14_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch14_VCCS_sel</name>
              <description>ch14_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH14_NOISE_TH</name>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <description>Channel 14 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch14_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch14_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH14_TOUCH_TH</name>
          <addressOffset>0x00000294</addressOffset>
          <size>32</size>
          <description>Channel 14 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch14_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 14.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch14_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 14.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH14_BASELINE_DBC</name>
          <addressOffset>0x00000298</addressOffset>
          <size>32</size>
          <description>Channel 14</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch14_baseline</name>
              <description>Digital baseline data of channel 14.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch14_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch14_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH15_CTRL</name>
          <addressOffset>0x000002A8</addressOffset>
          <size>32</size>
          <description>Channel 15 Control Register</description>
          <resetValue>0x01900622</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch15_Sc_times</name>
              <description>0~65536 times,  Only used in SAR ADC mode.When the counter reaches the set value, the switching capacitor action is stopped immediately and the voltage sampling is performed after the ADC is ready.The actual value will be one more due to the counter.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch15_CMP_th</name>
              <description>0.5V~0.7V,it has 8 data gear selections. Only used in comparator mode, triggered when the voltage reaches the comparator threshold</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch15_VCCS_g</name>
              <description>Compensate current source gear selection. (1/180K) *(50uA+5uA*&lt;4:0&gt;) /10uA</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch15_VCCS_sel</name>
              <description>ch15_VCCS_sel:  
00: SEL_TOUCH_CUR_0V2I_1IBHN, EN_TOUCHCUR_CALI disable ,use default (off mode)
01: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 0 (normal mode)
10: SEL_TOUCH_CUR_0V2I_1IBHN = 0; EN_TOUCHCUR_CALI = 1 (calibration mode)
11: SEL_TOUCH_CUR_0V2I_1IBHN = 1; EN_TOUCHCUR_CALI = 0 (debug mode)</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH15_NOISE_TH</name>
          <addressOffset>0x000002AC</addressOffset>
          <size>32</size>
          <description>Channel 15 Noise Threshold Register</description>
          <resetValue>0x00280028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch15_n_ent</name>
              <description>The environmental negative noise threshold: the negative maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch15_p_ent</name>
              <description>The environmental positive noise threshold: the positive maximum capacitance change of raw data that is still considered an environment change.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH15_TOUCH_TH</name>
          <addressOffset>0x000002B0</addressOffset>
          <size>32</size>
          <description>Channel 15 Threshold Register</description>
          <resetValue>0x00000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch15_a_touch_th</name>
              <description>Absolute threshold data of touch judgement for channel 15.
It can be updated by HW when baseline initial function or ETC function enabled, a_touch_th=baseline-d_touch_th, manual tuning when ETC disabled, (0x0~0xFFF).
Recommended data=80%*signal</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch15_d_touch_th</name>
              <description>Difference threshold data of touch judgement for channel 15.
It needs to be configured during development, (0x0~0xFFF) (0~4095). 
Init number=0x64
Recommend data=80%*(signal-baseline)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH15_BASELINE_DBC</name>
          <addressOffset>0x000002B4</addressOffset>
          <size>32</size>
          <description>Channel 15</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ch15_baseline</name>
              <description>Digital baseline data of channel 15.
Init number=0x0
It can be initialed by HW when baseline initial function enabled, and can be updated automatically by HW when ETC function enabled.
It could be configured by manual tuning.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch15_debounce_time</name>
              <description>2'b00: 2 times
2'b01: 3 times
2'b10: 4 times
2'b11: 5 times</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch15_debounce_en</name>
              <description>0: Disable
1: Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_SETTLE_CTRL</name>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <description>Captouch Settle Control Register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>settle_cnt_chn_chg</name>
              <description>settle count for sample data from chn switch, the unit is sample clock.
0 means no need to settle</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>settle_cnt</name>
              <description>settle count for sample data from ADC to captouch, the unit is sample clock.
0 means no need to settle</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_FILTER_CTRL0</name>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <description>Captouch Filter Control0 Register</description>
          <resetValue>0x00000354</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iir_k_acc_en</name>
              <description>enable accelerated touch response.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iir_k_acc</name>
              <description>iir filter coef. the range is 0~11.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iir_k_normal</name>
              <description>iir filter coef</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>med_coef</name>
              <description>Median filter coefficient,for raw data
00:disable
01:coef is 3
10:coef is 5
11:coef is 7</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iir_en</name>
              <description>Enable ctc iir function,for raw data</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>flt_en</name>
              <description>Enable ctc filter function(global),for raw data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_FILTER_CTRL1</name>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <description>Captouch Filter Control1 Register</description>
          <resetValue>0x20000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>notch_coef_fir</name>
              <description>The coefficient of the sliding filter.The divisor.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>notch_coef</name>
              <description>The coefficient of the sliding filter.The window width factor
0,1: disable
2-8: useful</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_NOISE_CNT</name>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <description>Captouch Noise Cnt Register</description>
          <resetValue>0x000000C8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>noise_cnt</name>
              <description>This parameter is used to set the refresh time of the noise data.The counter is updated after the data has been processed to the last channel</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_DIV_HCNT</name>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <description>Captouch Div Hcnt Control Register</description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ctc_clk_hcnt</name>
              <description>This field defines sample clock driver high level of  chn. 
high level = (ctc_clk_hcnt +1)* ip_clk period</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_DIV_LCNT0</name>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <description>Captouch Div Lcnt Control Register</description>
          <resetValue>0x00140A05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ctc_clk_lcnt2</name>
              <description>This field defines sample clock driver  lower level of  chn. 
lower level  = ctc_clk_lcnt2 * ip_clk period</description>
              <bitRange>[26:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_clk_lcnt1</name>
              <description>This field defines sample clock driver lower  level of  chn.
lower level  = ctc_clk_lcnt1 * ip_clk period</description>
              <bitRange>[17:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_clk_lcnt0</name>
              <description>This field defines  sample clock driver lower level of  chn
lower level  = ctc_clk_lcnt0 * ip_clk period</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
