Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CTC_DIV_LCNT1</name>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <description>Captouch Div Lcnt Control Register</description>
          <resetValue>0x00140A05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ctc_clk_lcnt5</name>
              <description>This field defines sample clock driver  lower level of  chn. 
lower level  = ctc_clk_lcnt2 * ip_clk period</description>
              <bitRange>[26:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_clk_lcnt4</name>
              <description>This field defines sample clock driver lower  level of  chn.
lower level  = ctc_clk_lcnt1 * ip_clk period</description>
              <bitRange>[17:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_clk_lcnt3</name>
              <description>This field defines  sample clock driver lower level of  chn
lower level  = ctc_clk_lcnt0 * ip_clk period</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_DIV_LCNT2</name>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <description>Captouch Div Lcnt Control Register</description>
          <resetValue>0x00000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ctc_clk_lcnt6</name>
              <description>This field defines  sample clock driver lower level of  chn
lower level  = ctc_clk_lcnt0 * ip_clk period</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_DMA</name>
          <addressOffset>0x00000320</addressOffset>
          <size>32</size>
          <description>Captouch  DMA Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rxdma_msize</name>
              <description>ctc rxdma burst size. When fifo reach certain entry depth , controller will req dma operation.
0: 1 entry
1: 4
2: 8
N: 2**(N+1)
Note: this setting must be same with GDMA burst len , or  fifo will underflow or overflow.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rxdma_en</name>
              <description>1:enable ctc rxdma
Note: ctc dma interface must used GDMA as flow control , IP flow control is not support .</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CTC_CM_CNT</name>
          <addressOffset>0x00000324</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000018F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ctc_cm_cnt</name>
              <description>This field controls the time it takes for the power supply (Vd) to charge the capacitor Cm when each channel of Captouch starts working. Charging Time = (ctc_cm_cnt +1) * ip_clk_period.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CTC_CONF</name>
          <addressOffset>0x00000328</addressOffset>
          <size>32</size>
          <description>Captouch  Configuration Register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ctc_sw_trig</name>
              <description>This bit controls the ctc module to do a conversion.
Every time this bit is set to 1, ctc module would switch to a new channel and do one conversion. Therefore, this bit could be used as a start-convert event which is controlled by software. Every time a conversion is done, software MUST clear this bit manually. The interval between clearing and restart this bit must exceed one sample clock period.
0: disable the analog module and analog mux.
1: enable the analog module and analog mux. And then start a new channel conversion.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_cvlist_len</name>
              <description>This field defines the number of items in the ctc conversion channel list.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ov_mode</name>
              <description>sample mode
0-All sample conversions done in staggered sequence
1-All sample conversions done in regular sequence</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CTC_CHSW_LIST_0</name>
          <addressOffset>0x0000032C</addressOffset>
          <size>32</size>
          <description>Captouch Channel Switch List 0 Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ctc_chsw_7</name>
              <description>This field defines the number 7 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_6</name>
              <description>This field defines the number 6 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_5</name>
              <description>This field defines the number 5 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_4</name>
              <description>This field defines the number 4 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_3</name>
              <description>This field defines the number 3 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_2</name>
              <description>This field defines the number 2 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_1</name>
              <description>This field defines the number 1 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_0</name>
              <description>This field defines the number 0 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CTC_CHSW_LIST_1</name>
          <addressOffset>0x00000330</addressOffset>
          <size>32</size>
          <description>Captouch Channel Switch List 1 Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ctc_chsw_15</name>
              <description>This field defines the number 15 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_14</name>
              <description>This field defines the number 14 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_13</name>
              <description>This field defines the number 13 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_12</name>
              <description>This field defines the number 12 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_11</name>
              <description>This field defines the number 11 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_10</name>
              <description>This field defines the number 10 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_9</name>
              <description>This field defines the number 9 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_chsw_8</name>
              <description>This field defines the number 8 channel to do a conversion when a conversion event takes place.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CTC_DUMMY</name>
          <addressOffset>0x00000334</addressOffset>
          <size>32</size>
          <description>Captouch Dummy Register</description>
          <resetValue>0x000000F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
