Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UART1_REG</name>
      <groupName>UARTIRDA</groupName>
      <baseAddress>0x41003000</baseAddress>
      <size>0x00000068</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000068</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UART_DLL</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>UART divisor length register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BAUD</name>
              <description>The low 8 bits of divisor coefficient (not used)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_IER</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>UART interrupt enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERETI</name>
              <description>RXFIFO_EMPTY_TIMEOUT interrupt enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERXNDI</name>
              <description>Rx noise detected interrupt enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETOI</name>
              <description>Rx timeout interrupt enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EMDI</name>
              <description>Rx path monitor done interrupt enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDSSI</name>
              <description>Modem Status Interrupt (EDSSI) (modem status transition) enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ELSI</name>
              <description>Receiver Line Status Interrupt (ELSI) (receiver line status) enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETBEI</name>
              <description>Transmitter FIFO Empty interrupt (ETBEI) (Tx FIFO empty) enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERBI</name>
              <description>Received Data Available Interrupt (ERBFI) (Rx trigger) enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_IIR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>UART interrupt identification register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT_PEND</name>
              <description>* 0: pending, and the IIR contents may be used as a pointer to the appropriate interrupt service routine
* 1: no interrupt is pending</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_LCR</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>UART line control register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLAB</name>
              <description>Divisor Latch Access bit, and control the accessibility of the DLL, DLM and IER registers
* 0: The divisor latches not accessible; IER accessible
* 1: The divisor latches accessible; DLL and DLM accessible
Note: THR/RBR don't care the value of dlab bit.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BRCTL</name>
              <description>Break Control bit
* 0: break signal disable
* 1: break signal enable (logic '0')</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STKP</name>
              <description>Stick Parity bit
* 0: Not stick parity, the parity type is ODD or EVEN (depending on eps)
* 1: Stick parity
**eps=1: low parity (1'b0)
**eps=0: high parity (1'b1)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPS</name>
              <description>Even Parity selection
* 0: Odd parity, the number of Logic '1' is odd
* 1: Even parity, the number of Logic '1' is even</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEN</name>
              <description>Parity Enable
* 0: No parity bit
* 1: Parity bit is generated on each outgoing character and is checked on each incoming one</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STB</name>
              <description>Stop bits length selection
* 0: 1 stop bit
* 1: 2 stop bits
Note: The receiver always checks the first stop bit only.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLS0</name>
              <description>Word length selection
* 0: 7 bits data
* 1: 8 bits data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MCR</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>UART modem control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFE</name>
              <description>Auto flow control enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP_EN</name>
              <description>LoopBack mode
* 0: Normal operation mode
* 1: Loopback mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT2</name>
              <description>Auxiliary output 2
Bit[3] affects the OUT2_ output in a manner identical to that described above set to 0
In loopback mode, connected to Data Carrier Detect (DCD).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT1</name>
              <description>Auxiliary output 1
Bit3 affects the OUT1_ output in a manner identical to that described above set to 0
In loopback mode, connected to Ring Indicator (RI)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS</name>
              <description>Request to Send (RTS) signal control
* 0: rts is logic 1.
* 1: rts is logic 0.
This bit controls the RTS_ output. Bit[1] affects the RTS_ output in a manner identical to that described above set to 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTR</name>
              <description>* 0: dtr is logic 1
* 1: dtr is logic 0
This bit controls the DTR output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_LSR</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>UART line status register</description>
          <resetValue>0x00000060</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RE_TIMEOUT_INT</name>
              <description>This bit is only set when rxfifo empty timeout interrupt is enabled(ERETI is set)
1:Rxfifo is empty for longer than TH_RETI</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXND_INT</name>
              <description>This bit is only set when RX debouncer has detected noise
1: Rx path noise detected interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MODEM_INT</name>
              <description>This bit is only set when Modem status pending 
1: Modem interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MONITOR_DONE_INT</name>
              <description>This bit is only set when Rx Path Monitor Done interrupt is enabled(EMDI is set)
1: Rx path monitor done</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMEOUT_INT</name>
              <description>This bit is only set when Rx Timeout interrupt is enabled(ETOI is set)
1: at least one character in the FIFO but no character has been input to the FIFO or reading from it for the time duration, which depends on the value in register REG_RX_PATH_CTRL[31:16]</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIFO_INT</name>
              <description>This bit is only set when Received Data Available Interrupt interrupt is enabled(ERBI is set)
1: FIFO Trigger level reached or Rx FIFO full</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIFO_ERR</name>
              <description>Uart_rx_error, depending on the FIFO control register (FCR) bit[0]
* 0: clear when the CPU reads the LSR, if there are no subsequent errors in the FIFO.
* 1: parity error, overrun error, framing error or break indication in the FIFO.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_NOT_FULL</name>
              <description>TXFIFO not full indicator</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_EMPTY</name>
              <description>TXFIFO empty indicator</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BREAK_INT</name>
              <description>Break Interrupt (BI) indicator
* 0: No break condition in the current character
* 1: The received data input held in the Spacing ( logic 0) state is longer than a full word transmission time</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FRM_ERR</name>
              <description>Framing Error (FE) indicator
* 0: No framing error in the current character
* 1: The received character does not have a valid stop bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PAR_ERR</name>
              <description>Parity Error (PE) indicator
* 0: No parity error in current character
* 1: The received character does not have the correct parity bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR_ERR</name>
              <description>Overrun Error (OE) indicator
* 0: No Overrun state
* 1: The transmission is continue although the Rx FIFO is full</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DRDY</name>
              <description>* 0: No characters in the Receiver FIFO
* 1: At least one character has been received and transferred into the FIFO</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MSR</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>UART modem status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R_DCD</name>
              <description>Complement of the DCD input or equals to Out2 in loopback mode.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_RI</name>
              <description>Complement of the RI input or equals to Out1 in loopback mode.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_DSR</name>
              <description>Complement of the DSR input or equals to DTR in loopback mode.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_CTS</name>
              <description>Complement of the CTS input or equals to RTS in loopback mode.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>D_DCD</name>
              <description>* 0: Otherwise
* 1: The DCD line has changed its state</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TERI</name>
              <description>* 0: Otherwise
* 1: The RI line has changed its state from low to high state</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>D_DSR</name>
              <description>* 0: Otherwise
* 1: The DSR line has changed its state</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>D_CTS</name>
              <description>* 0: Otherwise
* 1: The CTS line has changed its state</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_SCR</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>UART scratch pad register</description>
          <resetValue>0x00000030</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XFACTOR_ADJ</name>
              <description>One factor of Baud rate calculation for TX path</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_SEL</name>
              <description>Debug port selection</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCRATCH_7</name>
              <description>clear rx break signal interrupt status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCRATCH_6_0</name>
              <description>*Bit[6]: rx break signal interrupt enable
*Bit[5]: fl_set_bi_err
*Bit[4]: fl_frame_err
*Bit[3]: pin_lb_test
*Bit[2:0]: reserved</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_STS</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>UART STS register</description>
          <resetValue>0x00010470</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XFACTOR</name>
              <description>Factor of Baud rate calculation for Tx path</description>
              <bitRange>[23:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RBR_OR_UART_THR</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>UART receiver buffer register/UART transmitter holding register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABIT</name>
              <description>UART_RBR's Rx data bits or UART_THR's Tx data bit[7:0]
Note: Bit[0] is the least significant bit. It is the first bit serially received/transmitted.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MISCR</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>UART MISC control register</description>
          <resetValue>0x00002020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_DUMMY_FLAG</name>
              <description>Indicate the clearing of dummy data</description>
              <bitRange>[30:30]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DUMMY_DATA</name>
              <description>Store dummy data, when UART is DMA flow controller, dummy data is padded for last RXDMA burst request.</description>
              <bitRange>[29:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMA_OWNER</name>
              <description>* 0: GDMA
* 1: UART, interrupt enable signal other than erpd should be masked</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDA_RX_INV</name>
              <description>irda_rx_i reverse input enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDA_TX_INV</name>
              <description>irda_tx_o reverse output enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMA_BURSTSIZE</name>
              <description>RXDMA burstsize, maximum value is 16.</description>
              <bitRange>[18:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMA_BURSTSIZE</name>
              <description>TXDMA burstsize, maximum value is 16.</description>
              <bitRange>[10:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMA_EN</name>
              <description>RXDMA enable, valid when dma_mode in FCR is 1'b1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMA_EN</name>
              <description>TXDMA enable, valid when dma_mode in FCR is 1'b1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDA_ENABLE</name>
              <description>* 0: UART mode only
* 1: UART is co-work with IRDA SIR mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_SIR_TX_PWC0</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>UART IRDA SIR TX pulse width control 0 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UPPERBOUND_SHIFTRIGHT</name>
              <description>* 0: Shift left, minus offset value of upperbound_shiftval
* 1: Shift right, plus offset value of upperbound_shiftval</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPPERBOUND_SHIFTVAL</name>
              <description>The shift value of SIR TX pulse's right edge</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWBOUND_SHIFTRIGHT</name>
              <description>* 0: Shift left, minus offset value of lowbound_shiftval
* 1: Shift right, plus offset value of lowbound_shiftval</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWBOUND_SHIFTVAL</name>
              <description>The shift value of SIR TX pulse's left edge</description>
              <bitRange>[14:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
