Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>UART_SIR_RX_PFC</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>UART IRDA SIR Rx pulse filter control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R_SIR_RX_FILTER_THRS</name>
              <description>The threshold of SIR Rx filter, Rx pulse is valid only when Rx pulse width is larger than the threshold.</description>
              <bitRange>[15:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>R_SIR_RX_FILTER_EN</name>
              <description>IrDA SIR Rx filter enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_BAUD_MON</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>UART baud monitor register</description>
          <resetValue>0x07000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOGGLE_MON_EN</name>
              <description>Toggle monitor enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MON_DATA_VLD</name>
              <description>Indicate valid monitoring data</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FALLING_THRESH</name>
              <description>Indicate the threshold of Rx data rising edge</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIN_LOW_PERIOD</name>
              <description>Minimum space of consecutive logic '0' of Rx data</description>
              <bitRange>[23:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MIN_FALL_SPACE</name>
              <description>Minimum space of adjacent falling edge of Rx data</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_DBGR</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>UART debug register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_UART</name>
              <description>The output value of debug port, depending on dbg_sel value in SCR[2:0]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RX_PATH_CTRL</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>UART Rx path control register</description>
          <resetValue>0x00400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R_RXTO_THRS</name>
              <description>Indicate the timeout threshold of Rx path, unit in one-bit time</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBAUD_ADJ_10_0</name>
              <description>One factor of Baud rate calculation for Rx path, similar with xfactor_adj</description>
              <bitRange>[13:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>R_RST_NEWRX_N</name>
              <description>Reset new Rx path, low active</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MON_BAUD_CTRL</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>UART monitor baud rate control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R_UPD_OSC_IN_XTAL</name>
              <description>Update parameter r_cycnum_perbit_osc (during the update of parameter r_cycnum_perbit_xtal) enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>R_CYCNUM_PERBIT_OSC</name>
              <description>Indicate the average OSC clock cycle number of one bit, for Rx path OSC clk
NOTE: SW sets the initial value, HW updates it depending on the monitor result.</description>
              <bitRange>[28:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>R_BIT_NUM_THRES</name>
              <description>Indicate the bit number threshold of one monitor period, max value is 127</description>
              <bitRange>[8:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>R_MON_BAUD_EN</name>
              <description>Monitor Rx baud enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MON_BAUD_STS</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>UART monitor baud rate status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RO_MON_TOTAL_BIT</name>
              <description>Indicate the number of bits actually monitored</description>
              <bitRange>[28:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RO_MON_RDY</name>
              <description>Indicate the finish of calculation of actual cycle number per bit, it's cleared when r_mon_baud_en is 0</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>R_CYCNUM_PERBIT_XTAL</name>
              <description>Indicate the fractional xtal clock cycle number of one bit, for Rx path xtal clk
NOTE: SW sets the initial value, HW updates it depending on the monitor result.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MON_CYC_NUM</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>UART monitored cycle number register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RO_MON_TOTAL_CYCLE</name>
              <description>Indicate the number of clock cycle actually monitored</description>
              <bitRange>[27:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RX_BYTE_CNT</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>UART Rx data byte count register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_RX_BYTE_CNT</name>
              <description>Write 1 to clear ro_rx_byte_cnt</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RO_RX_BYTE_CNT</name>
              <description>Count the byte number of data read from rxfifo</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_FCR</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>UART FIFO control register</description>
          <resetValue>0x000000C1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECVTRG</name>
              <description>Define the 16-entries Receiver FIFO Interrupt trigger level (0~15 bytes)
* 00: 1 byte
* 01: 16 bytes (FIFO_DEPTH/4)
* 10: 32 bytes (FIFO_DEPTH/2)
* 11: 62 bytes (FIFO_DEPTH-2)</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_MODE</name>
              <description>Support dma mode (cooperate with DW DDMA in the data path)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XMIT_CLR</name>
              <description>Clear xmitckt</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RECV_CLR</name>
              <description>Clear receiving</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>FIFO_EN</name>
              <description>Error report of RCVR FIFO field enable, only valid when the LSR bit[7] is set to 1.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_ICR</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>UART interrupt clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RETICF</name>
              <description>Rxfifo empty timeout Interrupt Clear Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXNDICF</name>
              <description>Rx noise Detected Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MDICF</name>
              <description>Monitor Done Interrupt Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MICF</name>
              <description>Modem Interrupt Clear Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TOICF</name>
              <description>Timeout Interrupt Clear Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RLSICF</name>
              <description>Receiver Line Statue Interrupt Clear Flag
Writing 1 to this bit clears PARITY_ERR, OVERRUN_ERR, FRAMING_ERR, BREAK_ERR_INT and RXFIFO_ERR  in the USART_LSR register.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RXDBCR</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>UART RX debounce control register</description>
          <resetValue>0x0000001E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBNC_CYC</name>
              <description>Debounce cycles in unit of sclk</description>
              <bitRange>[15:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBNC_FEN</name>
              <description>UART RX debounce enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_TH_RETI</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>UART rxfifo empty interrupt timeout threshold</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TH_RETI</name>
              <description>Set rxfifo empty timeout interrupt, when rxfifo is empty for longer than TH_RETI</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_DUMMY</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>UART Dummy Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>rsvd for hw</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
