Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDG2_REG</name>
      <groupName>WDG</groupName>
      <baseAddress>0x41000d80</baseAddress>
      <size>0x00000014</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000014</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDG_MKEYR</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>WDG Magic Key register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MKEY</name>
              <description>0x6969: enable access to register WDG_CR/WDG_RLR/WDG_WINR
0x5A5A: reload WDG counter
0x3C3C: enable WDG function</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_CR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>WDG Control regsietr</description>
          <resetValue>0x01000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RVU</name>
              <description>Watchdog counter update by reload command</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EVU</name>
              <description>Watchdog early interrupt function update</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPEN</name>
              <description>Low power enable
0: WDG will gating when system goes into sleep mode
1: WDG keep running when system goes into sleep mode</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EIC</name>
              <description>Write '1' clear the early interrupt</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>EIE</name>
              <description>Watchdog early interrupt enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EICNT</name>
              <description>Early interrupt trigger threshold</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_RLR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>WDG Relaod register</description>
          <resetValue>0x0063FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRER</name>
              <description>Prescaler counter, configuration only allowed before wdg enable  
WDG: 0x63
System wdg: 0x1F</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RELOAD</name>
              <description>Reload value for watchdog counter
Default : 64s (@100k)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_WINR</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>WDG Window Register</description>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WINDOW</name>
              <description>Watchdog feed protect window register</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IWDG_DUMMY</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Wdg Dummy Register</description>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>rsvd for hw</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDG0_REG</name>
      <groupName>WDG</groupName>
      <baseAddress>0x40801d00</baseAddress>
      <size>0x00000014</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000014</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDG_MKEYR</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>WDG Magic Key register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MKEY</name>
              <description>0x6969: enable access to register WDG_CR/WDG_RLR/WDG_WINR
0x5A5A: reload WDG counter
0x3C3C: enable WDG function</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_CR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>WDG Control regsietr</description>
          <resetValue>0x01000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RVU</name>
              <description>Watchdog counter update by reload command</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EVU</name>
              <description>Watchdog early interrupt function update</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPEN</name>
              <description>Low power enable
0: WDG will gating when system goes into sleep mode
1: WDG keep running when system goes into sleep mode</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EIC</name>
              <description>Write '1' clear the early interrupt</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>EIE</name>
              <description>Watchdog early interrupt enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EICNT</name>
              <description>Early interrupt trigger threshold</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_RLR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>WDG Relaod register</description>
          <resetValue>0x0063FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRER</name>
              <description>Prescaler counter, configuration only allowed before wdg enable  
WDG: 0x63
System wdg: 0x1F</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RELOAD</name>
              <description>Reload value for watchdog counter
Default : 64s (@100k)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_WINR</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>WDG Window Register</description>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WINDOW</name>
              <description>Watchdog feed protect window register</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IWDG_DUMMY</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Wdg Dummy Register</description>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>rsvd for hw</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
