Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TRNG_REG</name>
      <baseAddress>0x400c8000</baseAddress>
      <size>0x0000021C</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0000021C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IER</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Interrupt Enable Register</description>
          <resetValue>0x0000000E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUFFER_FULL_INTERRUPT_ENABLE</name>
              <description>RNG buffer full interrupt enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APT0_FAIL_INTERRUPT_ENABLE</name>
              <description>Adaptive Proportion Test 0 fail interrupt enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCT1_FAIL_INTERRUPT_ENABLE</name>
              <description>Repetition Count Test 1 fail interrupt enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCT0_FAIL_INTERRUPT_ENABLE</name>
              <description>Repetition Count Test 0 fail interrupt enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_ERROR_INTERRUPT_ENABLE</name>
              <description>Read error interrupt enable.
Trigger interrupt when read RNG data register and RNG valid is not 0x1~0x8.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Interrupt Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUFFER_FULL_INTERRUPT_ACTIVE</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>APT0_FAIL_INTERRUPT_ACTIVE</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RCT1_FAIL_INTERRUPT_ACTIVE</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RCT0_FAIL_INTERRUPT_ACTIVE</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_ERROR_INTERRUPT_ACTIVE</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUFFER_FULL_INTERRUPT_CLEAR</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>APT0_FAIL_INTERRUPT_CLEAR</name>
              <description>Clear the this interrupt also clear the error flags of APT0 health tests</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RCT1_FAIL_INTERRUPT_CLEAR</name>
              <description>Clear the this interrupt also clear the error flags of RCT1 health tests</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RCT0_FAIL_INTERRUPT_CLEAR</name>
              <description>Clear the this interrupt also clear the error flags of RCT0 health tests</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>READ_ERROR_INTERRUPT_CLEAR</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Valid</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>RNG Valid Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALID</name>
              <description>Encoded status register.
0x0: buffer empty or APT is not done.
0x1~0x8: number of word is valid.
0xF: APT test fails.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA0</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>RNG Data Register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM_NUMBER</name>
              <description>RNG data register 0. Read as 0x0 if RNG valid register is not a ready status.
A Read access triggers a buffer pop, so the value is only read once then be discarded.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA1</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>RNG Data Register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM_NUMBER</name>
              <description>RNG data register 1. Read as 0x0 if RNG valid register is not a ready status.
A Read access triggers a buffer pop, so the value is only read once then be discarded.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA3</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>RNG Data Register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM_NUMBER</name>
              <description>RNG data register 3. Read as 0x0 if RNG valid register is not a ready status.
A Read access triggers a buffer pop, so the value is only read once then be discarded.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA4</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>RNG Data Register 4</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM_NUMBER</name>
              <description>RNG data register 4. Read as 0x0 if RNG valid register is not a ready status.
A Read access triggers a buffer pop, so the value is only read once then be discarded.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA5</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>RNG Data Register 5</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM_NUMBER</name>
              <description>RNG data register 5. Read as 0x0 if RNG valid register is not a ready status.
A Read access triggers a buffer pop, so the value is only read once then be discarded.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA6</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>RNG Data Register 6</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM_NUMBER</name>
              <description>RNG data register 6. Read as 0x0 if RNG valid register is not a ready status.
A Read access triggers a buffer pop, so the value is only read once then be discarded.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA7</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>RNG Data Register 7</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM_NUMBER</name>
              <description>RNG data register 7. Read as 0x0 if RNG valid register is not a ready status.
A Read access triggers a buffer pop, so the value is only read once then be discarded.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>RNG Status Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APT0_FAIL</name>
              <description>APT0 error detected</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RCT1_FAIL</name>
              <description>RCT1 error detected</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RCT0_FAIL</name>
              <description>RCT0 error detected</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>APT0_DONE</name>
              <description>Adaptive Proportion Test done status. (APT test pass count &gt;= APT done threshold setting)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUFFER_OVERFLOW</name>
              <description>Buffer overflow status. It is clear by RNG read out.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUFFER_ENTRY_LEVEL</name>
              <description>Number of 32-bit random number are valid.
0: empty
8: full</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECURITY_CONTROL</name>
              <description>If this field is equal to 0xA, the TRNG becomes a non-secure slave, and all the registers can be accessed by non-secure transaction.
If this field is not equal to 0xA, the non-seucre transaction can only access address 0xC~0x30.
This register is available only when NONSEC_RNG_BUFFER config is 1 that support TrustZone and dual buffer.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LWC_cond_rate</name>
              <description>Compression rate of lightweight-cipher conditioning component.
Set this register to 0 will bypass lightweight-cipher conditioning component.
Set this register larger than 0 will enable extra trng conditioning.
This register is available only when LWC_COND config is 1.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFSR_BYPASS</name>
              <description>LFSR bypass enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBIAS_CORRECTOR_BYPASS</name>
              <description>Debias corrector bypass enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOISE_COLLECTOR_OUTPUT_DISABLE</name>
              <description>Noise collector output disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_RST</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>Software Reset Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_RESET</name>
              <description>Write 1 to reset TRNG. It triggers a reset generator to reset all the componets of TRNG except control register.
The register settings remain unchange, but other function blocks incuding noise collector(ROSC sampler), debias modules and health tests will be reset.
When SW changes the setting of RCT/APT, it's recommanded to clear error first, and then wirte this register to trigger a reset after apply new setting.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSR_CTRL</name>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <description>LFSR Control Register</description>
          <resetValue>0x00000140</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREE_RUN</name>
              <description>0x1: continuously run LFSR when no input data
0x0: only shift LFSR when input 1 bit data</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT_DROP_COUNT</name>
              <description>Discard number of bit after reset or re-init. Default shift out 64 bits in LFSR.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCT0</name>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <description>Repetition Count Test 0 Control Register</description>
          <resetValue>0x00001F01</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RCT0_CUTOFF_VALUE</name>
              <description>Cutoff value</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCT0_SAMPLE_SIZE</name>
              <description>Number of bit per test sample. The sample size is the value add 1.
0: 1-bit
1: 2-bit
...
7: 8-bit</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCT0_ENABLE</name>
              <description>Test enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCT1</name>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <description>Repetition Count Test 1 Control Register</description>
          <resetValue>0x0000050F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RCT1_CUTOFF_VALUE</name>
              <description>Cutoff value</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCT1_SAMPLE_SIZE</name>
              <description>Number of bit per test sample. The sample size is the value add 1.
0: 1-bit
1: 2-bit
...
7: 8-bit</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCT1_ENABLE</name>
              <description>Test enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APT</name>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <description>Adaptive Proportion Test Control Register</description>
          <resetValue>0x124D0003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APT0_DONE_THRESHOLD</name>
              <description>Assert test done after how many test pass</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APT0_CUTOFF_VALUE</name>
              <description>Cutoff value</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APT0_SAMPLE_SIZE</name>
              <description>Number of bit per test sample. The sample size is the value add 1.
0: 1-bit
1: 2-bit
...
7: 8-bit</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APT0_WINDOW_SIZE</name>
              <description>0: 512 bits
1: 1024 bits</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APT0_ENABLE</name>
              <description>Test enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN_CTRL0</name>
          <addressOffset>0x000001F4</addressOffset>
          <size>32</size>
          <description>Ring Enable Control Register 0</description>
          <resetValue>0x3FFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RING50_ENABLE_0</name>
              <description>Enable Ring #29~0</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN_CTRL1</name>
          <addressOffset>0x000001F8</addressOffset>
          <size>32</size>
          <description>Ring Enable Control Register 1</description>
          <resetValue>0x001FFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RING50_RNG_ENABLE</name>
              <description>Enable Ring50 noise source</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RING50_ENABLE_1</name>
              <description>Enable Ring #49~30</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Ring_Sample_CLK_CTRL</name>
          <addressOffset>0x000001FC</addressOffset>
          <size>32</size>
          <description>Sample clock control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLOCK_SAMPLE_RATE_CONTROL</name>
              <description>For fine-tune rocs sample clock
ROSC sample clock frequency = TRNG APB clock frequency/(Clock sample rate control + 1)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
