Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RSIP_REG</name>
      <baseAddress>0x41894000</baseAddress>
      <size>0x00000300</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000300</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SR</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Status Register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>idle</name>
              <description>Indicates whether there is any outstanding transaction.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>key_init_done</name>
              <description>Indicates whether the initialization of the key is completed.
Only used in MIX mode.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>intr_err_tag</name>
              <description>Indicates a GCM tag mismatch error occurred.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>intr_err_resp</name>
              <description>Indicates a the error response is received from slave.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>intr_err_apb</name>
              <description>Indicates whether the setting configuration failed.
When a transaction is in progress, all settings except clear interruption are invalid.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>intr_err_init</name>
              <description>Indicates the transaction was received before the key initialization is completed.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>remap_region_error</name>
              <description>Indicates the read address hits multiple remapping region.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>remap_addr_error</name>
              <description>Indicates the address after adding offset size cross 256MB boundaries</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>control_locked</name>
              <description>Indicates whether the setting is locked.
If it is locked, only Clr_intr and Maintenance registers can be set</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>key_locked</name>
              <description>Indicates whether the keyx is locked.
If it is locked, keyx cannot be written or read</description>
              <bitRange>[16:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIR</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Component Identification Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_number</name>
              <description>Number of supported decryption regions</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>remap_number</name>
              <description>Number of supported remap regions</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>iv_number</name>
              <description>Number of supported IVs registers</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTR_key_number</name>
              <description>Number of supported CTR key registers,
valid when support_ctr or support_gcm is 1</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MIX_key_number</name>
              <description>Number of supported MIX key registers,
valid when support_mix is 1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>support_ctr</name>
              <description>Indicate whether CTR mode is supported.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>support_mix</name>
              <description>Indicate whether MIX mode is supported.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>support_gcm</name>
              <description>Indicate whether GCM mode is supported.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>key_source</name>
              <description>Indicates the key source
0: from dedicated key port
1: from APB register</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>line_size</name>
              <description>Cache line size
0: 16B = 1 AES block
1: 32B = 2 AES blocks
2: 64B = 4 AES blocks
3: 128B = 8 AES blocks
Indicates how many 128-bit blocks are used to calculate the tag
cache line size (Byte) = 16 * 2BLOCK_SIZE</description>
              <bitRange>[26:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>independent_tag_addr</name>
              <description>Indicates the storage location of the tag
0: consecutive space - interleaved with each data blocks1: separate space from data - use another base address</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EALR</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>Error Address Log Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>error_address</name>
              <description>Recorded address when GCM Tag mismatch error or receiving an error response.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Interrupt Clear Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>clr_intr</name>
              <description>Interrupt clear.It has to write 1'b1 to this register every time when the error exception occurs.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>Control Register</description>
          <resetValue>0x00000040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tag_size</name>
              <description>Tag size.
The size of the tag will affect the length of each tag command.
0: 32 bits
1: 64 bits
2: 128bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>axi_byte_swap</name>
              <description>Determine the endian of ciphertext in slave memory.
If set to 1, can swap byte order.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>axi_word_swap</name>
              <description>Determine the endian of ciphertext in slave memory.
If set to 1, can swap word order.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>key_size</name>
              <description>Determine the size of KEY
0: 128 bits
1: 192 bits
2: 256 bits</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>aes_en</name>
              <description>Determine whether to enable the AES engine
0: disable decryption engine (expect remapping function)
1: enable decryption engine and line buffer</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>icg_ctrl_0</name>
              <description>Disable line-buffer auto clock gating</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>icg_ctrl_1</name>
              <description>Disable fetch-unit auto clock gating</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>icg_ctrl_2</name>
              <description>Disable aes-engine auto clock gating</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>icg_ctrl_3</name>
              <description>Disable apb-ctrl auto clock gating</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>icg_ctrl_4</name>
              <description>Disable key-reg auto clock gating</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MOR</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>Maintenance Operation Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dec_key_init</name>
              <description>Only used in MIX mode.
Whenever the key is changed, write 1 to this bit to initialize the decryption key.
When keys are update by external port, sec engine will trigger this bit automatically.
The status of completion can be determined by reading bit 1 of the status register.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>clean_cache_line</name>
              <description>Manually clear the line buffer. Write 1 to clear all after flash data update.</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LR</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>Lock Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lock_control</name>
              <description>When set DC to this field, all registers except Clr_intr, Maintenance and keys are not allowed to be written.
Once the lock is set, the way to unlock is reset the flash SEC engine.
If SW wants to modified the setting of control registers, it should keep this lock unset.</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDR</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>Gen Date Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>date</name>
              <description>Date of code generation</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>year</name>
              <description>Year of code generation</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VR</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>Version Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>version</name>
              <description>Version of code generation</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Lock_key0</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>Lock key 0 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lock_key0</name>
              <description>When set DC to this field, key_x are not allowed to be written or read.
Once the lock is set, the way to unlock is reset the flash SEC engine.
If SW wants to modified the key registers, it should keep this lock unset.</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Lock_key1</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>Lock key 1 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lock_key1</name>
              <description>When set DC to this field, key_x are not allowed to be written or read.
Once the lock is set, the way to unlock is reset the flash SEC engine.
If SW wants to modified the key registers, it should keep this lock unset.</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Lock_key2</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>Lock key 2 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lock_key2</name>
              <description>When set DC to this field, key_x are not allowed to be written or read.
Once the lock is set, the way to unlock is reset the flash SEC engine.
If SW wants to modified the key registers, it should keep this lock unset.</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Lock_key3</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>Lock key 3 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lock_key3</name>
              <description>When set DC to this field, key_x are not allowed to be written or read.
Once the lock is set, the way to unlock is reset the flash SEC engine.
If SW wants to modified the key registers, it should keep this lock unset.</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Lock_key4</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Lock key 4 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lock_key4</name>
              <description>When set DC to this field, key_x are not allowed to be written or read.
Once the lock is set, the way to unlock is reset the flash SEC engine.
If SW wants to modified the key registers, it should keep this lock unset.</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Lock_key5</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Lock key 5 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lock_key5</name>
              <description>When set DC to this field, key_x are not allowed to be written or read.
Once the lock is set, the way to unlock is reset the flash SEC engine.
If SW wants to modified the key registers, it should keep this lock unset.</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Lock_key6</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Lock key 6 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lock_key6</name>
              <description>When set DC to this field, key_x are not allowed to be written or read.
Once the lock is set, the way to unlock is reset the flash SEC engine.
If SW wants to modified the key registers, it should keep this lock unset.</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Lock_key7</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>Lock key 7 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lock_key7</name>
              <description>When set DC to this field, key_x are not allowed to be written or read.
Once the lock is set, the way to unlock is reset the flash SEC engine.
If SW wants to modified the key registers, it should keep this lock unset.</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_0_L</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>IV 0 Bit [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__0__low</name>
              <description>Fixed field of IV value.
iv_x [95:64]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_0_H</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>IV 0 Bit [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__0__high</name>
              <description>Fixed field of IV value.
iv__0_ [127:96]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_1_L</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>IV 1 Bit [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__1__low</name>
              <description>Fixed field of IV value.
iv_x [95:64]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_1_H</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>IV 1 Bit [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__1__high</name>
              <description>Fixed field of IV value.
iv__1_ [127:96]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
