Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>IV_2_L</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>IV 2 Bit [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__2__low</name>
              <description>Fixed field of IV value.
iv_x [95:64]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_2_H</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>IV 2 Bit [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__2__high</name>
              <description>Fixed field of IV value.
iv__2_ [127:96]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_3_L</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description>IV 3 Bit [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__3__low</name>
              <description>Fixed field of IV value.
iv_x [95:64]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_3_H</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>IV 3 Bit [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__3__high</name>
              <description>Fixed field of IV value.
iv__3_ [127:96]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_4_L</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>IV 4 Bit [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__4__low</name>
              <description>Fixed field of IV value.
iv_x [95:64]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_4_H</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>IV 4 Bit [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__4__high</name>
              <description>Fixed field of IV value.
iv__4_ [127:96]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_5_L</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>IV 5 Bit [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__5__low</name>
              <description>Fixed field of IV value.
iv_x [95:64]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_5_H</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>IV 5 Bit [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__5__high</name>
              <description>Fixed field of IV value.
iv__5_ [127:96]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_6_L</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>IV 6 Bit [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__6__low</name>
              <description>Fixed field of IV value.
iv_x [95:64]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_6_H</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>IV 6 Bit [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__6__high</name>
              <description>Fixed field of IV value.
iv__6_ [127:96]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_7_L</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description>IV 7 Bit [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__7__low</name>
              <description>Fixed field of IV value.
iv_x [95:64]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_7_H</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description>IV 7 Bit [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv__7__high</name>
              <description>Fixed field of IV value.
iv__7_ [127:96]
If LINE_SIZE = 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (2)32
If LINE_SIZE &gt; 32B, IV = iv_x_high32 || iv_x_low32 || (address &gt;&gt; (4+log2(LINE_SIZE/16)))32 || (address[4+log2(LINE_SIZE/16)-1:4] + 2)32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_0_base</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description>Region 0 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_0_base</name>
              <description>Region 0 base address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_0_end</name>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <description>Region 0 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_0_end</name>
              <description>Region 0 end address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_0_config</name>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <description>Region 0 setting register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_0_enable</name>
              <description>Enable region x setting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_0_mode</name>
              <description>Mode used in region 0
2'b00: GCM mode
2'b01: CTR mode
2'b10: MIX mode
2'b11: Reserved</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_0_iv_num</name>
              <description>IV used in region 0
Apply which IV reigster to this region
Number corresponds to IV register</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_0_key_num</name>
              <description>Key used in region 0
Apply which key reigster to this region
Number corresponds to key register</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_0_tag_base</name>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <description>Region 0 GCM tag base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_0_tag_base_addr</name>
              <description>Region 0 GCM tag base address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_1_base</name>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <description>Region 1 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_1_base</name>
              <description>Region 1 base address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_1_end</name>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <description>Region 1 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_1_end</name>
              <description>Region 1 end address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_1_config</name>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <description>Region 1 setting register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_1_enable</name>
              <description>Enable region x setting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_1_mode</name>
              <description>Mode used in region 1
2'b00: GCM mode
2'b01: CTR mode
2'b10: MIX mode
2'b11: Reserved</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_1_iv_num</name>
              <description>IV used in region 1
Apply which IV reigster to this region
Number corresponds to IV register</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_1_key_num</name>
              <description>Key used in region 1
Apply which key reigster to this region
Number corresponds to key register</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_1_tag_base</name>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <description>Region 1 GCM tag base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_1_tag_base_addr</name>
              <description>Region 1 GCM tag base address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_2_base</name>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <description>Region 2 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_2_base</name>
              <description>Region 2 base address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_2_end</name>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <description>Region 2 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_2_end</name>
              <description>Region 2 end address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_2_config</name>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <description>Region 2 setting register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_2_enable</name>
              <description>Enable region x setting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_2_mode</name>
              <description>Mode used in region 2
2'b00: GCM mode
2'b01: CTR mode
2'b10: MIX mode
2'b11: Reserved</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_2_iv_num</name>
              <description>IV used in region 2
Apply which IV reigster to this region
Number corresponds to IV register</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_2_key_num</name>
              <description>Key used in region 2
Apply which key reigster to this region
Number corresponds to key register</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_2_tag_base</name>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <description>Region 2 GCM tag base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_2_tag_base_addr</name>
              <description>Region 2 GCM tag base address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_3_base</name>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <description>Region 3 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_3_base</name>
              <description>Region 3 base address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_3_end</name>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <description>Region 3 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_3_end</name>
              <description>Region 3 end address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_3_config</name>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <description>Region 3 setting register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_3_enable</name>
              <description>Enable region x setting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_3_mode</name>
              <description>Mode used in region 3
2'b00: GCM mode
2'b01: CTR mode
2'b10: MIX mode
2'b11: Reserved</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_3_iv_num</name>
              <description>IV used in region 3
Apply which IV reigster to this region
Number corresponds to IV register</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_3_key_num</name>
              <description>Key used in region 3
Apply which key reigster to this region
Number corresponds to key register</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_3_tag_base</name>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <description>Region 3 GCM tag base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_3_tag_base_addr</name>
              <description>Region 3 GCM tag base address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_4_base</name>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <description>Region 4 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_4_base</name>
              <description>Region 4 base address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
