Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>Region_4_end</name>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <description>Region 4 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_4_end</name>
              <description>Region 4 end address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_4_config</name>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <description>Region 4 setting register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_4_enable</name>
              <description>Enable region x setting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_4_mode</name>
              <description>Mode used in region 4
2'b00: GCM mode
2'b01: CTR mode
2'b10: MIX mode
2'b11: Reserved</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_4_iv_num</name>
              <description>IV used in region 4
Apply which IV reigster to this region
Number corresponds to IV register</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_4_key_num</name>
              <description>Key used in region 4
Apply which key reigster to this region
Number corresponds to key register</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_4_tag_base</name>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <description>Region 4 GCM tag base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_4_tag_base_addr</name>
              <description>Region 4 GCM tag base address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_5_base</name>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <description>Region 5 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_5_base</name>
              <description>Region 5 base address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_5_end</name>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <description>Region 5 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_5_end</name>
              <description>Region 5 end address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_5_config</name>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <description>Region 5 setting register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_5_enable</name>
              <description>Enable region x setting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_5_mode</name>
              <description>Mode used in region 5
2'b00: GCM mode
2'b01: CTR mode
2'b10: MIX mode
2'b11: Reserved</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_5_iv_num</name>
              <description>IV used in region 5
Apply which IV reigster to this region
Number corresponds to IV register</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_5_key_num</name>
              <description>Key used in region 5
Apply which key reigster to this region
Number corresponds to key register</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_5_tag_base</name>
          <addressOffset>0x0000015C</addressOffset>
          <size>32</size>
          <description>Region 5 GCM tag base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_5_tag_base_addr</name>
              <description>Region 5 GCM tag base address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_6_base</name>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <description>Region 6 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_6_base</name>
              <description>Region 6 base address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_6_end</name>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <description>Region 6 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_6_end</name>
              <description>Region 6 end address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_6_config</name>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <description>Region 6 setting register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_6_enable</name>
              <description>Enable region x setting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_6_mode</name>
              <description>Mode used in region 6
2'b00: GCM mode
2'b01: CTR mode
2'b10: MIX mode
2'b11: Reserved</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_6_iv_num</name>
              <description>IV used in region 6
Apply which IV reigster to this region
Number corresponds to IV register</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_6_key_num</name>
              <description>Key used in region 6
Apply which key reigster to this region
Number corresponds to key register</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_6_tag_base</name>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <description>Region 6 GCM tag base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_6_tag_base_addr</name>
              <description>Region 6 GCM tag base address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_7_base</name>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <description>Region 7 base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_7_base</name>
              <description>Region 7 base address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_7_end</name>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <description>Region 7 end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_7_end</name>
              <description>Region 7 end address register.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_7_config</name>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <description>Region 7 setting register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_7_enable</name>
              <description>Enable region x setting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_7_mode</name>
              <description>Mode used in region 7
2'b00: GCM mode
2'b01: CTR mode
2'b10: MIX mode
2'b11: Reserved</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_7_iv_num</name>
              <description>IV used in region 7
Apply which IV reigster to this region
Number corresponds to IV register</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>region_7_key_num</name>
              <description>Key used in region 7
Apply which key reigster to this region
Number corresponds to key register</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Region_7_tag_base</name>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <description>Region 7 GCM tag base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>region_7_tag_base_addr</name>
              <description>Region 7 GCM tag base address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_0_BAR</name>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <description>REMAP 0 region base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_base__0__addr</name>
              <description>Remap region x base address [27:5]
Region_Base_Addr = {flash_base[31:28], remap_base_x_addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_0_EAR</name>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <description>REMAP 0 region end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_end__0__addr</name>
              <description>Remap region _0_ end address [27:5]
Region_End_Addr = {flash_base[31:28], remap_end__0__addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_0_OR</name>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <description>REMAP 0 OR register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap__0__enable</name>
              <description>Remap region _0_ enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>remap__0__offset</name>
              <description>Remap region _0_ offset [27:5]
Region_Offset = {4'b0,remap__0__offset, {5{1'b0}} }The output address is "Access address - Region_Base_Addr + Region_Offset"</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_1_BAR</name>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <description>REMAP 1 region base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_base__1__addr</name>
              <description>Remap region x base address [27:5]
Region_Base_Addr = {flash_base[31:28], remap_base_x_addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_1_EAR</name>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <description>REMAP 1 region end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_end__1__addr</name>
              <description>Remap region _1_ end address [27:5]
Region_End_Addr = {flash_base[31:28], remap_end__1__addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_1_OR</name>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <description>REMAP 1 OR register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap__1__enable</name>
              <description>Remap region _1_ enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>remap__1__offset</name>
              <description>Remap region _1_ offset [27:5]
Region_Offset = {4'b0,remap__1__offset, {5{1'b0}} }The output address is "Access address - Region_Base_Addr + Region_Offset"</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_2_EAR</name>
          <addressOffset>0x0000019C</addressOffset>
          <size>32</size>
          <description>REMAP 2 region end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_end__2__addr</name>
              <description>Remap region _2_ end address [27:5]
Region_End_Addr = {flash_base[31:28], remap_end__2__addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_2_OR</name>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <description>REMAP 2 OR register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap__2__enable</name>
              <description>Remap region _2_ enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>remap__2__offset</name>
              <description>Remap region _2_ offset [27:5]
Region_Offset = {4'b0,remap__2__offset, {5{1'b0}} }The output address is "Access address - Region_Base_Addr + Region_Offset"</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_3_BAR</name>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <description>REMAP 3 region base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_base__3__addr</name>
              <description>Remap region x base address [27:5]
Region_Base_Addr = {flash_base[31:28], remap_base_x_addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_3_EAR</name>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <description>REMAP 3 region end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_end__3__addr</name>
              <description>Remap region _3_ end address [27:5]
Region_End_Addr = {flash_base[31:28], remap_end__3__addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_3_OR</name>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <description>REMAP 3 OR register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap__3__enable</name>
              <description>Remap region _3_ enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>remap__3__offset</name>
              <description>Remap region _3_ offset [27:5]
Region_Offset = {4'b0,remap__3__offset, {5{1'b0}} }The output address is "Access address - Region_Base_Addr + Region_Offset"</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_4_BAR</name>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <description>REMAP 4 region base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_base__4__addr</name>
              <description>Remap region x base address [27:5]
Region_Base_Addr = {flash_base[31:28], remap_base_x_addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_4_EAR</name>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <description>REMAP 4 region end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_end__4__addr</name>
              <description>Remap region _4_ end address [27:5]
Region_End_Addr = {flash_base[31:28], remap_end__4__addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_4_OR</name>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <description>REMAP 4 OR register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap__4__enable</name>
              <description>Remap region _4_ enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>remap__4__offset</name>
              <description>Remap region _4_ offset [27:5]
Region_Offset = {4'b0,remap__4__offset, {5{1'b0}} }The output address is "Access address - Region_Base_Addr + Region_Offset"</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
