Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REMAP_5_BAR</name>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <description>REMAP 5 region base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_base__5__addr</name>
              <description>Remap region x base address [27:5]
Region_Base_Addr = {flash_base[31:28], remap_base_x_addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_5_EAR</name>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <description>REMAP 5 region end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_end__5__addr</name>
              <description>Remap region _5_ end address [27:5]
Region_End_Addr = {flash_base[31:28], remap_end__5__addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_5_OR</name>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <description>REMAP 5 OR register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap__5__enable</name>
              <description>Remap region _5_ enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>remap__5__offset</name>
              <description>Remap region _5_ offset [27:5]
Region_Offset = {4'b0,remap__5__offset, {5{1'b0}} }The output address is "Access address - Region_Base_Addr + Region_Offset"</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_6_BAR</name>
          <addressOffset>0x000001C8</addressOffset>
          <size>32</size>
          <description>REMAP 6 region base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_base__6__addr</name>
              <description>Remap region x base address [27:5]
Region_Base_Addr = {flash_base[31:28], remap_base_x_addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_6_EAR</name>
          <addressOffset>0x000001CC</addressOffset>
          <size>32</size>
          <description>REMAP 6 region end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_end__6__addr</name>
              <description>Remap region _6_ end address [27:5]
Region_End_Addr = {flash_base[31:28], remap_end__6__addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_6_OR</name>
          <addressOffset>0x000001D0</addressOffset>
          <size>32</size>
          <description>REMAP 6 OR register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap__6__enable</name>
              <description>Remap region _6_ enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>remap__6__offset</name>
              <description>Remap region _6_ offset [27:5]
Region_Offset = {4'b0,remap__6__offset, {5{1'b0}} }The output address is "Access address - Region_Base_Addr + Region_Offset"</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_7_BAR</name>
          <addressOffset>0x000001D4</addressOffset>
          <size>32</size>
          <description>REMAP 7 region base address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_base__7__addr</name>
              <description>Remap region x base address [27:5]
Region_Base_Addr = {flash_base[31:28], remap_base_x_addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_7_EAR</name>
          <addressOffset>0x000001D8</addressOffset>
          <size>32</size>
          <description>REMAP 7 region end address register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap_end__7__addr</name>
              <description>Remap region _7_ end address [27:5]
Region_End_Addr = {flash_base[31:28], remap_end__7__addr, {5{1'b0}} }
The region address is configurable, and not cross 256KB</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP_7_OR</name>
          <addressOffset>0x000001DC</addressOffset>
          <size>32</size>
          <description>REMAP 7 OR register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>remap__7__enable</name>
              <description>Remap region _7_ enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>remap__7__offset</name>
              <description>Remap region _7_ offset [27:5]
Region_Offset = {4'b0,remap__7__offset, {5{1'b0}} }The output address is "Access address - Region_Base_Addr + Region_Offset"</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key0_0</name>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <description>Key0 [31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key0_0</name>
              <description>Key0 register [31:0]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key0_1</name>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <description>Key0 [63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key0_1</name>
              <description>Key0 register [63:32]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key0_2</name>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <description>Key0 [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key0_2</name>
              <description>Key0 register [95:64] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key0_3</name>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <description>Key0 [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key0_3</name>
              <description>Key0 register [127:96] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key0_4</name>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <description>Key0 [159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key0_4</name>
              <description>Key0 register 159:128]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key0_5</name>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <description>Key0 [191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key0_5</name>
              <description>Key0 register [191:160]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key0_6</name>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <description>Key0 [223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key0_6</name>
              <description>Key0 register [223:192]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key0_7</name>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <description>Key0 [255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key0_7</name>
              <description>Key0 register [255:224]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key1_0</name>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <description>Key1 [31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key1_0</name>
              <description>Key1 register [31:0]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key1_1</name>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <description>Key1 [63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key1_1</name>
              <description>Key1 register [63:32]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key1_2</name>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <description>Key1 [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key1_2</name>
              <description>Key1 register [95:64] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key1_3</name>
          <addressOffset>0x0000022C</addressOffset>
          <size>32</size>
          <description>Key1 [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key1_3</name>
              <description>Key1 register [127:96] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key1_4</name>
          <addressOffset>0x00000230</addressOffset>
          <size>32</size>
          <description>Key1 [159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key1_4</name>
              <description>Key1 register 159:128]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key1_5</name>
          <addressOffset>0x00000234</addressOffset>
          <size>32</size>
          <description>Key1 [191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key1_5</name>
              <description>Key1 register [191:160]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key1_6</name>
          <addressOffset>0x00000238</addressOffset>
          <size>32</size>
          <description>Key1 [223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key1_6</name>
              <description>Key1 register [223:192]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key1_7</name>
          <addressOffset>0x0000023C</addressOffset>
          <size>32</size>
          <description>Key1 [255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key1_7</name>
              <description>Key1 register [255:224]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key2_0</name>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <description>Key2 [31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key2_0</name>
              <description>Key2 register [31:0]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key2_1</name>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <description>Key2 [63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key2_1</name>
              <description>Key2 register [63:32]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key2_2</name>
          <addressOffset>0x00000248</addressOffset>
          <size>32</size>
          <description>Key2 [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key2_2</name>
              <description>Key2 register [95:64] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key2_3</name>
          <addressOffset>0x0000024C</addressOffset>
          <size>32</size>
          <description>Key2 [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key2_3</name>
              <description>Key2 register [127:96] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key2_4</name>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <description>Key2 [159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key2_4</name>
              <description>Key2 register 159:128]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key2_5</name>
          <addressOffset>0x00000254</addressOffset>
          <size>32</size>
          <description>Key2 [191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key2_5</name>
              <description>Key2 register [191:160]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key2_6</name>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <description>Key2 [223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key2_6</name>
              <description>Key2 register [223:192]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key2_7</name>
          <addressOffset>0x0000025C</addressOffset>
          <size>32</size>
          <description>Key2 [255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key2_7</name>
              <description>Key2 register [255:224]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key3_0</name>
          <addressOffset>0x00000260</addressOffset>
          <size>32</size>
          <description>Key3 [31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key3_0</name>
              <description>Key3 register [31:0]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key3_1</name>
          <addressOffset>0x00000264</addressOffset>
          <size>32</size>
          <description>Key3 [63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key3_1</name>
              <description>Key3 register [63:32]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key3_2</name>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <description>Key3 [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key3_2</name>
              <description>Key3 register [95:64] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key3_3</name>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <description>Key3 [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key3_3</name>
              <description>Key3 register [127:96] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
