Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>Key3_4</name>
          <addressOffset>0x00000270</addressOffset>
          <size>32</size>
          <description>Key3 [159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key3_4</name>
              <description>Key3 register 159:128]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key3_5</name>
          <addressOffset>0x00000274</addressOffset>
          <size>32</size>
          <description>Key3 [191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key3_5</name>
              <description>Key3 register [191:160]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key3_6</name>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <description>Key3 [223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key3_6</name>
              <description>Key3 register [223:192]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key3_7</name>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <description>Key3 [255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key3_7</name>
              <description>Key3 register [255:224]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key4_0</name>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <description>Key4 [31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key4_0</name>
              <description>Key4 register [31:0]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key4_1</name>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <description>Key4 [63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key4_1</name>
              <description>Key4 register [63:32]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key4_2</name>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <description>Key4 [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key4_2</name>
              <description>Key4 register [95:64] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key4_3</name>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <description>Key4 [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key4_3</name>
              <description>Key4 register [127:96] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key4_4</name>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <description>Key4 [159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key4_4</name>
              <description>Key4 register 159:128]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key4_5</name>
          <addressOffset>0x00000294</addressOffset>
          <size>32</size>
          <description>Key4 [191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key4_5</name>
              <description>Key4 register [191:160]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key4_6</name>
          <addressOffset>0x00000298</addressOffset>
          <size>32</size>
          <description>Key4 [223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key4_6</name>
              <description>Key4 register [223:192]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key4_7</name>
          <addressOffset>0x0000029C</addressOffset>
          <size>32</size>
          <description>Key4 [255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key4_7</name>
              <description>Key4 register [255:224]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key5_0</name>
          <addressOffset>0x000002A0</addressOffset>
          <size>32</size>
          <description>Key5 [31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key5_0</name>
              <description>Key5 register [31:0]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key5_1</name>
          <addressOffset>0x000002A4</addressOffset>
          <size>32</size>
          <description>Key5 [63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key5_1</name>
              <description>Key5 register [63:32]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key5_2</name>
          <addressOffset>0x000002A8</addressOffset>
          <size>32</size>
          <description>Key5 [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key5_2</name>
              <description>Key5 register [95:64] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key5_3</name>
          <addressOffset>0x000002AC</addressOffset>
          <size>32</size>
          <description>Key5 [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key5_3</name>
              <description>Key5 register [127:96] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key5_4</name>
          <addressOffset>0x000002B0</addressOffset>
          <size>32</size>
          <description>Key5 [159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key5_4</name>
              <description>Key5 register 159:128]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key5_5</name>
          <addressOffset>0x000002B4</addressOffset>
          <size>32</size>
          <description>Key5 [191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key5_5</name>
              <description>Key5 register [191:160]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key5_6</name>
          <addressOffset>0x000002B8</addressOffset>
          <size>32</size>
          <description>Key5 [223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key5_6</name>
              <description>Key5 register [223:192]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key5_7</name>
          <addressOffset>0x000002BC</addressOffset>
          <size>32</size>
          <description>Key5 [255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key5_7</name>
              <description>Key5 register [255:224]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key6_0</name>
          <addressOffset>0x000002C0</addressOffset>
          <size>32</size>
          <description>Key6 [31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key6_0</name>
              <description>Key6 register [31:0]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key6_1</name>
          <addressOffset>0x000002C4</addressOffset>
          <size>32</size>
          <description>Key6 [63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key6_1</name>
              <description>Key6 register [63:32]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key6_2</name>
          <addressOffset>0x000002C8</addressOffset>
          <size>32</size>
          <description>Key6 [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key6_2</name>
              <description>Key6 register [95:64] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key6_3</name>
          <addressOffset>0x000002CC</addressOffset>
          <size>32</size>
          <description>Key6 [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key6_3</name>
              <description>Key6 register [127:96] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key6_4</name>
          <addressOffset>0x000002D0</addressOffset>
          <size>32</size>
          <description>Key6 [159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key6_4</name>
              <description>Key6 register 159:128]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key6_5</name>
          <addressOffset>0x000002D4</addressOffset>
          <size>32</size>
          <description>Key6 [191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key6_5</name>
              <description>Key6 register [191:160]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key6_6</name>
          <addressOffset>0x000002D8</addressOffset>
          <size>32</size>
          <description>Key6 [223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key6_6</name>
              <description>Key6 register [223:192]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key6_7</name>
          <addressOffset>0x000002DC</addressOffset>
          <size>32</size>
          <description>Key6 [255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key6_7</name>
              <description>Key6 register [255:224]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key7_0</name>
          <addressOffset>0x000002E0</addressOffset>
          <size>32</size>
          <description>Key7 [31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key7_0</name>
              <description>Key7 register [31:0]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key7_1</name>
          <addressOffset>0x000002E4</addressOffset>
          <size>32</size>
          <description>Key7 [63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key7_1</name>
              <description>Key7 register [63:32]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key7_2</name>
          <addressOffset>0x000002E8</addressOffset>
          <size>32</size>
          <description>Key7 [95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key7_2</name>
              <description>Key7 register [95:64] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key7_3</name>
          <addressOffset>0x000002EC</addressOffset>
          <size>32</size>
          <description>Key7 [127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key7_3</name>
              <description>Key7 register [127:96] 
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key7_4</name>
          <addressOffset>0x000002F0</addressOffset>
          <size>32</size>
          <description>Key7 [159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key7_4</name>
              <description>Key7 register 159:128]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key7_5</name>
          <addressOffset>0x000002F4</addressOffset>
          <size>32</size>
          <description>Key7 [191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key7_5</name>
              <description>Key7 register [191:160]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key7_6</name>
          <addressOffset>0x000002F8</addressOffset>
          <size>32</size>
          <description>Key7 [223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key7_6</name>
              <description>Key7 register [223:192]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key7_7</name>
          <addressOffset>0x000002FC</addressOffset>
          <size>32</size>
          <description>Key7 [255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>key7_7</name>
              <description>Key7 register [255:224]
CTR of MIX, GCM, CTR mode using the key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
