Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPORT_REG</name>
      <baseAddress>0x41884000</baseAddress>
      <size>0x00000984</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000984</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SP_REG_MUX</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sp_reg_mux</name>
              <description>Mux of register write with different base address of the same SPORT.
"sp_reg_mux" can be set as different value with four different base address in one SPORT,  but other registers share the same value with four different base address in one SPORT.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_CTRL0</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x01010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mclk_sel</name>
              <description>not used, please refer to 0x64
2'b00: MCLK output=dsp_src_clk/4
2'b01: MCLK output=dsp_src_clk/2
2'b10/2'b11: MCLK output=dsp_src_clk</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_sel_i2s_rx_ch</name>
              <description>2'b00: L/R
2'b01: R/L
2'b10: L/L
2'b11: R/R  @ ADC path</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_sel_i2s_tx_ch</name>
              <description>2'b00: L/R
2'b01: R/L
2'b10: L/L
2'b11: R/R  @ DAC path</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_start_rx</name>
              <description>1'b0: RX is disabled
1'b1: RX is started</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_rx_disable</name>
              <description>1'b1: SPORT RX is disabled.
1'b0: SPORT RX is enabled.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_lsb_first_0</name>
              <description>1'b0: MSB first when RX
1'b1: LSB first</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_lsb_first_0</name>
              <description>1'b0: MSB first when TX
1'b1: LSB first</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_tdm_mode_sel_rx</name>
              <description>2'b00: Without TDM
2'b01: TDM4
2'b10: TDM6
2'b11: TDM8</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_tdm_mode_sel_tx</name>
              <description>2'b00: Without TDM
2'b01: TDM4
2'b10: TDM6
2'b11: TDM8</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_start_tx</name>
              <description>1'b0: TX is disabled.
1'b1: TX is started.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_tx_disable</name>
              <description>1'b1: SPORT TX is disabled.
1'b0: SPORT TX is enabled.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_i2s_self_lpbk_en</name>
              <description>1'b1: internal loopback mode is enabled</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_data_len_sel_tx_0</name>
              <description>3'b000: 16 bits
3'b001: 20 bits
3'b010: 24 bits
3'b100: 32 bits</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_en_i2s_mono_tx_0</name>
              <description>1'b1: mono
1'b0: stereo</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_inv_i2s_sclk</name>
              <description>1'b1: I2S/PCM bit clock is inverted</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_data_format_sel_tx</name>
              <description>2'b00: I2S
2'b01: Left Justified
2'b10: PCM mode A
2'b11: PCM mode B</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dsp_ctl_mode</name>
              <description>1'b1: DSP and SPORT1 handshaking is enabled.
1'b0: GDMA and SPORT1 handshaking is enabled.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_loopback</name>
              <description>1'b1: self loopback mode</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_wclk_tx_inverse</name>
              <description>1'b1: I2S/PCM word clock is inverted for TX (SPK path)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>slave_data_sel</name>
              <description>1'b1: To be an I2S or PCM slave (data path)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>slave_clk_sel</name>
              <description>1'b1: To be an I2S or PCM slave (CLK path)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_inv_i2s_sclk</name>
              <description>1'b1: sclk to RX path (ADC path) is inverted</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_inv_i2s_sclk</name>
              <description>1'b1: sclk to TX path (DAC path) is inverted</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_reset</name>
              <description>1'b1: reset SPORT1 module, and remember to write "1" to reset and then write "0" to release from reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_CTRL1</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x1100008C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_fifo_1_reg_1_en</name>
              <description>1'b1: Enable last two channel of RX_FIFO_1. Only enable when "rx_fifo_1_reg_0_en" = 1.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_1_reg_0_en</name>
              <description>1'b1: Enable first two channel of RX_FIFO_1. Only enable when "rx_fifo_0_reg_0_en" = 1.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_0_reg_1_en</name>
              <description>1'b1: Enable last two channel of RX_FIFO_0. Only enable when "rx_fifo_0_reg_0_en" = 1.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_0_reg_0_en</name>
              <description>1'b1: Enable first two channel of RX_FIFO_0. Disable 0x0008[28] ~ Disable 0x0008[31] at the same time to reset RX FIFO.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_1_reg_1_en</name>
              <description>1'b1: Enable last two channel of TX_FIFO_1. Only enable when "tx_fifo_1_reg_0_en" = 1.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_1_reg_0_en</name>
              <description>1'b1: Enable first two channel of TX_FIFO_1. Only enable when "tx_fifo_0_reg_0_en" = 1.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_0_reg_1_en</name>
              <description>1'b1: Enable last two channel of TX_FIFO_0. Only enable when "tx_fifo_0_reg_0_en" = 1.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_0_reg_0_en</name>
              <description>1'b1: Enable first two channel of TX_FIFO_0. Disable 0x0008[24] ~ Disable 0x0008[27] at the same time to reset TX FIFO.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_snk_lr_swap_0</name>
              <description>1'b1: swap L/R audio samples written to the sink memory of RX_FIFO_0;</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_snk_byte_swap_0</name>
              <description>1'b1: swap H/L bytes written to the sink memory of RX_FIFO_0;</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_src_lr_swap_0</name>
              <description>1'b1: swap L/R audio samples read from the source memory of TX_FIFO_0;</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_src_byte_swap_0</name>
              <description>1'b1: swap H/L bytes read from the source memory of TX_FIFO_0;</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_mode_en</name>
              <description>1'b1: WS(LRCK)  and SCK(BCLK) are from other sport</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_direct_src_sel</name>
              <description>2'b00: ws and sck are from sport0.
2'b01: ws and sck are from sport1.
2'b10: ws and sck are from sport2.
2'b11: ws and sck are from sport3.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>err_cnt_sat_set</name>
              <description>1'b1: saturation count (65534 --&gt; 65535 --&gt; 65535 ...)
1'b0: wrap count (65534 --&gt; 65535 --&gt; 0 --&gt; 1 --&gt; 2 ...)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sport_clk_sel</name>
              <description>2'b0x00: dsp_src_clk(BCLK*2)
2'b10: dsp_src_clk(BCLK*4)/2
2'b11: dsp_src_clk (BCLK*8)/4</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>clear_rx_err_cnt</name>
              <description>Write 1'b1 and then write 0 to clear RX error counter</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>clear_tx_err_cnt</name>
              <description>Write 1'b1 and then write 0 to clear TX error counter</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>enable_mclk</name>
              <description>Enable mclk.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>debug_bus_sel</name>
              <description>3'b000: debug_bus_a
3'b001: debug_bus_b
...
3'b111: debug_bus_h</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ws_force_val</name>
              <description>When "ws_force" = 1, ws_out_tx and ws_out_rx = "ws_force_val."</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ws_force</name>
              <description>1'b1: Make ws_out_tx and ws_out_rx = "ws_force_val."</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bclk_reset</name>
              <description>1'b0: Enable bclk
1'b1: Disable and reset bclk</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bclk_pull_zero</name>
              <description>Write 1'b1 to pull bclk to 0 smoothly. Write 1'b0 to reopen bclk.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>multi_io_en_rx</name>
              <description>1'b1: Enable multi-IO of rx
1'b0: Disable multi-IO of rx</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>multi_io_en_tx</name>
              <description>1'b1: Enable multi-IO of tx
1'b0: Disable multi-IO of tx</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_fill_zero</name>
              <description>X is the burst size of TX_FIFO_0. Y is the burst size of TX_FIFO_1. 
Fill TX_FIFO_0 with X zero data and fill TX_FIFO_1 with Y zero data. 
This control bit is "write 1 clear" type</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>sp_reset_smooth</name>
              <description>1'b1: reset SPORT1 module with complete LRCK cycle.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_INT_CTRL</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>int_enable_dsp_1</name>
              <description>Bit[24]: for the interrupt of "sp_ready_to_tx_1"
Bit[25]: for the interrupt of "sp_ready_to_rx_1"
Bit[26]: for the interrupt of "tx_fifo_full_intr_1"
Bit[27]: for the interrupt of "rx_fifo_full_intr_1"
Bit[28]: for the interrupt of "tx_fifo_empty_intr_1"
Bit[29]: for the interrupt of "rx_fifo_empty_intr_1"
Bit[30]: for the interrupt of "tx_i2s_idle_1"
Bit[31]: Reserved</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>int_enable_dsp_0</name>
              <description>Bit[16]: for the interrupt of "sp_ready_to_tx"
Bit[17]: for the interrupt of "sp_ready_to_rx"
Bit[18]: for the interrupt of "tx_fifo_full_intr"
Bit[19]: for the interrupt of "rx_fifo_full_intr"
Bit[20]: for the interrupt of "tx_fifo_empty_intr"
Bit[21]: for the interrupt of "rx_fifo_empty_intr"
Bit[22]: for the interrupt of "tx_i2s_idle"
Bit[23]: Reserved</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lrc_stop_intr</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lrc_start_intr</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>intr_clr_1</name>
              <description>Bit[9]: for the interrupt of "tx_fifo_full_intr_1"
Bit[10]: for the interrupt of "rx_fifo_full_intr_1"
Bit[11]: for the interrupt of "tx_fifo_empty_intr_1"
Bit[12]: for the interrupt of "rx_fifo_empty_intr_1"
Bit[13]: Reserved</description>
              <bitRange>[13:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_dsp_clear_int_1</name>
              <description>For DSP mode (bypass GDMA), F/W writes 1'b1 and then 1'b0 to clear RX interrupt.
Note: RX interrupt is to indicate that DSP can get audio data from RX FIFO_1</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_dsp_clear_int_1</name>
              <description>For DSP mode (bypass GDMA), F/W writes 1'b1 and then 1'b0 to clear TX interrupt.
Note: TX interrupt is to indicate that DSP can write audio data to TX FIFO_1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>intr_clr_0</name>
              <description>Bit[2]: for the interrupt of "tx_fifo_full_intr"
Bit[3]: for the interrupt of "rx_fifo_full_intr"
Bit[4]: for the interrupt of "tx_fifo_empty_intr"
Bit[5]: for the interrupt of "rx_fifo_empty_intr"
Bit[6]: Reserved</description>
              <bitRange>[6:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_dsp_clear_int_0</name>
              <description>For DSP mode (bypass GDMA), F/W writes 1'b1 and then 1'b0 to clear RX interrupt.
Note: RX interrupt is to indicate that DSP can get audio data from RX FIFO_0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_dsp_clear_int_0</name>
              <description>For DSP mode (bypass GDMA), F/W writes 1'b1 and then 1'b0 to clear TX interrupt.
Note: TX interrupt is to indicate that DSP can write audio data to TX FIFO_0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_TRX_COUNTER_STATUS</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sp_reset_state</name>
              <description>1'b1: sp_reset is enable 1'b0: sp_reset is disable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_depth_cnt_1</name>
              <description>RX FIFO_1 depth counter status (MIC path)</description>
              <bitRange>[29:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_depth_cnt_1</name>
              <description>TX FIFO_1 depth counter status (SPK path)</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_depth_cnt_0</name>
              <description>RX FIFO_0 depth counter status (MIC path)</description>
              <bitRange>[13:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_depth_cnt_0</name>
              <description>TX FIFO_0 depth counter status (SPK path)</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_ERR</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_err_cnt</name>
              <description>RX error counter (MIC path)
Note: This counter should always be zero if everything works well.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_err_cnt</name>
              <description>TX error counter (SPK path)
Note: This counter should always be zero if everything works well.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR_TX_BCLK</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00300271</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_mi_ni_update</name>
              <description>1'b1: to update "mi" and "ni" to get the new clock rate.
This bit will be reset automatically when the update is done</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ni</name>
              <description>BCLK = 40MHz*(ni/mi)     
For example:    BCLK=3.072MHz=40MHz*(48/625)</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_mi</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
