Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>SP_TX_LRCLK</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x3F3F1010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_bclk_div_ratio</name>
              <description>RX bclk even-bit integer divider. Used in "mode_40mhz" set as 1'b1. 
(rx_bclk_div_ratio + 1) is the number of "sck_out" cycles within a "ws_out_rx" cycle (1/fs).
Default of (rx_bclk_div_ratio + 1) is 64. Set as 64 - 1 = 63. 
Only odd number supported. Maximum is 255.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_bclk_div_ratio</name>
              <description>TX bclk even-bit integer divider. Used in "mode_40mhz" set as 1'b1. 
(tx_bclk_div_ratio + 1) is the number of "sck_out" cycles within a "ws_out_tx" cycle (1/fs).
Default of (tx_bclk_div_ratio + 1) is 64. Set as 64 - 1 = 63. 
Only odd number supported. Maximum is 255.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wifi_trig_audio_en</name>
              <description>enable wifi trigger to start audio stream</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY1</name>
              <description>-</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rxdma_busrtsize</name>
              <description>RX DMA burst size</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY2</name>
              <description>-</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>txdma_burstsize</name>
              <description>TX DMA burst size</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_FIFO_CTRL</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xCC000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_fifo_empty_0</name>
              <description>1: RX FIFO_0 is empty</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_fifo_empty_0</name>
              <description>1: TX FIFO_0 is empty</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fifo_full_0</name>
              <description>1: RX FIFO_0 is full</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_fifo_full_0</name>
              <description>1: TX FIFO_0 is full</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fifo_empty_1</name>
              <description>1: RX FIFO_1 is empty</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_fifo_empty_1</name>
              <description>1: TX FIFO_1 is empty</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fifo_full_1</name>
              <description>1: RX FIFO_1 is full</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_fifo_full_1</name>
              <description>1: TX FIFO_1 is full</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_i2s_idle_1</name>
              <description>1: TX is working but FIFO_1 is empty.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fifo_empty_intr_1</name>
              <description>1: RX FIFO_1 is empty (MIC path)</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_fifo_empty_intr_1</name>
              <description>1: TX FIFO_1 is empty (SPK path)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fifo_full_intr_1</name>
              <description>1: RX FIFO_1 is full (MIC path)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_fifo_full_intr_1</name>
              <description>1: TX FIFO_1 is full (SPK path)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sp_ready_to_rx_1</name>
              <description>1: It is ready to receive data (MIC path)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sp_ready_to_tx_1</name>
              <description>1: It is ready to send data out (SPK path)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_i2s_idle_0</name>
              <description>1: TX is working but FIFO_0 is empty.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fifo_empty_intr_0</name>
              <description>1: RX FIFO_0 is empty (MIC path)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_fifo_empty_intr_0</name>
              <description>1: TX FIFO_0 is empty (SPK path)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fifo_full_intr_0</name>
              <description>1: RX FIFO_0 is full (MIC path)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_fifo_full_intr_0</name>
              <description>1: TX FIFO_0 is full (SPK path)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sp_ready_to_rx_0</name>
              <description>1: It is ready to receive data (MIC path)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sp_ready_to_tx_0</name>
              <description>1: It is ready to send data out (SPK path)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_FORMAT</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x44000007</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>trx_same_ch_len</name>
              <description>1: TX (SPK path) and RX (MIC path) have the same channel length.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_ch_len_sel_rx</name>
              <description>3'b000: 16 bits
3'b001: 20 bits
3'b010: 24 bits
3'b011: 8 bits
3'b100: 32 bits</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY3</name>
              <description>-</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_ch_len_sel_tx</name>
              <description>3'b000: 16 bits
3'b001: 20 bits
3'b010: 24 bits
3'b011: 8 bits
3'b100: 32 bits</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ideal_len_en</name>
              <description>Function enable of rx_ideal_len.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ideal_len</name>
              <description>sd_in can be received 1 ~ 8 ( = rx_ideal_len + 1 ) BCLK cycle latter.</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ideal_len_en</name>
              <description>Function enable of tx_ideal_len. PCMA SDO will be delayed 1 LRCK.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ideal_len</name>
              <description>sd_out can be sent 1 ~ 8 ( = tx_ideal_len + 1 ) BCLK cycle earlier.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY4</name>
              <description>-</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_data_len_sel_rx_0</name>
              <description>Data length of MIC path and it is valid if "trx_same_length" == 1'b0.
3'b000: 16 bits
3'b001: 20 bits
3'b010: 24 bits
3'b011: 8 bits
3'b100: 32 bits</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_en_i2s_mono_rx_0</name>
              <description>Channel format of MIC path and it is valid if  "trx_same_ch" == 1'b0.
1: mono
0: stereo</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trx_same_lrc</name>
              <description>1:  "ws_out_rx" is as same as "ws_out_tx"</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_data_format_sel_rx</name>
              <description>Data format of MIC path and it is valid if  "trx_same_fs" == 1'b0.
2'b00: I2S
2'b01: Left Justified
2'b10: PCM mode A
2'b11: PCM mode B</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fixed_bclk</name>
              <description>1: Refer to the description of "fixed_bclk_sel"
0: BCLK = dsp_clk/2 when "mode_40mhz = 0"</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fixed_bclk_sel</name>
              <description>0: BCLK is fixed at dsp_src_clk/4
1: BCLK is fixed at dsp_src_clk/2</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_wclk_rx_inverse</name>
              <description>1:  invert the phase of "ws_out_rx" which is also called as "ADCLRC"</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY5</name>
              <description>-</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sck_out_inverse</name>
              <description>1: invert the phase of "sck_out"</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trx_same_length</name>
              <description>1: TX (SPK path) and RX (MIC path) have the same data length.
      Both are either 16 or 24 bits</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trx_same_ch</name>
              <description>1: TX (SPK path) and RX (MIC path) have the same channel setting.
      Both are either stereo or mono</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trx_same_fs</name>
              <description>1: TX (SPK path) and RX (MIC path) have the same sampling rate</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_RX_BCLK</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00300271</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_mi_ni_update</name>
              <description>1'b1: to update "mi" and "ni" to get the new clock rate.
This bit will be reset automatically when the update is done</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ni</name>
              <description>BCLK = 40MHz*(ni/mi)     
For example: BCLK=3.072MHz=40MHz*(48/625)</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_mi</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_RX_LRCLK</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>clr_tx_sport_rdy</name>
              <description>0x001: clear tx_sport_interrupt signal This control bit is "write 1 clear" type 
For read, the read data is from clr_tx_sport_rdy</description>
              <bitRange>[31:31]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>en_tx_sport_interrupt</name>
              <description>Enable tx_sport_interrupt</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_fs_phase_latch</name>
              <description>0x001: Latch the value of tx_fs_phase_rpt, rx_fs_phase_rpt, tx_sport_sounter, rx_sport_sounter at the same time.
This control bit is "write 1 clear" type</description>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>en_tsft_trig_latch</name>
              <description>Enable wifi tsft trigger fs_phase_latch</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fs_phase_rpt_b5</name>
              <description>tx_fs_phase_rptp[5] when using div64 fs_phase_trace_cnt</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_sport_compare_val</name>
              <description>X = (tx_sport_compare_val). When counter equal X. Sport will send tx_sport_interrupt to DSP. 
FW should take care X={32~134217727}</description>
              <bitRange>[26:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_DSP_COUNTER</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_sport_counter</name>
              <description>For DSP read instant tx sport counter value, counter down</description>
              <bitRange>[31:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_fs_phase_rpt</name>
              <description>Report tx phase</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_DIRECT_CTRL0</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x76543210</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ch7_data_sel</name>
              <description>4'h0: tx_fifo_0_reg_0_l
4'h1: tx_fifo_0_reg_0_r
4'h2: tx_fifo_0_reg_1_l
4'h3: tx_fifo_0_reg_1_r 
4'h4: tx_fifo_1_reg_0_l
4'h5: tx_fifo_1_reg_0_r
4'h6: tx_fifo_1_reg_1_l
4'h7: tx_fifo_1_reg_1_r 
4'h8: direct_reg_7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ch6_data_sel</name>
              <description>(Ibid.) 
4'h8: direct_reg_6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ch5_data_sel</name>
              <description>(Ibid.) 
4'h8: direct_reg_5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ch4_data_sel</name>
              <description>(Ibid.) 
4'h8: direct_reg_4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ch3_data_sel</name>
              <description>(Ibid.) 
4'h8: direct_reg_3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ch2_data_sel</name>
              <description>(Ibid.) 
4'h8: direct_reg_2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ch1_data_sel</name>
              <description>(Ibid.) 
4'h8: direct_reg_1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ch0_data_sel</name>
              <description>(Ibid.) 
4'h8: direct_reg_0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_FIFO_IRQ</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_lsb_first_1</name>
              <description>1'b0: MSB first when TX
1'b1: LSB first</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_lsb_first_1</name>
              <description>1'b0: MSB first when TX
1'b1: LSB first</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_snk_lr_swap_1</name>
              <description>1'b1: swap L/R audio samples written to the sink memory of RX_FIFO_1</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_snk_byte_swap_1</name>
              <description>1'b1: swap H/L bytes written to the sink memory of RX_FIFO_1</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_src_lr_swap_1</name>
              <description>1'b1: swap L/R audio samples read from the source memory of TX_FIFO_1</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_src_byte_swap_1</name>
              <description>1'b1: swap H/L bytes read from the source memory of TX_FIFO_1</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY7</name>
              <description>-</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>int_enable_mcu_1</name>
              <description>Bit[8]: for the interrupt of "sp_ready_to_tx"
Bit[9]: for the interrupt of "sp_ready_to_rx"
Bit[10]: for the interrupt of "tx_fifo_full_intr"
Bit[11]: for the interrupt of "rx_fifo_full_intr"
Bit[12]: for the interrupt of "tx_fifo_empty_intr"
Bit[13]: for the interrupt of "rx_fifo_empty_intr"
Bit[14]: for the interrupt of "tx_i2s_idle"
Bit[15]: Reserved</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>int_enable_mcu_0</name>
              <description>Bit[0]: for the interrupt of "sp_ready_to_tx"
Bit[1]: for the interrupt of "sp_ready_to_rx"
Bit[2]: for the interrupt of "tx_fifo_full_intr"
Bit[3]: for the interrupt of "rx_fifo_full_intr"
Bit[4]: for the interrupt of "tx_fifo_empty_intr"
Bit[5]: for the interrupt of "rx_fifo_empty_intr"
Bit[6]: for the interrupt of "tx_i2s_idle"
Bit[7]: Reserved</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
