Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>SP_DIRECT_CTRL1</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sp_en_i2s_mono_rx_1</name>
              <description>Channel format of MIC path and it is valid if  "trx_same_ch" == 1'b0.
1'b1: mono
1'b0: stereo</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_data_len_sel_rx_1</name>
              <description>Data length of MIC path and it is valid if "trx_same_length" == 1'b0.
3'b000: 16 bits
3'b001: 20 bits
3'b010: 24 bits
3'b011: 8 bits
3'b100: 32 bits</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_en_i2s_mono_tx_1</name>
              <description>1'b1: mono
1'b0: stereo</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_data_len_sel_tx_1</name>
              <description>3'b000: 16 bits
3'b001: 20 bits
3'b010: 24 bits
3'b011: 8 bits
3'b100: 32 bits</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_3_en</name>
              <description>1'b1: Enable direct_reg_3.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_3_sel</name>
              <description>5'h0: spa_direct_in_0
5'h1: spa_direct_in_1
5'h2: spa_direct_in_2
5'h3: spa_direct_in_3
5'h4: spa_direct_in_4
5'h5: spa_direct_in_5
5'h6: spa_direct_in_6
5'h7: spa_direct_in_7
5'h8: spb_direct_in_0
5'h9: spb_direct_in_1
5'ha: spb_direct_in_2
5'hb: spb_direct_in_3
5'hc: spb_direct_in_4
5'hd: spb_direct_in_5
5'he: spb_direct_in_6
5'hf: spb_direct_in_7
5'h10: spc_direct_in_0
5'h11: spc_direct_in_1
5'h12: spc_direct_in_2
5'h13: spc_direct_in_3
5'h14: spc_direct_in_4
5'h15: spc_direct_in_5
5'h16: spc_direct_in_6
5'h17: spc_direct_in_7
5'h18: sp0_direct_in_tx_fifo_0_reg_0_l
5'h19: sp0_direct_in_tx_fifo_0_reg_0_r
5'h1a: sp0_direct_in_tx_fifo_0_reg_1_l
5'h1b: sp0_direct_in_tx_fifo_0_reg_1_r
5'h1c: TDM_RX_CH3
SPORT0: a = 1, b = 2, c = 3
SPORT1: a = 0, b = 2, c = 3
SPORT2: a = 0, b = 1, c = 3
SPORT3: a = 0, b = 1, c = 2</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_2_en</name>
              <description>1'b1: Enable direct_reg_2.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_2_sel</name>
              <description>(Ibid.)
5'h1c: TDM_RX_CH2</description>
              <bitRange>[16:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_1_en</name>
              <description>1'b1: Enable direct_reg_1.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_1_sel</name>
              <description>(Ibid.)
5'h1c: TDM_RX_CH1</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_0_en</name>
              <description>1'b1: Enable direct_reg_0.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_0_sel</name>
              <description>(Ibid.)
5'h1c: TDM_RX_CH0</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_DIRECT_CTRL2</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sp_direct_out_7_en</name>
              <description>Enable sp_direct_out_7.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_direct_out_6_en</name>
              <description>Enable sp_direct_out_6.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_direct_out_5_en</name>
              <description>Enable sp_direct_out_5.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_direct_out_4_en</name>
              <description>Enable sp_direct_out_4.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_direct_out_3_en</name>
              <description>Enable sp_direct_out_3.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_direct_out_2_en</name>
              <description>Enable sp_direct_out_2.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_direct_out_1_en</name>
              <description>Enable sp_direct_out_1.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sp_direct_out_0_en</name>
              <description>Enable sp_direct_out_0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_7_en</name>
              <description>1'b1: Enable direct_reg_7.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_7_sel</name>
              <description>5'h0: spa_direct_in_0
5'h1: spa_direct_in_1
5'h2: spa_direct_in_2
5'h3: spa_direct_in_3
5'h4: spa_direct_in_4
5'h5: spa_direct_in_5
5'h6: spa_direct_in_6
5'h7: spa_direct_in_7
5'h8: spb_direct_in_0
5'h9: spb_direct_in_1
5'ha: spb_direct_in_2
5'hb: spb_direct_in_3
5'hc: spb_direct_in_4
5'hd: spb_direct_in_5
5'he: spb_direct_in_6
5'hf: spb_direct_in_7
5'h10: spc_direct_in_0
5'h11: spc_direct_in_1
5'h12: spc_direct_in_2
5'h13: spc_direct_in_3
5'h14: spc_direct_in_4
5'h15: spc_direct_in_5
5'h16: spc_direct_in_6
5'h17: spc_direct_in_7
5'h18: sp0_direct_in_tx_fifo_0_reg_0_l
5'h19: sp0_direct_in_tx_fifo_0_reg_0_r
5'h1a: sp0_direct_in_tx_fifo_0_reg_1_l
5'h1b: sp0_direct_in_tx_fifo_0_reg_1_r
5'h1c: TDM_RX_CH7
SPORT0: a = 1, b = 2, c = 3
SPORT1: a = 0, b = 2, c = 3
SPORT2: a = 0, b = 1, c = 3
SPORT3: a = 0, b = 1, c = 2</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_6_en</name>
              <description>1'b1: Enable direct_reg_6.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_6_sel</name>
              <description>(Ibid.)
5'h1c: TDM_RX_CH6</description>
              <bitRange>[16:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_5_en</name>
              <description>1'b1: Enable direct_reg_5.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_5_sel</name>
              <description>(Ibid.)
5'h1c: TDM_RX_CH5</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_4_en</name>
              <description>1'b1: Enable direct_reg_4.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_reg_4_sel</name>
              <description>(Ibid.)
5'h1c: TDM_RX_CH4</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_DIRECT_CTRL3</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x03020100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY8</name>
              <description>-</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_0_reg_1_r_sel</name>
              <description>5'd0: RX_CH0_data_out (MIC path)
5'd1: RX_CH1_data_out (MIC path)
5'd2: RX_CH2_data_out (MIC path)
5'd3: RX_CH3_data_out (MIC path)
5'd4: RX_CH4_data_out (MIC path)
5'd5: RX_CH5_data_out (MIC path)
5'd6: RX_CH6_data_out (MIC path)
5'd7: RX_CH7_data_out (MIC path)
5'd8:  spa_direct_in_0 
5'd9:  spa_direct_in_1
5'd10: spa_direct_in_2
5'd11: spa_direct_in_3
5'd12: spa_direct_in_4
5'd13: spa_direct_in_5
5'd14: spa_direct_in_6
5'd15: spa_direct_in_7
5'd16: spb_direct_in_0
5'd17: spb_direct_in_1
5'd18: spb_direct_in_2
5'd19: spb_direct_in_3
5'd20: spb_direct_in_4
5'd21: spb_direct_in_5
5'd22: spb_direct_in_6
5'd23: spb_direct_in_7
5'd24: spc_direct_in_0
5'd25: spc_direct_in_1
5'd26: spc_direct_in_2
5'd27: spc_direct_in_3
5'd28: spc_direct_in_4
5'd29: spc_direct_in_5
5'd30: spc_direct_in_6
5'd31: spc_direct_in_7
SPORT0: a = 1, b = 2, c = 3
SPORT1: a = 0, b = 2, c = 3
SPORT2: a = 0, b = 1, c = 3
SPORT3: a = 0, b = 1, c = 2</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY9</name>
              <description></description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_0_reg_1_l_sel</name>
              <description>(Ibid.)</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY10</name>
              <description></description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_0_reg_0_r_sel</name>
              <description>(Ibid.)</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY11</name>
              <description></description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_0_reg_0_l_sel</name>
              <description>(Ibid.)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_DIRECT_CTRL4</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x07060504</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY12</name>
              <description></description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_1_reg_1_r_sel</name>
              <description>5'd0: RX_CH0_data_out (MIC path)
5'd1: RX_CH1_data_out (MIC path)
5'd2: RX_CH2_data_out (MIC path)
5'd3: RX_CH3_data_out (MIC path)
5'd4: RX_CH4_data_out (MIC path)
5'd5: RX_CH5_data_out (MIC path)
5'd6: RX_CH6_data_out (MIC path)
5'd7: RX_CH7_data_out (MIC path)
5'd8:  spa_direct_in_0
5'd9:  spa_direct_in_1
5'd10: spa_direct_in_2
5'd11: spa_direct_in_3
5'd12: spa_direct_in_4
5'd13: spa_direct_in_5
5'd14: spa_direct_in_6
5'd15: spa_direct_in_7
5'd16: spb_direct_in_0
5'd17: spb_direct_in_1
5'd18: spb_direct_in_2
5'd19: spb_direct_in_3
5'd20: spb_direct_in_4
5'd21: spb_direct_in_5
5'd22: spb_direct_in_6
5'd23: spb_direct_in_7
5'd24: spc_direct_in_0
5'd25: spc_direct_in_1
5'd26: spc_direct_in_2
5'd27: spc_direct_in_3
5'd28: spc_direct_in_4
5'd29: spc_direct_in_5
5'd30: spc_direct_in_6
5'd31: spc_direct_in_7
SPORT0: a = 1, b = 2, c = 3
SPORT1: a = 0, b = 2, c = 3
SPORT2: a = 0, b = 1, c = 3
SPORT3: a = 0, b = 1, c = 2</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY13</name>
              <description></description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_1_reg_1_l_sel</name>
              <description>(Ibid.)</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY14</name>
              <description></description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_1_reg_0_r_sel</name>
              <description>(Ibid.)</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY15</name>
              <description></description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_1_reg_0_l_sel</name>
              <description>(Ibid.)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_RX_COUNTER1</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>clr_rx_sport_rdy</name>
              <description>X = (tx_sport_compare_val). When counter equal X. Sport will send tx_sport_interrupt to DSP. 
FW should take care X={32~8191}</description>
              <bitRange>[31:31]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>en_rx_sport_interrupt</name>
              <description>Enable rx sport interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY16</name>
              <description></description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fs_phase_en_d64</name>
              <description>Enable div64 fs_phase_trace_cnt for both tx  and rx</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fs_phase_rpt_b5</name>
              <description>rx_fs_phase_rptp[5] when using div64 fs_phase_trace_cnt</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_sport_compare_val</name>
              <description>X = (rx_sport_compare_val). When counter equal X. Sport will send rx_sport_interrupt to DSP. 
FW should take care X={32~134217727}</description>
              <bitRange>[26:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_RX_COUNTER2</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_sport_counter</name>
              <description>For DSP read instant rx sport counter value, counter down</description>
              <bitRange>[31:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fs_phase_rpt</name>
              <description>Report RX phase</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_MCLK</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00C00271</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mclk_mi_ni_update</name>
              <description>1'b1: to update "mi" and "ni" to get the new clock rate.
This bit will be reset automatically when the update is done</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mclk_ni</name>
              <description>mclk_out = 40MHz*(ni/mi)     
For example: mclk_out=3.072MHz=40MHz*(48/625)</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mclk_mi</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_TX_EX_PHASE_RPT</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ex_phase_rpt</name>
              <description>Report TX phase, counted by sport_clk</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_RX_EX_PHASE_RPT</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ex_phase_rpt</name>
              <description>Report RX phase, counted by sport_clk</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_CTRL2</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lrc_start_pol</name>
              <description>1: lrclk rising edge as lrc start
0: lrclk falling edge as lrc start</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_dma_single_low</name>
              <description>disable rx_dma_single</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_dma_single_low</name>
              <description>disable tx_dma_single</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lrc_stop_intr_mask</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lrc_start_intr_mask</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ex_phase_cnt_en</name>
              <description>enable t/rx exact phase counter, counted by sport_clk</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lrc_stop_thresh</name>
              <description>either tx or rx excat phase counter &gt; this value, generate lrc_stop_intr</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_FIFO_0_WR_ADDR</name>
          <addressOffset>0x00000800</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_FIFO_0_WR_ADDR</name>
              <description>TX_FIFO_0_WR_ADDR</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_FIFO_0_RD_ADDR</name>
          <addressOffset>0x00000880</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_FIFO_0_RD_ADDR</name>
              <description>RX_FIFO_0_RD_ADDR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_FIFO_1_WR_ADDR</name>
          <addressOffset>0x00000900</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_FIFO_1_WR_ADDR</name>
              <description>TX_FIFO_1_WR_ADDR</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
