Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>RX_FIFO_1_RD_ADDR</name>
          <addressOffset>0x00000980</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_FIFO_1_RD_ADDR</name>
              <description>RX_FIFO_1_RD_ADDR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PKE_REG</name>
      <baseAddress>0x40080000</baseAddress>
      <size>0x0000003C</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0000003C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PKE_Control</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>PKE Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKE_Control_HASH_READY</name>
              <description>Write 1 to inform PKE that hash value used in SIMPLIFY ECDSA/EDDSA are ready</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_START</name>
              <description>Write 1 to start PKE (cleared automatically by PKE)</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_OTHER_FUNCTION</name>
              <description>Other functions (not RSA/ECC) enable bit
1: enabled
0: disabled (RSA: modular exponentiation; ECC: scalar multiplication)</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_WORD_SWAP</name>
              <description>Endian word swap enable (only supported in MMEM)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_BYTE_SWAP</name>
              <description>Endian byte swap enable (only supported in MMEM)</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_PRECOMPUTATION</name>
              <description>R^2 mod N ready (1 means not need to calculate the R^2 mod N, already stored by user)
For RSA , R^2 mod N ready and DPA defense can't be enabled at the same time. Valid only when bit[27] == 0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_PRECISE_LENGTH</name>
              <description>Precise RSA/ECC length in bits
Caution: when preforming ecc point operation under binary field, there are situation which width of modulo is larger than ecc length. For example, width of f(x) of sect163r2 is 164, larger than ECC length 163. In this situation, just fill in Precise ECC length 163.</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_MODE_MAIN</name>
              <description>2'b00: ECC Prime field
2'b01: ECC Binary field
2'b10: RSA
2'b11: Edwards or Montgomery Curves</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_MODE_CURVE</name>
              <description>1'b0: Edward Curves
1'b1: Montgomery Curves</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_USE_LFSR</name>
              <description>1: use internal LFSR0, and do not use internal LFSR. If user does not use internal LFSR, user needs to initial a 32-bit random number (can't be 0) to MMEM offset 0x600 (RSA3072), or MMEM offser 0x800 (RSA4096) or MMEM offset 0x380 (ECC). And if configured to ECC, please also clear the upper MMEM offset 0x381 to 0x3bf to 0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_TIMING_ATTACK</name>
              <description>1: Timing attack defense enable
0: Timing attack defense disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_DPA_DEFENSE</name>
              <description>1: DPA defense enable
0: DPA defense disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_IMEM_READ</name>
              <description>1: Enable IMEM read (or else, the IMEM can only be read when bit[30] = 1)
0: IMEM can't be read</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Control_CAL_PRECOMPUTE</name>
              <description>When using RSA/ECC (bit 27 == 0), if this bit is set, PKE will calculate R ^ 2 mod N, n[63:0] ^ (-1) mod r only</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKE_Status</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>PKE Status Register</description>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKE_Status_HASH_NEED</name>
              <description>SIMPLIFY_ECDSA/EdDSA needs hash value</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKE_Status_IDLE</name>
              <description>PKE idle</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKE_STATUS</name>
              <description>7'h1: prime check error(for modular number)
7'h2: R^2 mod N failed
7'h4: ECC odd point (Y = 0) (Montgomery curve will not check the Y value)
7'h5: RSA not supported
7'h6: check version error
7'h7: no such function
7'h8: ECC Z = 0
7'h10: Modular Inverse failed
7'h20: N &lt; input message for RSA
7'h40: No valid exponent</description>
              <bitRange>[7:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Status_FINISH</name>
              <description>PKE operation finish</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKE_Interrupt</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>PKE Interrupt Mask Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKE_Interrupt_SIMPLIFY_HASH_MASK</name>
              <description>Wait for SIMPLIFY_ECDSA_EDDSA hash value
0: interrupt masked
1: interrupt not masked</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKE_Interrupt_STATUS_MASK</name>
              <description>Interrupt mask for interrupt in PKE status register bit[7:0]
8'h00: interrupt masked
8'hff: interrupt not masked
Caution: valid value of this field is only 8'h00 or 8'hff</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKE_Swap</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>Base addess of word swap Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY_NUM</name>
              <description>Use which key (binary encoding), key0 ~ key7</description>
              <bitRange>[19:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY_PORT_EN</name>
              <description>1: Enable hardware key port
0: Do not enable hardware key port</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP_BASE</name>
              <description>Word swap base address in word (32 bits)</description>
              <bitRange>[10:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKE_Version</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>Version Number Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VERSION</name>
              <description>32-bit code update date or version number , such as 32'h20211015</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSR_Seed</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>PKESeeding Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEED</name>
              <description>Seed of internal LFSRs</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKE_MUTEX</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>PKE Mutex Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUTEX_STATUS</name>
              <description>If read 0, lock mutex.
If not 0, the engine is being used.
2'b01: secure domain lock mutex
2'b10: non-secure domain lock mutex
Write 0 to unlock mutex</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKE_MUTEX_OVERWRITE</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>PKE Mutex Overwrite Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUTEX_OVERWRITE</name>
              <description>Allows secure domain overwrite mutex
1: Enable
0: Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
