Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WLON</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x000000A8</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000000A8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_SYS_PWC_ISO_CTRL</name>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x0000C8D0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_SWR_STS_REQ_ACT</name>
              <description>000: RSVD 
001: state1  0.7/PC/PFM
010: state2  0.8/PC/PFM 
011: state3  0.9/PC/PFM
100: state4  0.9/SLP/PFM 
101: state5  0.9/SLP/PWM 
110: state6  0.9/NORM/PWM 
111: state7  1.0/NORM/PWM</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_SWR_STS_REQ_LPS</name>
              <description>000: RSVD
001: state1  0.7/PC/PFM
010: state2  0.8/PC/PFM 
011: state3  0.9/PC/PFM
100: state4  0.9/SLP/PFM
101: state5  0.9/SLP/PWM 
110: state6  0.9/NORM/PWM 
111: state7  1.0/NORM/PWM</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_SWR_STS_REQ_TRG</name>
              <description>1:wl request switch regu status to active mode,which means selectl 0x00[11:9] as request
0:wl request switch regu status to lps mode,which means selectl 0x00[7:5] as request</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_SWR_STS_REQ</name>
              <description>the SWR request mode of wifi</description>
              <bitRange>[7:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WL_PWR_SWITCH_DMY_EN</name>
              <description>1:enable wl dummy load when wlan is switching power mode
0:disable wl dummy load when wlan is switching power mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_POW_AFE_REQ</name>
              <description>AFE power on request to afe_ctrl
1:request to turn on AFE pwr
0:turn off AFE pwr</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_REQ_TO_ACT</name>
              <description>notify system to act</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_PWC_WLMAC_EN</name>
              <description>1: Enable WLOFF power cut</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WL_CLK_CTRL</name>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00008000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_EN_WL_CK4M</name>
              <description>enable WL OSC 4M when bt is active</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLON_SWITCH_TSF_EN</name>
              <description>enable wlpmc switch TSF clock to MAC clock</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLOFF_SWITCH_TSF_EN</name>
              <description>enable wlpmc switch TSF clock to 32K clock</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_CKEN_IQDUMP</name>
              <description>0: disable clock for iqdump (LA MODE)
1: enable clock for iqdump (LA MODE)
same clock source as security clock</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSF_IS_32K</name>
              <description>WL TSF clock status:
0: MAC clock
1: 32K clock</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WL_CKSL_CKTSF</name>
              <description>1: TSF clock switch to 32.768KHz; 0: TSF clock switch to MAC clock</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_CKTSF1_EN</name>
              <description>1: enable port2 tsf clock; 0: gated</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_CKTSF0_EN</name>
              <description>1: enable port1 tsf clock; 0: gated</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_FQSEL_CK32K</name>
              <description>1:32K frequency select 32.768KHz 0:32K frequency select 32KHz</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_CK32K_EN</name>
              <description>1: enable 32k clock; 0: gated</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_CKSEC_EN</name>
              <description>1: enable MAC security engine clock; 0: gated</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_CKMAC_EN</name>
              <description>1: enable MAC clock; 0: gated</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WL_FUNC_EN</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x06000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_PON_WAIT_ALL</name>
              <description>1:wait rdy for swr and xtal and pwc in the same state when power on to save time and power</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_POF_WAIT_ALL</name>
              <description>1:wait rdy for swr and xtal in the same state when power off to save time and power</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_SEL_SW_SI</name>
              <description>indicate SW use indirect path to access WLRFC register</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FEN_BB_RSTB</name>
              <description>When this bit is set to 0, CCK and OFDM are disabled, and clock are gated. Otherwise, CCK and OFDM are enabled.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FEN_BB_GLB</name>
              <description>When this bit is set to 0 whole BB is reset. When this bit is set, BB is enabled.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FW_INIT_RDY</name>
              <description>CPU fw initialize ready, set by CPU(txrpt info update,used in ptcl)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_FEN_WLON</name>
              <description>1: enable WL partial ON; 0: reset</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_FEN_WLOFF</name>
              <description>1: enable WLOFF; 0: reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_FEN_MAC_PMC</name>
              <description>1: enable MAC PMC; 0: reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CLKDIV_CKSEL</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00040000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_EN_WL_CK4M</name>
              <description>enable WL OSC 4M when cpu want to access wlon reg and wlpmc buffer</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_CLK_SEL</name>
              <description>11/10:40M
01:80M
00:160M</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_CLK_SEL</name>
              <description>11/10:20M
01:40M
00:80M</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_CKDIV_SYNC_1SHOT</name>
              <description>1: sync 40M/80M clock  phase with PLL</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_MAC_PHASE</name>
              <description>40M MAC clock phase control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_SEC_PHASE</name>
              <description>80M security clock phase control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CPWM</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPWM_TOGGLING</name>
              <description>Toggling bit : one bit sequence number bit. When this bit is toggled, interrupt is send to HISR.CPWMINT.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPWM_MOD</name>
              <description>The current power mode index.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RPWM</name>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RPWM_TOGGLING</name>
              <description>Toggling bit : one bit sequence number bit. When this bit is toggled, interrupt is send to FISR.RPWMINT.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RPWM_MOD</name>
              <description>The current power mode index.</description>
              <bitRange>[14:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SCOREBOARD_BT2WL_CTRL</name>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_BT2L_STS_INT</name>
              <description>when bit31 toggles, this interrupt will be assert</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_BT2L_STS_INT_EN</name>
              <description>when bit31 toggles, this interrupt will be assert</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_MODE</name>
              <description>Bluetooth Mode</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BT</name>
              <description>Enable PTA ( from BT side)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SCOREBOARD_BT2WL</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_BT2WL_INFO</name>
              <description>Read Data :  WL TO BT INFO, WLON Status Report</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SCOREBOARD_WL2BT</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_WL2BT_INFO</name>
              <description>WLON Status Report TO BTON</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_XTAL_CTRL</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x02200033</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_XTAL_REQ</name>
              <description>the xtal request mode of wifi</description>
              <bitRange>[25:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WL_XTAL_REQ_TRG</name>
              <description>1: wl request xtal status to active mode,which means selectl 0x30[6:5] as request
0: wl request xtal status to lps mode,which means selectl 0x30[4:3] as request</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_XTAL_REQ_ACT</name>
              <description>000:xtal off
001:xtal lps mode gating 40M
010:xtal lps mode enable 40M
011:xtal normal mode
100:xtal hp mode</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_XTAL_REQ_LPS</name>
              <description>000:xtal off
001:xtal lps mode gating 40M
010:xtal lps mode enable 40M
011:xtal normal mode
100:xtal hp mode</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_MLDO_MODE_REQ_TRG</name>
              <description>Write 1 to trigger switch LDO mode when wifi is active, pulse</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_MLDO_MODE_REQ</name>
              <description>The ldo request mode of wifi</description>
              <bitRange>[5:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WL_MLDO_MODE_LPS</name>
              <description>00: analog LDO off   
01: analog LDO off sleep
10: analog LDO normal -- dummy load
11: analog LDO normal -- no dummy load</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_MLDO_MODE_ACT</name>
              <description>00: analog LDO off   
01: analog LDO off sleep
10: analog LDO normal -- dummy load
11: analog LDO normal -- no dummy load</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WL_PMC_CTRL</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00309F00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wlbb_reset_by_pmc</name>
              <description>1: release wlbb glb reset and restore wlbb retention dff by wlpmc
0:release wlbb glb reset and restore wlbb retention dff by sw or hioe</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_bb_retain_en_type_1</name>
              <description>1 to 0:gen req to restore register in power on flow
0 to 1:gen req to backup register in power on flow
default should be 1,otherwise there be unexpected leakage power when VCC is power off and VCCG is still on</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_bb_save_en_type_2</name>
              <description>enable saving value of retention DFF when wlbb power off or pg,should be assert when reset is high</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WL_bb_restore_en_type_2</name>
              <description>enable restoring value of retention DFF when wlbb power on,should be assert when reset is high</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WL_save_en_type_2</name>
              <description>enable saving value of retention DFF when wlmac power off or pg,should be assert when reset is high</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WL_restore_en_type_2</name>
              <description>enable restoring value of retention DFF when wlmac power on,should be assert when reset is high</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WL_retain_en_type_1</name>
              <description>1 to 0:gen req to restore register in power on flow
0 to 1:gen req to backup register in power on flow
default should be 1,otherwise there be unexpected leakage power when VCC is power off and VCCG is still on</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_retention_cell_sel</name>
              <description>1:choose retention cell type I(U22 ULP),which is controlled by 0x20[15]
0:choose retention cell type II(RTKM),which is controlled by 0x20[17:16]</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_PMC_TUTIME</name>
              <description>WL PMC FSM counting unit.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_PMC_LPS</name>
              <description>Inform WLAN PMC FSM to enter LPS mode. 
(auto clear when ready)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_PMC_POFF</name>
              <description>Inform WLAN PMC FSM to power OFF mode, include clock, isolation, power control for MAC only (clear when Power Ready)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_PMC_PON</name>
              <description>Inform WLAN PMC FSM to power On mode, include clock, isolation, power control for MAC only (clear when Power Ready)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WL_PIN_FUNC_CTRL</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_DBG_SEL</name>
              <description>WL debug select</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P0_TBTT_TIMER</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P0_ELY_BCNAGG_CNT</name>
              <description>Unit: bcn_space
the total time to next specified TBTT is (new_ely_agg_cnt - 1) * r_bcn_space(0x554) + (beacon_cnt_down - 1)* 1ms + (cnt_128us + 1)* 128us</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>P0_BCN_CNT_DOWN</name>
              <description>Unit: 1ms
beacon_cnt_down - 1</description>
              <bitRange>[18:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>P0_128US_CNT</name>
              <description>Unit: 128us</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
