Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_WL_PMC_DEBUG</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>syspll_clkrdy</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ls_sys_is_off</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ls_sys_is_lps</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ls_sys_is_on</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bt_is_off</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bt_is_lps</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bt_is_on</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wl_pll_rdy</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>hioe_chn_off_done</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>hioe_chn_on_done</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wlpof_tsf_clk_rdy</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wlpon_tsf_clk_rdy</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wl_mldo_rdy</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wl_xtal_rdy</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wl_swr_rdy</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wl_pon_rdy</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wl_pwc_rdy</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rdy2act</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DBG_PORT_REG</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEBUG_ST</name>
              <description>Debug signals, sel by 24[31:24]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LPS_CTRL</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x03360000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description></description>
              <bitRange>[31:30]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WL_LPS_OPT_SAVE_REG</name>
              <description>LPS option to save retention FF
1: enable request to save retention FF
0: disable request to save retention FF</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_MEMPM_AXBB</name>
              <description>AXBB  FTC/SNPS memory power mode when enable LPS memory power mode

0 : normal
1 : NAP/LS</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_MEMPM_MACON_WLPMC</name>
              <description>MAC ON  FTC memory power mode when enable LPS memory power mode(for WLPMC BUFFER)
00 : normal
01 : NAP
10 : RET
11 : SLP</description>
              <bitRange>[24:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_MEMPM_MACOFF</name>
              <description>MAC OFF  FTC memory power mode when enable LPS memory power mode
(for RXPKTBUF/LLT/CISBUF/SR_TABLE)
0 : normal
1 : NAP/LS</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_MEMPM_MACON</name>
              <description>MAC ON FTC memory power mode when enable LPS memory power mode
(for EXT_RXPKTBUF/HIOE 4k)
00 : normal
01 : NAP
10 : RET
11 : SLP</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_MEMPM_MACOFF_TRXFIFO</name>
              <description>MAC OFF  FTC/SNPS memory power mode when enable LPS memory power mode
(for rxfifo/txfifo)
0 : normal
1 : NAP/LS</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_MEMPM_MACOFF_DMAFIFO</name>
              <description>MAC OFF SNPS memory power mode when enable LPS memory power mode(dmafifo)
0 : normal
1 : NAP</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_OPT_EMACFUN</name>
              <description>LPS option to reset WL MAC OFF block when enable WL MAC OFF power
1: not reset WL MAC OFF block
0: reset WL MAC OFF block</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_OPT_EMACPWR</name>
              <description>LPS option to enable WL MAC OFF block power
1: Enable WL MAC OFF block power 
0: Disable WL MAC OFF block power</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_OPT_GTSFOFF</name>
              <description>LPS option to enable TSF CLK  in OFF domain
1: Enable tsf clk gating when lps cg
0: Disable tsf clk gating when lps cg</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>rsvd</description>
              <bitRange>[6:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_LPS_MEMPM_EN</name>
              <description>enable LPS memory power mode control</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_NRM_MEMPM_SL</name>
              <description>MAC memory power mode when BIT_WL_LPS_MEMPM_EN is 0,
0 : Normal
1 : SD</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LPS_OFFLOAD_CTRL</name>
          <addressOffset>0x00000038</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x0000001C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIOE_BYPASS_CHN_BCN_MODE</name>
              <description>BYPASS HW trig hioe to do switch bcn mode to normal rx(enable ofdm) flow</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_BYPASS_CHN_OFF</name>
              <description>BYPASS HW trig hioe to do rf off flow</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_BYPASS_CHN_ON</name>
              <description>BYPASS HW trig hioe to do rf on flow</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HW_AUTO_ENTER_LPS_EN</name>
              <description>enable HW enter lps after hioe_off_int rise when BIT_FS_RXBCN_LPS_EN=1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_LPSOFFLOAD_EN</name>
              <description>enable lps offload flow when rxbcn frame in port0 acting as a non-AP STA.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AUTO_PMC_CTRL</name>
          <addressOffset>0x0000003A</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WLPMC_POF_TRIG_CHN_OFF</name>
              <description>ONE pluse to trig hioe_chn_off</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLPMC_PON_TRIG_CHN_ON</name>
              <description>ONE pluse to trig hioe_chn_on, and start rxbcn_timer</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_CONFIGURABLE_WLPMC_EN</name>
              <description>enable programable wlpmc flow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AHB_WATCHDOG</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WATCH_DOG_RECORD</name>
              <description>timeout register address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IO_TIMEOUT_FLAG</name>
              <description>AHB timeout flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EN_WATCH_DOG</name>
              <description>enable AHB timeout watchdog</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_PAGE0</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_1</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_1</name>
              <description>FW_DBG_PON_1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_2</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_2</name>
              <description>FW_DBG_PON_2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_3</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_3</name>
              <description>FW_DBG_PON_3</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_4</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_4</name>
              <description>FW_DBG_PON_4</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_5</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_5</name>
              <description>FW_DBG_PON_5</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_6</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_6</name>
              <description>FW_DBG_PON_6</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_7</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_7</name>
              <description>FW_DBG_PON_7</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_8</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_8</name>
              <description>FW_DBG_PON_8</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_9</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_9</name>
              <description>FW_DBG_PON_9</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_10</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_10</name>
              <description>FW_DBG_PON_10</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_11</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_11</name>
              <description>FW_DBG_PON_11</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_PON_12</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_PON_12</name>
              <description>FW_DBG_PON_12</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SW_WLPMC_DEBUG</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_WLPMC_DBG</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HW_WLPMC_DEBUG</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HW_WLPMC_DBG</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
