Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MGEN_ON</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x00000200</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_CR</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description>MAC TOP Function enable</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NETYPE1</name>
              <description>Network Type for Port 1
00: No link
01: Link in ad hoc network
10: Link in infrastructure network
11:AP mode
Default:00b.</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NETYPE0</name>
              <description>Network Type for port 0
00: No link
01: Link in ad hoc network
10: Link in infrastructure network
11:AP mode
Default:00b.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_SEC_EN</name>
              <description>Enable MAC security engine
When this bit is clear, security engine is reset</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MACRXEN</name>
              <description>MAC Receiver Enable.
When set to 1, and the receive state machine is idle, the receive machine becomes active. This bit will read back as 1 whenever the receive state machine is active. After initial power-up, software must ensure that the receiver has completely reset before setting this bit.
1: Enable
0: Disable
Default: 0b.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MACTXEN</name>
              <description>MAC Transmitter Enable.
When set to 1, and the transmit state machine is idle, the transmit state machine becomes active. This bit will read back as 1 whenever the transmit state machine is active. After initial power-up, software must ensure that the transmitter has completely reset before setting this bit.
1: Enable
0: Disable
Default: 0b.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHEDULE_EN</name>
              <description>Schedule Enable.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTCL_EN</name>
              <description>protocol Block Function Enable.(FW2HW)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMA_EN</name>
              <description>RXDMA Function Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMA_EN</name>
              <description>TXDMA Function Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HCI_RXDMA_EN</name>
              <description>HCI to RXDMA Interface Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HCI_TXDMA_EN</name>
              <description>HCI to TXDMA Interface Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BB_RFC_ATR</name>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <description>BB/RFC REG Access Time Register</description>
          <resetValue>0x05050404</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHYRE_CNT</name>
              <description></description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYWR_SETUP_CNT</name>
              <description>the timing WDATA stable before WE for host/cpu access BB/RFC REG</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYWR_HOLD_CNT</name>
              <description>the timing WDATA stable after WE for host/cpu access BB/RFC REG</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYRD_WAIT_CNT</name>
              <description>the timing RDATA stable after ADDR for host/cpu access BB/RFC REG</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>reg_ext_imr_wlpmc_en</name>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS_ELY_Timer_E_EXT_WLPMC_FS_EN</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_Timer_D_EXT_WLPMC_FS_EN</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_Timer_C_EXT_WLPMC_FS_EN</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_Timer_B_EXT_WLPMC_FS_EN</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_Timer_A_EXT_WLPMC_FS_EN</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_Timer_E_EXT_WLPMC_EN</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_Timer_D_EXT_WLPMC_EN</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_Timer_C_EXT_WLPMC_EN</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_Timer_B_EXT_WLPMC_EN</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_Timer_A_EXT_WLPMC_EN</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>reg_ext_imr_sw_en</name>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDCCA_ILDE_TOCNT_INT_EXT_SW_EN</name>
              <description>when edcca is low after tbtt, start timer,when timeout for few times,set this interrupt</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_CHN_BCN_MODE_INT_EXT_SW_EN</name>
              <description>hioe_chn_bcn_mode done interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_CHN_MAC_HW0_SW_EN</name>
              <description>hioe_chn_mac_hw0 done interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_CHN_MAC_HW1_SW_EN</name>
              <description>hioe_chn_mac_hw1 done interrupt</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_CHN_OFF_INT_EXT_SW_EN</name>
              <description>hioe_chn_off done interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_CHN_ON_INT_EXT_SW_EN</name>
              <description>hioe_chn_on done interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM_NO_HIT_INT_EXT_SW_EN</name>
              <description>when no my aid or aid is 0(0x16DC[8]) or my bssid is not in tim element(0x16DB[31]),generate this interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BCN_OK_P0_INT_EXT_SW_EN</name>
              <description>When this bit is enable, the interrupt is issued when RX beacon frame occurs in port0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BCN_ERR_P0_INT_EXT_SW_EN</name>
              <description>When this bit is enable, the interrupt is issued when RX beacon frame with fcs error occurs in port0.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_INT_EXT_SW_EN</name>
              <description>When this bit is enable, the interrupt is issued when RX beacon frame timeout occurs in port0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_TSF_GT_THRES_INT_EXT_SW_EN</name>
              <description>The interrupt is issued when difference of tsft in beacon frame of port0 is greater than threshold</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TBTT0_INT_EXT_SW_EN</name>
              <description>the interrupt  from the exact TBTT time for P0 MBSSID0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNELY0_AGGR_INT_EXT_SW_EN</name>
              <description>port 0 Beacon early aggregation interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNERLY0_INT_EXT_SW_EN</name>
              <description>This interrupt is issued at the time set by DRVERLYINT register before TBTT0_MB0 time.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HIMR0</name>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_TRIG_LAT_AUDIO_CNT_INT_EN</name>
              <description></description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_C2H_MSG_INT_EN</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_CPWM_INT_EN</name>
              <description></description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_BCNELY0_INT_EN</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_BCNELY1_INT_EN</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_BCNELY_DISC_INT_EN</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_BCNELY_SYNC_2G_INT_EN</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_BCNELY_SYNC_5G_INT_EN</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_BCNELY0_AGGR_INT_EN</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TBTT0_INT_EN</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TBTT1_INT_EN</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TBTT_DISC_INT_EN</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TBTT_SYNC_2G_INT_EN</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TBTT_SYNC_5G_INT_EN</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TXBCNOK0_INT_EN</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TXBCNOK1_INT_EN</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TXBCNERR0_INT_EN</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TXBCNERR1_INT_EN</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TXBCNOK_DISC_INT_EN</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TXBCNOK_SYNC_INT_EN</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TXBCNERR_DISC_INT_EN</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_TXBCNERR_SYNC_INT_EN</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_SDF_START_INT_EN</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_DWWIN_END_INT_EN</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HISR0</name>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_TRIG_LAT_AUDIO_CNT_INT</name>
              <description></description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_C2H_MSG_INT</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_CPWM_INT</name>
              <description></description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_BCNELY0_INT</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_BCNELY1_INT</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_BCNELY_DISC_INT</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_BCNELY_SYNC_2G_INT</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_BCNELY_SYNC_5G_INT</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_BCNELY0_AGGR_INT</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TBTT0_INT</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TBTT1_INT</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TBTT_DISC_INT</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TBTT_SYNC_2G_INT</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TBTT_SYNC_5G_INT</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TXBCNOK0_INT</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TXBCNOK1_INT</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TXBCNERR0_INT</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TXBCNERR1_INT</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TXBCNOK_DISC_INT</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TXBCNOK_SYNC_INT</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TXBCNERR_DISC_INT</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_TXBCNERR_SYNC_INT</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_SDF_START_INT</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_DWWIN_END_INT</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
