Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_FIMR3</name>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FS_RXPLCP_CHKOK_INT_EN</name>
              <description>RXPCLP check ok interrupt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RXDONE0_INT_EN</name>
              <description>Rx Packet 0 done interrupt (for WOL release packet)</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RX_UCMD0_INT_EN</name>
              <description>The interrupt is issued while receiving unicast data frame with More Data=0</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RX_UCMD1_INT_EN</name>
              <description>The interrupt is issued while receiving unicast data frame with More Data=1</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RX_BCMD0_INT_EN</name>
              <description>The interrupt is issued while receiving broadcast data frame with More Data=0</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RX_BCMD1_INT_EN</name>
              <description>The interrupt is issued while receiving broadcast data frame with More Data=1</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RX_UAPSDMD1_INT_EN</name>
              <description>Setting this bit indicates Rx pkt is matched with one of below:
1.) QoS Unicast data frame with MD=1, UAPSD=0
2.) NonQoS Unicast data frame with MD=1</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RX_UAPSDMD0_INT_EN</name>
              <description>Setting this bit indicates Rx pkt is matched with one of below:
1.) QoS Unicast data frame with MD=0, UAPSD=0
2.) NonQoS Unicast data frame with MD=0</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_EOSP_INT_EN</name>
              <description>EOSP_INT interrupt mask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RXUCMD0_ACK_INT_EN</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RXUCMD1_ACK_INT_EN</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RXBCMD0_ACK_INT_EN</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RXBCMD1_ACK_INT_EN</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RX_MORE_TF0_INT_EN</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RX_MORE_TF1_INT_EN</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_ERR_HAPPENED_INT_EN</name>
              <description>FWHW/ WMAC error status interrupt(0x4E2[15:0], 0x6B8[31:0]). WMAC error state will be recovered by HW, the others won't.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_P0_PKTIN_INT_EN</name>
              <description>port 0 packet assign to queue interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_P1_PKTIN_INT_EN</name>
              <description>port 1 packet assign to queue interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_TX_NULL1_P0_INT_EN</name>
              <description>TX null 1 packet done interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_TX_NULL0_P0_INT_EN</name>
              <description>TX null 0 packet done interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_TRIGGER_PKT_INT_EN</name>
              <description>tx TRIGGER_PKT interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RLS_FIFO_ALMOST_FULL_FW_INT_EN</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RLS_FIFO_FULL_FW_INT_EN</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_RLS_FIFO_VALID_FW_INT_EN</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_FW_CPUMGQ_RLS_INT_EN</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TC4_CTRL</name>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <description>Counter 4 CONTROL</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Rsvd</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC4START</name>
              <description>When write "1" to this bit, Counter 0 starts counting down. This is a one-bit pulse.</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TC4MODE</name>
              <description>Timer/Counter 4 mode 
0=counter mode
1=timer mode</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC4EN</name>
              <description>Timer/Counter 4 enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC4DATA</name>
              <description>Timer/Counter 4 data register. It specifies the time-out duration.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TC5_CTRL</name>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <description>Counter 5 CONTROL</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Rsvd</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC5START</name>
              <description>When write "1" to this bit, Counter 0 starts counting down. This is a one-bit pulse.</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TC5MODE</name>
              <description>Timer/Counter 5 mode 
0=counter mode
1=timer mode</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC5EN</name>
              <description>Timer/Counter 5 enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC5DATA</name>
              <description>Timer/Counter 5 data register. It specifies the time-out duration.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TC0_CTRL</name>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <description>Counter 0 CONTROL</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Rsvd</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC0START</name>
              <description>When write "1" to this bit, Counter 0 starts counting down. This is a one-bit pulse.</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TC0MODE</name>
              <description>Timer/Counter 0 mode 
0=counter mode
1=timer mode</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC0EN</name>
              <description>Timer/Counter 0 enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC0DATA</name>
              <description>Timer/Counter 0 data register. It specifies the time-out duration.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TC1_CTRL</name>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <description>Counter 1 data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Rsvd</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC1START</name>
              <description>When write "1" to this bit, Counter 1 starts counting down. This is a one-bit pulse.</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TC1MODE</name>
              <description>Timer/Counter 1 mode 
0=counter mode
1=timer mode</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC1EN</name>
              <description>Timer/Counter 1 enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC1DATA</name>
              <description>Timer/Counter 1 data register. It specifies the time-out duration.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TC2_CTRL</name>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <description>Counter 2 data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC2START</name>
              <description>When write "1" to this bit, Counter 2 starts counting down. This is a one-bit pulse.</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TC2MODE</name>
              <description>Timer/Counter 2 mode 
0=counter mode
1=timer mode</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC2EN</name>
              <description>Timer/Counter 2 enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC2DATA</name>
              <description>Timer/Counter 2 data register. It specifies the time-out duration.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TC3_CTRL</name>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <description>Counter 3 data</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC3START</name>
              <description>When write "1" to this bit, Counter 3 starts counting down. This is a one-bit pulse.</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TC3MODE</name>
              <description>Timer/Counter 3 mode 
0=counter mode
1=timer mode</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC3EN</name>
              <description>Timer/Counter 3 enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TC3Data</name>
              <description>Timer/Counter 3 data register. It specifies the time-out duration.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HW_IOE_CR_CH0</name>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIOE_ACTIVE_CH0</name>
              <description>indicate HIOE engine is active</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[30:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_RESTORE_REQ_CH0</name>
              <description>WLOFF REG restore request, clear by hw</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_BACKUP_REQ_CH0</name>
              <description>WLOFF REG backup request, clear by hw</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_END_ADDR_CH0</name>
              <description>HIOE command end address in txpktbuffer, unit:8byte</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_STR_ADDR_CH0</name>
              <description>HIOE command start address in txpktbuffer, unit:8byte</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HW_IOE_CR_CHN_ON</name>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <description>HW IO Engine Configure Register_CHN_ON</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIOE_ACTIVE_CHN_ON</name>
              <description>indicate HIOE engine is active, used for wlan power on flow</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[30:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_RESTORE_REQ_CHN_ON</name>
              <description>WLOFF REG restore request, clear by hw</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIOE_END_ADDR_CHN_ON</name>
              <description>HIOE command end address in txpktbuffer, unit:8byte</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_STR_ADDR_CHN_ON</name>
              <description>HIOE command start address in txpktbuffer, unit:8byte</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HW_IOE_CR_CHN_OFF</name>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <description>HW IO Engine Configure Register_CHN_OFF</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIOE_ACTIVE_CHN_OFF</name>
              <description>indicate HIOE engine is active, used for wlan power off flow</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[30:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_RESTORE_REQ_CHN_OFF</name>
              <description>WLOFF REG restore request, clear by hw</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIOE_END_ADDR_CHN_OFF</name>
              <description>HIOE command end address in txpktbuffer, unit:8byte</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_STR_ADDR_CHN_OFF</name>
              <description>HIOE command start address in txpktbuffer, unit:8byte</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HW_IOE_CR_CHN_MAC_HW0</name>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIOE_ACTIVE_CHN_MAC_HW0</name>
              <description>indicate HIOE CHN_MAC_HW0 is active</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIOE_RESTORE_REQ_CHN_MAC_HW0</name>
              <description>hw hang trig hioe reset wmac request, clear by hw</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIOE_END_ADDR_CHN_MAC_HW0</name>
              <description>HIOE command end address in txpktbuffer, unit:8byte</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_STR_ADDR_CHN_MAC_HW0</name>
              <description>HIOE command start address in txpktbuffer, unit:8byte</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
