Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_HW_IOE_CR_CHN_MAC_HW1</name>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIOE_ACTIVE_CHN_MAC_HW1</name>
              <description>indicate HIOE CHN_MAC_HW1 is active</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIOE_RESTORE_REQ_CHN_MAC_HW1</name>
              <description>hw hang trig hioe reset wmac request, clear by hw</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIOE_END_ADDR_CHN_MAC_HW1</name>
              <description>HIOE command end address in txpktbuffer, unit:8byte</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_STR_ADDR_CHN_MAC_HW1</name>
              <description>HIOE command start address in txpktbuffer, unit:8byte</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HW_IOE_CR_CHN_bcn_mode</name>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIOE_ACTIVE_CHN_bcn_mode</name>
              <description>indicate HIOE CHN_bcn_mode is active</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIOE_RESTORE_REQ_CHN_bcn_mode</name>
              <description>BB/RF enable OFDM mode request, clear by hw</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIOE_END_ADDR_CHN_bcn_mode</name>
              <description>HIOE command end address in txpktbuffer, unit:8byte</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_STR_ADDR_CHN_bcn_mode</name>
              <description>HIOE command start address in txpktbuffer, unit:8byte</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HW_IOE_CR_CHN_BB_HW</name>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <description>HW IO Engine Configure Register_CHN_BB_HW</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIOE_ACTIVE_CHN_BB_HW</name>
              <description>indicate HIOE engine is active</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_BB_HIGH_TRIG_CHN_BB_EN</name>
              <description>enable bb high pri int to to trig hioe to do bb reset when break happened</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_BB_LOW_TRIG_CHN_BB_EN</name>
              <description>enable bb low pri int to to trig hioe to do bb reset when break happened</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_RESTORE_REQ_CHN_BB_HW</name>
              <description>WLOFF REG restore request, clear by hw</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIOE_END_ADDR_CHN_BB_HW</name>
              <description>HIOE command end address in txpktbuffer, unit:8byte</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIOE_STR_ADDR_CHN_BB_HW</name>
              <description>HIOE command start address in txpktbuffer, unit:8byte</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBCN_TIMER_CTRL</name>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x1F400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBCN_TIMEUP_THRES</name>
              <description>threshold for rxbcn timeout,UNIT:us default:8ms</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_THRES_INIT</name>
              <description>HW auto update threshold for rxbcn timeout,UNIT:us</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBCN_TIMEUP_COUNTER_CTRL</name>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x001E0060</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBCN_TIMEUP_COUNT1</name>
              <description>rxbcn timeup counter1</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_COUNT1_CLR</name>
              <description>clear rxbcn timeup counter1</description>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_COUNT1_THRES</name>
              <description>threshold for rxbcn timeup counter,when 0x17C[30:24] equals to this value,generate interrupt</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_TSF_IS32K</name>
              <description>Which Clock is Used by TSF Clock
1: 32K Clock
0: MAC Clock</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WAIT_RXBCN_FINISH</name>
              <description>when rxbcn frame,turn off rf or generate interrupt ablout rxbcn after beacon fcs is parsered</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_COUNT</name>
              <description>rxbcn timeup counter</description>
              <bitRange>[13:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_COUNT_CLR</name>
              <description>clear rxbcn timeup counter</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_COUNT_THRES</name>
              <description>threshold for rxbcn timeout counter,when 0x17C[13:10] equals to this value,generate interrupt</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBCN_COUNTER_CTRL1</name>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x07110000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_RXBCN_CNT</name>
              <description>1: statistic the number of RXBCN in specified period</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_CNT_PRD</name>
              <description>2^(RXBCN_CNT_PRD), default is 128 times</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_ADJSP_DOWN</name>
              <description>the adjust step of the rxbcn timeup period adjustment when decrease the period. UNIT: (2^RXBCN_TIMEUP_ADJSP_DOWN)*32US</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_ADJSP_UP</name>
              <description>the adjust step of the rxbcn timeup period adjustment when increase the period.  UNIT: (2^RXBCN_TIMEUP_ADJSP_UP)*32US</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_THRES_LOW</name>
              <description>lower limit of rxbcn. If the RXBCN.COUNTER &lt; THRES_LOW, RXBCN timeup period + (2^RXBCN_TIMEUP_ADJSP_UP)*32US</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_THRES_HIGH</name>
              <description>upper limit of rxbcn. If the RXBCN.COUNTER &gt; THRES_HIGH, RXBCN timeup period - (2^RXBCN_TIMEUP_ADJSP_DOWN)*32US</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBCN_COUNTER_CTRL2</name>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000401E0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBCN_CNT</name>
              <description>statistic the times of RXBCN in RXBCN_CNT_PRD</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_MIN</name>
              <description>lower limit of bcn_timeup. If the bcn_timeup less than RXBCN_TIMRUP_MIN, use the RXBCN_TIMRUP_MIN as bcn_timeup. UNIT: 32US. Default is 2ms</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_TIMEUP_MAX</name>
              <description>upper limit of bcn_timeup. If the bcn_timeup greater than RXBCN_TIMRUP_MAX, use the RXBCN_TIMRUP_MAX as bcn_timeup. UNIT: 32US. Default is 15ms</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RFOFF_BY_EDCCA_CTRL0</name>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00030404</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDCCA_IDLE_TO_CNT</name>
              <description>indicate how many times edcca idle timeout happens</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EDCCA_IDLE_TIMER</name>
              <description>edcca idle timeout timer,unit:4us</description>
              <bitRange>[27:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EDCCA_CHK_AREA0_CNT_THRES</name>
              <description>EDCCA_IDLE timeout counter treshold in area0,when timeout counter greater than threshold, generate interrupt</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDCCA_CHK_AREA0_TO_THRES</name>
              <description>EDCCA_IDLE timeout threshold in area0,unit:4us,default:16us</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDCCA_CHK_AREA0_START</name>
              <description>EDCCA_IDLE_area0 end time,start form TBTT,unit:256us,default:1.024ms</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RFOFF_BY_EDCCA_CTRL1</name>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00020424</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFOFF_EDCCA_EN</name>
              <description>enable function of rf off by edcca idle timeout</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOFF_EDCCA_SEL_EDCCA</name>
              <description>1:sel edcca as instruction</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOFF_EDCCA_SEL_CCA</name>
              <description>1:sel cca as instruction</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOFF_EDCCA_SEL_NAV</name>
              <description>1:sel nav as instruction</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDCCA_CHK_AREA1_CNT_THRES</name>
              <description>EDCCA_IDLE timeout counter treshold in area1,when timeout counter greater than threshold, generate interrupt</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDCCA_CHK_AREA1_TO_THRES</name>
              <description>EDCCA_IDLE timeout threshold in area1,unit:4us,default:16us</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDCCA_CHK_AREA1_START</name>
              <description>EDCCA_IDLE_area1 start time,start form TBTT,unit:256us,default:9.216ms</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RFOFF_BY_EDCCA_CTRL2</name>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0001043B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDCCA_STATUS</name>
              <description>indicate edcca or edcca|cca status of channel</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EDCCA_CHK_AREA2_CNT_THRES</name>
              <description>EDCCA_IDLE timeout counter treshold in AREA2,when timeout counter greater than threshold, generate interrupt</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDCCA_CHK_AREA2_TO_THRES</name>
              <description>EDCCA_IDLE timeout threshold in AREA2,unit:4us,default:16us</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDCCA_CHK_AREA2_START</name>
              <description>EDCCA_IDLE_AREA2 start time,start form TBTT,unit:256us,default:15.104ms</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_periodic_cca_ctrl_0</name>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x40282852</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POWER_WAIT_AAGC_DONE</name>
              <description>set1:when cca rsie up before power detect done,wait aagc_done to reenter power detect</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>S(8,0), offset for beacon rssi(signed)</description>
              <bitRange>[29:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_MEAN</name>
              <description>RSSI LATCH mean by 1cycle/2cycle/4 cycle/8cycle</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_HIT</name>
              <description>RSSI hit with 1cycle/2cycle/4cycle/8cylce</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER_BIAS_N</name>
              <description>Power calculated by aagc model compared with r_rssi_backup minus r_power_bias_n(unsigned)</description>
              <bitRange>[17:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER_BIAS_P</name>
              <description>Power calculated by aagc model compared with r_rssi_backup plus r_power_bias_p(unsigned)</description>
              <bitRange>[10:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER_PERIOD</name>
              <description>Period time for calculate power
0:0.8us /1:1.6us /2:2.4us
3:3.2us /4:4.0us /5:4.8us
6:5.6us /7:6.4us</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIODIC_CCA</name>
              <description>Enable or disable periodic cca function  when rxbcn</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_periodic_cca_ctrl_1</name>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00099235</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_BCN_UPT_RSSI</name>
              <description>update rssi_backup when rx bcn with address match</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYSTATUS_PERIOD</name>
              <description>Period time for cca end to data on end and phystatus upload and RF settling
0:1us /1:2us /2:3us/ 3:4us</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_BREAK_BB_SEL</name>
              <description>0: use BBRST=0 (function disable) to break bb
1:not break bb</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_BACKUP</name>
              <description>Backup rssi (unsigned)</description>
              <bitRange>[17:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA_WAIT_PERIOD</name>
              <description>Wait time for CCK CCA
0:5us /1:10us /2:15us 3:20us /4:25us /5:30us
6:35us /7:40us</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STANDBY_PERIOD_PWROK</name>
              <description>Period time for RF standby if power is match 0:30us/1:35us /1:40us/ 2:45us/ 3:50us
4:55us /5:60us.. 14:105us/ 15:110us</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STANDBY_PERIOD_PWRMIS</name>
              <description>Period time for RF standby if power is mismatch 0:30us/1:35us /1:40us/ 2:45us/ 3:50us
4:55us /5:60us.. 14:105us/ 15:110us</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_periodic_cca_ctrl_2</name>
          <addressOffset>0x0000019C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0030014A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IGI_OFFSET</name>
              <description>S(4,0), offset for beacon rssi(unsigned)</description>
              <bitRange>[22:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_GAP</name>
              <description>if the difference of average rssi between state of power monitor and state of wait cca is too large(&gt;=r_rssi_gap),the cca will be thought as false alarm</description>
              <bitRange>[18:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_SETTLE2_PERIOD</name>
              <description>settling time for RF if BB &amp; RF is already enabled,
0:0us, 1:0.2us, 2:0.4us and so on</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_SETTLE1_PERIOD</name>
              <description>settling time for RF if BB &amp; RF is enabled form standby mode,
0:0us, 1:0.2us, 2:0.4us and so on</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
