Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_periodic_cca_ctrl_3</name>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x1D700000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IGI_BACKUP_ADDR</name>
              <description>Reg address for igi information
(for amebad,igi reg is set in BB reg 0x1d70)</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIODIC_CCA_SFD_RSTBB</name>
              <description>1:mac check sfd fail will rstbb
0:mac check sfd fail will not rstbb</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIODIC_CCA_SFD_SEL</name>
              <description>0:check sfd of long plcp of received beacon
1:check sfd of short plcp of received beacon</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIODIC_CCA_SFD_CHK_EN</name>
              <description>Enable check long plcp preamble or short preamble</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIODIC_CCA_BCN_LEN</name>
              <description>Supposed Length of beacon, unit:byte
If set to 0, not check length of beacon</description>
              <bitRange>[12:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIODIC_CCA_RATE_CMP_EN</name>
              <description>1:enable rate compare when periodic cca
0:disable rate compare when periodic cca</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIODIC_CCA_RATE_SEL</name>
              <description>If rate mismatch, break bb 
0:CCK 1M; 1:CCK 2M;
2:CCK 5.5M; 3:CCK11M</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_periodic_shutdown_ctrl</name>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHUTDOWN_PERIOD</name>
              <description>Period time for RF shutdown if power is match 0:60us /1:80us/ 2:100us/ 3:120us
4:140us /5:160us.. 14:340us/ 15:360us</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIODIC_SHUTDOWN</name>
              <description>Enable or disable periodic shutdown BB&amp;RF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_H2C_PTR</name>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <description>Host mailbox Read/write pointer</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H2C_FW_RDPTR</name>
              <description>When FW is noticed by the interrupt generated by 0x1CC[15:0],it will read this read pointer first then read H2C ram unit read pointer equals to write pointer,and update this read pointer in the end</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H2C_DRV_WTPTR</name>
              <description>Host Write This Byte will generate interrupt to FW,and fw will read ram for h2c message according to this pointer</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_C2H_PTR</name>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <description>fw mailbox Read/write pointer</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2H_DRV_RDPTR</name>
              <description>When HOST is noticed by the interrupt generated by 0x1CC[15:0],it will read this read pointer first then read C2H ram unit read pointer equals to write pointer,and update this read pointer in the end</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C2H_FW_WTPTR</name>
              <description>FW Write This Byte will generate interrupt to HOST,and HOST will read ram for h2c message according to this pointer</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CHK_HANG_0</name>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATE0_CHK_ENABLE</name>
              <description>function enable of check hang of state_0</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE0_CHK_HANG_VAL</name>
              <description>when r_state0_chk_enable is set, if state_0 is the value is equal to r_state0_chk_hang, starts state0_timeout_timer</description>
              <bitRange>[19:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE0_TIMEOUT_THRES</name>
              <description>timeout threshold of state0_timeout_timer, unit:16us</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CHK_HANG_1</name>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATE1_CHK_ENABLE</name>
              <description>function enable of check hang of state_1</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE1_CHK_HANG_VAL</name>
              <description>when r_state1_chk_enable is set, if state_1 is the value is equal to r_state1_chk_hang, starts state1_timeout_timer</description>
              <bitRange>[19:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE1_TIMEOUT_THRES</name>
              <description>timeout threshold of state0_timeout_timer, unit:16us</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXRLS_FIFO_CFG2</name>
          <addressOffset>0x000001C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x22184408</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_FWPKT_DYN_RLS</name>
              <description>1: enable fw packet dynamic release</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRLS_ALMOST_FULL_GAP_FW</name>
              <description>TXRLS fifo almost full threshold. Gen interrupt when available TXRLS FIFO entries smaller than the reg.  for fw packet</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RLS_FIFO_VALID_FW</name>
              <description>1: Release fifo is unempty,fw can read release fifo</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRLS_DEPTH_FW</name>
              <description>2^N, N max is 6. default is 4</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRLS_OFFSET_FW</name>
              <description>start address of TXRLS FIFO, for fw packet dynamic release
FW packet default is static release, if EN_FWPKT_DYN_RLS = 1, need to change all FIFO REG offset</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRLS_ALMOST_FULL_GAP_DRV</name>
              <description>TXRLS fifo almost full threshold. Gen interrupt when available TXRLS FIFO entries smaller than the reg.  for driver packet</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RLS_FIFO_VALID_DRV</name>
              <description>1: Release fifo is unempty,driver can read release fifo</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRLS_DEPTH_DRV</name>
              <description>2^N, N max is 6. default is 16</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRLS_OFFSET_DRV</name>
              <description>start address of TXRLS FIFO, for driver packet</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXRPT_BUF_CFG1</name>
          <addressOffset>0x000001CC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000518</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_TXRPT_RW_PTR</name>
              <description>1: clear r/w ptr of txrpt fifo</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRPT_FIFO_VALID_SW</name>
              <description>1: Release fifo is unempty,driver can read release fifo</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRPT_DEPTH</name>
              <description>2^N, N max is 6. default is 32</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRPT_OFFSET</name>
              <description>start address of TXRPT BUF</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBD_FIFO_CFG1</name>
          <addressOffset>0x000001D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x3309DB38</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSIBD_FULL_THRESHOD</name>
              <description>csibd fifo almost full threshold. Gen interrupt when available csibd numbers smaller than the reg</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBD_FULL_THRESHOD</name>
              <description>rxbd fifo almost full threshold. Gen interrupt when available rxbd numbers smaller than the reg</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSIBD_SIZE</name>
              <description>one rxbd corresponding host memory size,unit 256byts</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBD_SIZE</name>
              <description>one rxbd corresponding host memory size,unit 256byts</description>
              <bitRange>[18:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSIBD_DEPTH</name>
              <description>2^N, N max is 6.default is 8</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBD_DEPTH</name>
              <description>2^N, N max is 6.default is 8</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBD_OFFSET</name>
              <description>start address of RXBD FIFO</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXLLT_CFG</name>
          <addressOffset>0x000001D4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUTO_INIT_LLT</name>
              <description></description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LLT_BOUNDARY</name>
              <description>boundary of LLT and the limit size of LLT.  The default is 64.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TRXFF_BNDY</name>
          <addressOffset>0x000001D8</addressOffset>
          <size>32</size>
          <description>FIFO Boundary control register</description>
          <resetValue>0x037F0F00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXPKTENDADDR</name>
              <description>This register sets the upper boundary of RXFF0. The unit is 8 byte. The available memory space in RXPKTBUF for RXFF0 is configurable.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFOVFL_RSV</name>
              <description>Use this register to set reserved entries number of rxpktbuffer for overflow judgment. The rxpktbuffer overflow will be pre-asserted if the left entries count meets the value set here.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXBD_FIFO_CFG1</name>
          <addressOffset>0x000001DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVL_TXBD_NUM</name>
              <description>available txbd num in txbd fifo</description>
              <bitRange>[17:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBD_DEPTH</name>
              <description>2^N, N max is 6.default is 8</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBD_OFFSET</name>
              <description>start address of TXBD FIFO</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HIMR2</name>
          <addressOffset>0x000001E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_RADAR_SEG_END_INT_EN</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_RADAR_OK_INT_EN</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_RADAR_FAIL_INT_EN</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_RADAR_TIMEOUT_INT_EN</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_E_INT_EN</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_D_INT_EN</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_C_INT_EN</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_B_INT_EN</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_A_INT_EN</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_Timer_E_INT_EN</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_Timer_D_INT_EN</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_Timer_C_INT_EN</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_Timer_B_INT_EN</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_PS_Timer_A_INT_EN</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HISR2</name>
          <addressOffset>0x000001E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_RADAR_SEG_END_INT</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_RADAR_OK_INT</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_RADAR_FAIL_INT</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_RADAR_TIMEOUT_INT</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_E_INT</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_D_INT</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_C_INT</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_B_INT</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_ELY_Timer_A_INT</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_Timer_E_INT</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_Timer_D_INT</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_Timer_C_INT</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_Timer_B_INT</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_PS_Timer_A_INT</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
