Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_MACIDCAM_ADDR0</name>
          <addressOffset>0x000001E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xCC7A284B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BACAM_CFG_ADDR_START</name>
              <description>Start address of bacam for ba cfg, which should be 0x1b8[18:11] + 0x1b8[23:19] + 4*2*0x1b8[23:19]</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYCAM_CFG_ENTRY_NUM</name>
              <description>Total entry numbers for key cfg cam, 1 entry=8byte=2 key cfg</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYCAM_CFG_ADDR_START</name>
              <description>Start address of keycam for key cfg, which should be 10*2*0x1b8[2:0] + 0x1b8[10:3]</description>
              <bitRange>[18:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRLINFO_CAM_ADDR_START</name>
              <description>Start address of ctrl info cam, which should be 3*0x1b8[2:0]</description>
              <bitRange>[10:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC5_CAM_ENTRY_NUM</name>
              <description>Crc5 entry number for either A1,A2 and A3, 1 entry =8byte=10 crc5 should greater than 0, default is 3,which means the max macid number is 30.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACIDCAM_ADDR1</name>
          <addressOffset>0x000001EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000DF2F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYCAM_SIZE_256_EN</name>
              <description>1: key size in keycam is 256bit
0: key size in keycam depend on ex_sectype in keycam cfg</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFILTER_CFG_ENTRY_NUM</name>
              <description>Total entry numbers for rx filter cfg cam, 1 entry=8byte=2 rx filter cfg</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFILTER_CFG_ADDR_START</name>
              <description>Start address of rxfilter cam, which should be 0x1b8[31:24] + 0x1bc[4:0] + 2*0x1bc[4:0]</description>
              <bitRange>[12:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BACAM_CFG_ENTRY_NUM</name>
              <description>Total entry numbers for rxba cfg cam,1 entry=8byte=2 BA cfg</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_PAGE1_ON</name>
          <addressOffset>0x000001F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description>dummy</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_STATE_DEBUG_CONTROL</name>
          <addressOffset>0x000001F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATE_DBG_SEL_1</name>
              <description>select state machine 1 for debug  port</description>
              <bitRange>[15:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE_DBG_SEL_0</name>
              <description>select state machine 0 for debug  port</description>
              <bitRange>[9:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE_DBG_EN_1</name>
              <description>enable state machine 1 for debug  port</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE_DBG_EN_0</name>
              <description>enable state machine 1 for debug  port</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_DBG_SHIFT</name>
              <description>MACDEBUG[31:0] byte shift control signal
2'b00: MACDEBUG[31:0]
2'b01:{MACDEBUG[7:0],MACDEBUG[31:8]}
2'b10:{MACDEBUG[15:0],MACDEBUG[31:16]}
2'b11:{MACDEBUG[23:0],MACDEBUG[31:24]}</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MGEN_OFF</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x0000116C</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0000116C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_FISR1</name>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FS_RADAR_SEG_END_INT</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RADAR_OK_INT</name>
              <description></description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RADAR_FAIL_INT</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RADAR_TIMEOUT_INT</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TBTT1_INT</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TBTT_DISC_INT</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TBTT_SYNC_2G_INT</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TBTT_SYNC_5G_INT</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXBCNOK0_INT</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXBCNOK1_INT</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXBCNERR0_INT</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXBCNERR1_INT</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXBCNOK_DISC_INT</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXBCNOK_SYNC_INT</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXBCNERR_DISC_INT</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXBCNERR_SYNC_INT</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_SDF_START_INT</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_DWWIN_END_INT</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXRPT_INT</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_BCN_IE_0_HIT_INT</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_BCN_IE_1_HIT_INT</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_BC_TWT_PARA_CHG_INT</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RSSI_MATCH_INT</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FISR2</name>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FS_WLBB_HIGH_PRI_INT</name>
              <description></description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_WLBB_LOW_PRI_INT</name>
              <description></description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_HIOE_CHN_BB_HW_INT</name>
              <description></description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TRIG_LAT_AUDIO_CNT_INT</name>
              <description></description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXBCN_TSF_GT_THRES_INT</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXBCN_TIMEUP_CNT_INT</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXBCN_TIMEUP_CNT1_INT</name>
              <description></description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXBCN_TIME_UP_INT</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_BCN_ERR_P0_INT</name>
              <description></description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_BCN_OK_P0_INT</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TIM_NO_HIT_INT</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TIM_HIT_INT</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_HIOE_CHN_ON_INT</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_HIOE_CHN_OFF_INT</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_HIOE_CHN_MAC_HW1_INT</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_HIOE_CHN_MAC_HW0_INT</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_HIOE_CHN_BCN_MODE_INT</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_CCA2HIOE_TSFT_AVG_GT_THRES_INT</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_EDCCA_IDLE_TOCNT_INT</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXBCN_CNT_END_INT</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXFTMREQ_INT</name>
              <description>If RXFTMREQ_INT_EN =1. When HW receive FTMREQ packet, it will generate interrupt to firmware.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXFTM_INT</name>
              <description>If RXFTM_INT_EN =1. When HW receive FTM and transmit ACK frame successfully, the BB generate FTM report. It will generate interrupt to firmware.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TXFTM_INT</name>
              <description>If TXFTM_INT_EN =1. When HW transmit FTM and receive ACK frame successfully, the BB generate FTM report. It will generate interrupt to firmware.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_BTCMD_INT</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_BT_MAILBOX_INT</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_GNT_BT_BB_FALL_INT</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_GNT_BT_BB_RISE_INT</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_BT_GPIO_TOGGLE_INT</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_FSM1_CHK_HANG_TO_INT</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_FSM0_CHK_HANG_TO_INT</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
