Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_FISR3</name>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FS_RXPLCP_CHKOK_INT</name>
              <description>RXPCLP check ok interrupt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXDONE0_INT</name>
              <description>Rx Packet 0 done interrupt (for WOL release packet)</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_UCMD0_INT</name>
              <description>The interrupt is issued while receiving unicast data frame with More Data=0</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_UCMD1_INT</name>
              <description>The interrupt is issued while receiving unicast data frame with More Data=1</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_BCMD0_INT</name>
              <description>The interrupt is issued while receiving broadcast data frame with More Data=0</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_BCMD1_INT</name>
              <description>The interrupt is issued while receiving broadcast data frame with More Data=1</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_UAPSDMD1_INT</name>
              <description>Setting this bit indicates Rx pkt is matched with one of below:
1.) QoS Unicast data frame with MD=1, UAPSD=0
2.) NonQoS Unicast data frame with MD=1</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_UAPSDMD0_INT</name>
              <description>Setting this bit indicates Rx pkt is matched with one of below:
1.) QoS Unicast data frame with MD=0, UAPSD=0
2.) NonQoS Unicast data frame with MD=0</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_EOSP_INT</name>
              <description>EOSP_INT interrupt mask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXUCMD0_ACK_INT</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXUCMD1_ACK_INT</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXBCMD0_ACK_INT</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RXBCMD1_ACK_INT</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_MORE_TF0_INT</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RX_MORE_TF1_INT</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_ERR_HAPPENED_INT</name>
              <description>FWHW/ WMAC error status interrupt(0x4E2[15:0], 0x6B8[31:0]). WMAC error state will be recovered by HW, the others won't.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_P0_PKTIN_INT</name>
              <description>port 0 packet assign to queue interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_P1_PKTIN_INT</name>
              <description>port 1 packet assign to queue interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TX_NULL1_P0_INT</name>
              <description>TX null 1 packet done interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TX_NULL0_P0_INT</name>
              <description>TX null 0 packet done interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_TRIGGER_PKT_INT</name>
              <description>tx TRIGGER_PKT interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RLS_FIFO_ALMOST_FULL_FW_INT</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RLS_FIFO_FULL_FW_INT</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_RLS_FIFO_VALID_FW_INT</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FS_FW_CPUMGQ_RLS_INT</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_1</name>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_1</name>
              <description>FW_DBG_1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_2</name>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_2</name>
              <description>FW_DBG_2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_3</name>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_3</name>
              <description>FW_DBG_3</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_4</name>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_4</name>
              <description>FW_DBG_4</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_5</name>
          <addressOffset>0x00001100</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_5</name>
              <description>FW_DBG_5</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_6</name>
          <addressOffset>0x00001104</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_6</name>
              <description>FW_DBG_6</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_7</name>
          <addressOffset>0x00001108</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_7</name>
              <description>FW_DBG_7</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FW_DBG_8</name>
          <addressOffset>0x0000110C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_DBG_8</name>
              <description>FW_DBG_8</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_MAILBOX_DATA_IN_L</name>
          <addressOffset>0x00001110</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAILBOX_DATA_IN_BT2WL_L</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_MAILBOX_DATA_IN_H</name>
          <addressOffset>0x00001114</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAILBOX_DATA_IN_BT2WL_H</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_Mailbox_control</name>
          <addressOffset>0x00001118</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mailbox_in_rdy_inten</name>
              <description>Mailbox IN ready interrupt enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAILBOX_in_rdy</name>
              <description>Mailbox ready BT2Wifi</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description></description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAILBOX_out_vld_clr</name>
              <description>clear Mailbox ACK Wifi2BT</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description></description>
              <bitRange>[6:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAILBOX_outempty_inten</name>
              <description>Mailbox OUT empty interrupt enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAILBOX_out_vld_set</name>
              <description>Mailbox ACK Wifi2BT</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BB_ACCESS_CTRL</name>
          <addressOffset>0x0000111C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_WRITE_READ</name>
              <description>00 : No Active Baseband cycle
01 : Baseband Write Access (auto return to 00 when access finished)
1X : Baseband Read Access (auto return to 00 when access finished)</description>
              <bitRange>[31:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[29:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_WRITE_EN</name>
              <description>Byte Write Enable</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BB_ADDR</name>
              <description>Baseband Access Write/Read Address (in DW unit)</description>
              <bitRange>[15:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_ERRACC</name>
              <description>Duplicate Access when previous cycle pending (write one clear)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BB_ACCESS_DATA</name>
          <addressOffset>0x00001120</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_DATA</name>
              <description>Baseband Access Write/Read Data (in DW unit)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CSIFF_PTR</name>
          <addressOffset>0x00001128</addressOffset>
          <size>32</size>
          <description>CSI FIFO Read/write pointer</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSIPKT_RDPTR</name>
              <description>The read pointer address of CSIBUFFER. The value is set to the physical LX bus address. 8byte unit</description>
              <bitRange>[26:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSIPKT_WRPTR</name>
              <description>The write pointer address of CSIBUFFER. The value is set to the physical LX bus address. 8byte unit</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXBD_FIFO_CFG0</name>
          <addressOffset>0x0000112C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_WR_TXBD_DATA</name>
              <description>SW write host address to TXBD FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXRLS_FIFO_CFG0</name>
          <addressOffset>0x00001130</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DRV_RD_TXRLS_DATA</name>
              <description>Driver read released host address from memory</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXRLS_FIFO_CFG1</name>
          <addressOffset>0x00001134</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_RD_TXRLS_DATA</name>
              <description>FW read released host address from memory</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXRPT_BUF_CFG0</name>
          <addressOffset>0x00001138</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_RD_TXRPT_DATA</name>
              <description>FW read TXRPT data from memory</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBD_FIFO_CFG0</name>
          <addressOffset>0x0000113C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_WR_RXBD_DATA</name>
              <description>SW write host address to RXBD FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CSIBD_FIFO_CFG0</name>
          <addressOffset>0x00001140</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_WR_CSIBD_DATA</name>
              <description>SW write host address to CSIBD FIFO</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CSIBD_RDATA</name>
          <addressOffset>0x00001144</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_RD_CSIBD_DATA</name>
              <description>SW read released CSIBD host address from memory</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBD_RDATA</name>
          <addressOffset>0x00001148</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_RD_RXBD_DATA</name>
              <description>SW read released RXBD host address from memory</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LOOPBACK</name>
          <addressOffset>0x00001154</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELAY_LBK</name>
              <description>delay loop back mode</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGLBK</name>
              <description>loop back mode</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_LBK_START_ADDR</name>
              <description>start address of delay loopback pkt in ext_rxpktbuf</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_PAGE1_OFF</name>
          <addressOffset>0x00001158</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description>dummy</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
