Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_RXFF_PTR</name>
          <addressOffset>0x0000115C</addressOffset>
          <size>32</size>
          <description>RX  FIFO Read/write pointer</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXPKT_RDPTR</name>
              <description>The read pointer address of RXFF0. The value is set to the physical LX bus address. 8byte unit</description>
              <bitRange>[26:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXPKT_WRPTR</name>
              <description>The write pointer address of RXFF0. The value is set to the physical LX bus address. 8byte unit</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_MAILBOX_DATA_OUT_L</name>
          <addressOffset>0x00001160</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAILBOX_DATA_OUT_WL2BT_L</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_MAILBOX_DATA_OUT_H</name>
          <addressOffset>0x00001164</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAILBOX_DATA_OUT_WL2BT_H</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_MAILBOX_INT</name>
          <addressOffset>0x00001168</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_MAILBOX_SYS_INT_EN</name>
              <description>bt2wl and wl2bt mailbox interrupt mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_MAILBOX_SYS_INT</name>
              <description>bt2wl and wl2bt mailbox interrupt, to system intr</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDMA</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x00000218</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000218</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_RXDMA_STATE</name>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDMA_RESET</name>
              <description>when set to 1, enable rxdma ctl state set to IDLE</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXDMA_GCLK_EN</name>
              <description>when set to 1, enable rxdma clock gating funtion</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSIPKT_NUM_OVERFLOW</name>
              <description>csipkt number in CSIPKTBUFFER greater than 255</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSIDMA_PKT_REQ</name>
              <description>csidma has request</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_ST_IDLE_CSI</name>
              <description>csidma is idle</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDMA_SFF_UNDERFLOW</name>
              <description>rxdma syncfifo is underflow</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDMA_SFF_OVERFLOW</name>
              <description>rxdma syncfifo is overflow</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXPKT_NUM_OVERFLOW</name>
              <description>rxpkt number in RXPKTBUFFER greater than 255</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDMA_PKT_REQ</name>
              <description>rxdma has request</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_ST_IDLE_RX</name>
              <description>rxdma is idle</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PKT_ARB</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSIPKT_RELEASE_POLL</name>
              <description>One pulse. When this bit is set, RXDMA will decrease CSI PKT counter by one. Before this bit is polled, FW shall update RXFF_RD_PTR first.</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXPKT_RELEASE_POLL</name>
              <description>One pulse. When this bit is set, RXDMA will decrease RX PKT counter by one. Before this bit is polled, FW shall update RXFF_RD_PTR first.</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>FW_RELEASE_EN</name>
              <description>When this bit is set, RXDMA will stop after on-going RXDMA packet to host completed</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FW_UPD_RDPTR</name>
              <description>FW shall update this register before FW write RXPKT_RELEASE_POLL to 1. 8bytes unit</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXPKT_NUM</name>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSIPKT_NUM</name>
              <description>The number of packets in CSIPKTBUF.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXPKT_NUM</name>
              <description>The number of packets in RXPKTBUF.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WDMA_DEBUG</name>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDMA_DBG</name>
              <description>debug signal of WDMA_TOP</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBD_PTR</name>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBD_FIFO_FULL</name>
              <description>Available rxbd and used rxbd is equal to total rxbd number</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBD_RPTR_HW</name>
              <description>read pointer of HW of RXBD MEM</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBD_RPTR_SW</name>
              <description>read pointer of SW of RXBD MEM</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBD_WPTR_SW</name>
              <description>write pointer of SW of RXBD MEM</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CSIBD_PTR</name>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description>dummy</description>
              <bitRange>[31:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSIBD_FIFO_FULL</name>
              <description>Available csibd and used csibd is equal to total rxbd number</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSIBD_RPTR_HW</name>
              <description>read pointer of HW of CSIBD MEM</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSIBD_RPTR_SW</name>
              <description>read pointer of SW of CSIBD MEM</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSIBD_WPTR_SW</name>
              <description>write pointer of SW of CSIBD MEM</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_USED_BD_NUM</name>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSIBD_HW_AVAIL_NUM</name>
              <description>available csibd number</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBD_HW_AVAIL_NUM</name>
              <description>available rxbd number</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSIBD_HW_USED_NUM</name>
              <description>used csibd number</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBD_HW_USED_NUM</name>
              <description>used rxbd number</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
