Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AHB_LOCAL</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x00000308</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000308</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_AXI_CTRL</name>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000F0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAX_TXDMA</name>
              <description>RXDMA Burst Size selection default 3.
0: 4bytes; 1: 16bytes; 2: 32bytes; 3: 64bytes</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_RXDMA</name>
              <description>TXDMA Burst Size selection default 3.
0: 4bytes; 1: 16bytes; 2: 32bytes; 3: 64bytes.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_STOPTX</name>
              <description>TX packet DMA STOP</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_STOPPTCL</name>
              <description>PTCL packet DMA STOP</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_STOPCSI</name>
              <description>CSI packet DMA STOP</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_STOPRX</name>
              <description>RX packet DMA STOP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Dummy</name>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PAGE4</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x00000500</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000500</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_Q0_INFO</name>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_Q0</name>
              <description>The LLT index of the last packet of QUEUE0.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_Q0</name>
              <description>The LLT index of the first packet of QUEUE0.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_Q0</name>
              <description>The total QUEUE0 pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_Q0</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_Q0</name>
              <description>AC type of QUEUE0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q1_INFO</name>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_Q1</name>
              <description>The LLT index of the last packet of QUEUE1.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_Q1</name>
              <description>The LLT index of the first packet of QUEUE1.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_Q1</name>
              <description>The total QUEUE1 pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_Q1</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_Q1</name>
              <description>AC type of QUEUE1</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q2_INFO</name>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_Q2</name>
              <description>The LLT index of the last packet of QUEUE2.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_Q2</name>
              <description>The LLT index of the first packet of QUEUE2.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_Q2</name>
              <description>The total QUEUE1 pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_Q2</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_Q2</name>
              <description>AC type of QUEUE2</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q3_INFO</name>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_Q3</name>
              <description>The LLT index of the last packet of QUEUE3.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_Q3</name>
              <description>The LLT index of the first packet of QUEUE3.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_Q3</name>
              <description>The total QUEUE1 pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_Q3</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_Q3</name>
              <description>AC type of QUEUE3</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q4_INFO</name>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_Q4</name>
              <description>The LLT index of the last packet of QUEUE4.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_Q4</name>
              <description>The LLT index of the first packet of QUEUE4.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_Q4</name>
              <description>The total QUEUE4 pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_Q4</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_Q4</name>
              <description>AC type of QUEUE4</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q5_INFO</name>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_Q5</name>
              <description>The LLT index of the last packet of QUEUE5.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_Q5</name>
              <description>The LLT index of the first packet of QUEUE5.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_Q5</name>
              <description>The total QUEUE5 pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_Q5</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_Q5</name>
              <description>AC type of QUEUE5</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q6_INFO</name>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_Q6</name>
              <description>The LLT index of the last packet of QUEUE6.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_Q6</name>
              <description>The LLT index of the first packet of QUEUE6.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_Q6</name>
              <description>The total QUEUE6 pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_Q6</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_Q6</name>
              <description>AC type of QUEUE6</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q7_INFO</name>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_Q7</name>
              <description>The LLT index of the last packet of QUEUE7.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_Q7</name>
              <description>The LLT index of the first packet of QUEUE7.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_Q7</name>
              <description>The total QUEUE7 pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_Q7</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_Q7</name>
              <description>AC type of QUEUE7</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MGQ_INFO</name>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_MGQ</name>
              <description>The LLT index of the last packet of MGQ.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_MGQ</name>
              <description>The LLT index of the first packet of MGQ.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_MGQ</name>
              <description>The total MGQ pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_MGQ</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_MGQ</name>
              <description>AC type of MGQ</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HGQ_INFO</name>
          <addressOffset>0x00000424</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_HGQ</name>
              <description>The LLT index of the last packet of HGQ.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_HGQ</name>
              <description>The LLT index of the first packet of HGQ.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_HGQ</name>
              <description>The total HGQ pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_HGQ</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_HGQ</name>
              <description>AC type of HGQ</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
