Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_QUE_EMPTY_STOP</name>
          <addressOffset>0x00000428</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x003FFF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDQ_EMPTY</name>
              <description>When this bit is raised, RDQ queue is empty. Report by MAC.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EVTQ_EMPTY</name>
              <description>When this bit is raised, EVTQ queue is empty. Report by MAC.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BCNQ1_EMPTY</name>
              <description>When this bit is raised, beacon queue of PORT2 sync beacon / PORT2 disc beacon empty.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BCNQ0_EMPTY</name>
              <description>When this bit is raised, beacon queue of PORT1 SoftAP beacon  is empty.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HGQ_EMPTY</name>
              <description>When this bit is raised, HGQ queue is empty. Report by MAC.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MGQ_EMPTY</name>
              <description>When this bit is raised, MGQ queue is empty. Report by MAC.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC7Q_EMPTY</name>
              <description>When this bit is raised, AC7 queue is empty. Report by MAC.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC6Q_EMPTY</name>
              <description>When this bit is raised, AC6 queue is empty. Report by MAC.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC5Q_EMPTY</name>
              <description>When this bit is raised, AC5 queue is empty. Report by MAC.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC4Q_EMPTY</name>
              <description>When this bit is raised, AC4 queue is empty. Report by MAC.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC3Q_EMPTY</name>
              <description>When this bit is raised, AC3 queue is empty. Report by MAC.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC2Q_EMPTY</name>
              <description>When this bit is raised, AC2 queue is empty. Report by MAC.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC1Q_EMPTY</name>
              <description>When this bit is raised, AC1 queue is empty. Report by MAC.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC0Q_EMPTY</name>
              <description>When this bit is raised, AC0 queue is empty. Report by MAC.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC7Q_STOP</name>
              <description>When this bit is raised, AC7 queue is stop. Report by MAC.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC6Q_STOP</name>
              <description>When this bit is raised, AC6 queue is stop. Report by MAC.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC5Q_STOP</name>
              <description>When this bit is raised, AC5 queue is stop. Report by MAC.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC4Q_STOP</name>
              <description>When this bit is raised, AC4 queue is stop. Report by MAC.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC3Q_STOP</name>
              <description>When this bit is raised, AC3 queue is stop. Report by MAC.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC2Q_STOP</name>
              <description>When this bit is raised, AC2 queue is stop. Report by MAC.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC1Q_STOP</name>
              <description>When this bit is raised, AC1 queue is stop. Report by MAC.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AC0Q_STOP</name>
              <description>When this bit is raised, AC0 queue is stop. Report by MAC.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PTCL_TB_CTRL</name>
          <addressOffset>0x0000042C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00418078</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_DL_BCNQ0</name>
              <description>1: ptcl consider there is bcn pkt in TXBUF when bcn pkt first be transferd in;
0: mask bcn pkt num in bcn queue</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DL_BCNQ1</name>
              <description>1: ptcl consider there is bcn pkt in TXBUF when bcn pkt first be transferd in;
0: mask bcn pkt num in bcn queue</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNQ_PKT_REL_EN</name>
              <description>If this bit is set, the BCN pkt will be set to non-valid after BCN TX.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR_REQ_REL_BCNQ_EN</name>
              <description>If this bit is set, the BCN pkt will be set to non-valid when scheduler clear TX BCN CMD even non-TX.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_RND_PRI</name>
              <description>queue select priority control
1:old round robin method
0:depend on last selected queue</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_FOUR_QUEUE</name>
              <description>1: Enable 88C 4AC Mode
0: Enable 8723 ACQ0~7 Mode</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MGQ_DEL_EN</name>
              <description>1: MGQ packet will be dropped when enable macid delete function; 0: MGQ packet cannot be dropped</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HGQ_DEL_EN</name>
              <description>1: HGQ packet will be dropped when enable macid delete function; 0: HGQ packet cannot be dropped</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOREDATA_BYPASS</name>
              <description>For HGQ moredata field.
1: bypass txdesc.moredata bit</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_STATUS_TRIPKT</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PKTIN_TRIPKT</name>
              <description>If trigger frame is transmitted into txpktbuf, HW generates interrupt
1: Enable
0: Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVTQ_DEL_EN</name>
              <description>1: EVTQ packet will be dropped when enable macid delete function; 0: EVTQ packet cannot be dropped</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_BLOCK_PKTIN</name>
              <description>1: allow different macid+ac packet assigned to same ACQ queue</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_HTC_RATE_ADPT</name>
              <description>1: if tx data rate fallback to CCK/OFDM rate, HW will remove HTC field in mac header</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_ONLY_TB_HTC</name>
              <description>1: only TB can carry HTC field</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CTRL_HTC</name>
              <description>1: rts/cts2s/cts2ap/bar will carry HTC field by ctrl_wrapper frame, valid when txdesc.HTC = 1
0: rts/cts2s/cts2ap/bar will NOT carry HTC field even though txdesc.HTC = 1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNORE_QOS_NULL</name>
              <description>1: will not TX QoS Null when rx Basic trigger</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHK_TB_AGG</name>
              <description>When this bit is set, check agg_max_num and agg_max_time</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_CHK_TB_AC</name>
              <description>When this bit is set, don't care the AC of DATA</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TB_PRETX</name>
              <description>When this bit is set, enable pretx function of TB PPDU, assert txen before gen_cmd_rdy.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_UPD_TB_RETRY</name>
              <description>enable write retrybit in MH and add retrycnt when TB PPDU TX fail.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TB_SIFS_BK</name>
              <description>If sifs_timeout_tb_ref (from trxptcl) asserted, break the aggr process of TB PPDU</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PKTIN_CPUMGQ_INT</name>
              <description>If cpumgq pktin, HW generates pktin interrupt
1: Enable
0: Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TB_BYPASS_TXPOWER</name>
              <description>1: NOT abort TB PPDU even the txpwr_abort_tx_idx(from txpwr_ctrl) is illegal
0: enable tx power abort TB</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TB_DEL_EN</name>
              <description>Enable TB PPDU packet delete: 1) pkt_ageout; 2) macid_delete</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BCNQ_ADDR0</name>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BCNQ_ADDR0</name>
              <description>The address of beacon frame in host memory. For SoftAP beacon(P1)
Generate a pulse to inform the update of ADDR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BCNQ_ADDR1</name>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BCNQ_ADDR1</name>
              <description>The address of beacon frame in host memory.
For NAN sync Beacon (P2, 2.4G and 5G) and NAN Disc Beacon (P2) 
Generate a pulse to inform the update of ADDR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AMPDU_CTRL</name>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xC32004A1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_PRE_TX_CMD</name>
              <description>enable pre tx cmd to use aggr more packet</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_PRETX_AGGR_EN</name>
              <description>1: enable PRETX function, default is enable
0: disable PRETX function</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_PRETX_AGGR_TIME</name>
              <description>If BIT_PRETX_AGGR_EN = 1, the bits will count down after PHYTXON signal asserting every transmission in pre-tx mode.(Default: 23F, mac_clk = 20MHz, 3us;Smart,mac_clk = 40MHz, 3.5us)</description>
              <bitRange>[29:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRY_PKT_LMT</name>
              <description>aggr packet limit 
valid when Try_rate of txdesc or ctrl_info is 1</description>
              <bitRange>[15:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_WAIT_TXDESC_WDONE</name>
              <description>1: wait write txdesc done before assert set_cmd_p</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLE_AMPDU_EN</name>
              <description>If this bit is set, Enable single sub-frame APMDU.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_A_CTRL_BREAK</name>
              <description>1: break the AGGR process when the a_ctrl field in TXDESC is different</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_RTY_BK_COD</name>
              <description>AMPDU aggregation mode with retry MPDUs and new MPDUs.
When this bit is enabled, if new MPDU's data rate is not the same as retry MPDUs' fallback data rate, the aggregation will be broken.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_RETRY_BK</name>
              <description>AMPDU aggregation mode with retry MPDUs and new MPDUs.
When this bit is clear enabled, an AMPDU aggregates retried MPDU and new MPDU. All the aggregation criteria is still the same with normal AMPDU operation.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USE_INI_RATE</name>
              <description>0: If Txdesc's USE RATE = 0 and this field is equal to 0, the datarate of TXRPT SRAM is used as tx pkt's datarate. (ECO flow)
1: TXInfo's datarate is used as tx pkt's datarate.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS_NAV_BK</name>
              <description>Control The RTS NAV criteria for TX.
When this bit is clear, TX may aggregates only according to the number of MPDUs existing in the TXPKTBUF, the limit of aggregation size and number, and also the break time. 
When this bit is set, TX will be under the RTS NAV criteria. No excess RTS NAV is allowed.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_SSN_CHECK</name>
              <description>Disable checker the SSN rule when generating AMPDU TX cmd.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MACID_MATCH_RTS</name>
              <description>Enable the packet that follow the RTS have same MACID</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BMC_NAV_PROTECT</name>
              <description>Enable the NAV protection when transmit broadcast/multicast</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AMPDU_MAX_LENGTH</name>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x1464FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGGR_MAX_NUM</name>
              <description>the maximum aggregation packet number limit</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPDU_MAX_TIME</name>
              <description>AMPDU duration limit in the unit of 32us.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AGGR_MAX_LENGTH</name>
              <description>AMPDU length limit, unit:128Byte</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FREE_TAIL_SIFS</name>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000100A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FW_FREE_TAIL</name>
              <description>Real-time Free Tail LLT_index Number</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPEC_SIFS_OFDM_PTCL</name>
              <description>The spec SIFS value for duration calculation</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPEC_SIFS_CCK_PTCL</name>
              <description>The spec SIFS value for duration calculation</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
