Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_TXBF_CTRL</name>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x04001800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_NDPA</name>
              <description>Set '1' for MAC to enable sending NDPA or NDP Announcement MPDU</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NDPA_RATE</name>
              <description>NDPA tx rate setting, from CCK 1M to HE NSS1 MCS9</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NDPA_BW</name>
              <description>NDPA bandwidth setting
1: 40M
0: 20M</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MU_SND_FLAG</name>
              <description>indicate the MU Beamforming, used for verification.
Assert when the packet is MU-NDPA or BFRP</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPE_FRAME_INDICATION</name>
              <description>indicate some specific frame, used for verification. 
Co-work with TXDESC.RAW and MU_SND_FLAG.
000: not specified
001: BFRP (VHT MU BF)
100: TF MU-RTS
101: TF-BFRP (HE MU BF)
111: OTHER Trigger Frame</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_NDP_BFEN</name>
              <description>1: disable beamforming with NDP</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBCN_NOBLOCK_NDP</name>
              <description>beacon packet will not block NDP packet</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBF0_40M_EN</name>
              <description>TxBF status of beamformee0 @BW=40M</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBF0_20M_EN</name>
              <description>TxBF status of beamformee0 @BW=20M</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBF0_TXAID</name>
              <description>P_AID[8:0] of the associated beamformee0</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUP_CTRL</name>
          <addressOffset>0x00000448</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_DATA_DUP</name>
              <description>1: enable data duplicate @ CCK/OFDM rate</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CCK_NONHT</name>
              <description>1: enable signaling TA or duplicate of CCK rate</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PTCL_CTN_CTRL</name>
          <addressOffset>0x0000044C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x50220D04</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_RETRY_UNIT</name>
              <description>indicate the unit of ctrl_info/txdesc data_retry_limit
0: unit=1
1: unit=2</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS_RETRY_UNIT</name>
              <description>indicate the unit of ctrl_info/txdesc rts_retry_limit
0: unit=1
1: unit=2
2: unit=4</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSC_IN_40M</name>
              <description>Value of Data frame Tx sub-carrier mode 40MHz</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSC_IN_20M</name>
              <description>Value of Data frame Tx sub-carrier mode 20MHz</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRTS_IN_TXOP</name>
              <description>1: can tx rts in txop</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_RTY_OVER_DROP</name>
              <description>1: only drop when data retry over
0: drop when data or rts retry over</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PTCL_GCLK</name>
              <description>1: enable clock gating</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GI_LTF_FB_SEL</name>
              <description>0: no GI_LTF fallback
1: GI_LTF fallback option 1 enabled (downgrade GI_LTF first from init. rate)</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHECK_CCK_EN</name>
              <description>If this bit is set, HW check Tx pkt's data rate. When data rate is CCK rate, modify the rate to NON_CCK_RATE.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS_LIMIT_IN_OFDM</name>
              <description>Rts rate will not down to cck rate</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_RTYBIT</name>
              <description>1: update Retry Bit in mac header
0: Disable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USE_DATA_BW</name>
              <description>1 : Use des2_data_bw for this packet
0 : when des1_cca_rts = 2'b10, update_bw depend on ch_bw_status</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFEND_TXTIME</name>
              <description>Cfend packet txtime bit[8:0]</description>
              <bitRange>[14:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASIC_CFEND_RATE</name>
              <description>The initial rate for basic CFEND frame transmitted as EDCA originator. The response control frame shall be selected by the definition of 802.11n. OFDM6M</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CTN_BREAK_CFG</name>
          <addressOffset>0x00000450</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000003C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_USE_PRETX_BREAK</name>
              <description>1: use max_pretx_aggr_break to replace sifs_break when en_pretx_cmd, for longer gen_cmd time</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTN_BUS_TIMEOUT</name>
              <description>when sifs_bk or max_pretx_aggr_break occurs during FETCH_TXDESC, wait bus respond, timeout will break early
unit: 1T mac_clk, default 16T</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DATA_RATE_REPT</name>
          <addressOffset>0x00000454</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x01110111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_RATE_REP_TIME1_4TH</name>
              <description>DATA1
indicate the number of repetitions of the rate after 3rd rate fallback
0: repeat 1 time
1: repeat 2 times
2: repeat 4 times
3: repeat 8 times
4: repeat 16 times</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_RATE_REP_TIME1_3RD</name>
              <description>DATA1. selected by ctrl_info 
The number of repetitions of the third rate</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_RATE_REP_TIME1_2ND</name>
              <description>DATA1. selected by ctrl_info 
The number of repetitions of the second rate</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_RATE_REP_TIME1_1ST</name>
              <description>DATA1. selected by ctrl_info 
The number of repetitions of the first rate</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_RATE_REP_TIME0_4TH</name>
              <description>DATA0
indicate the number of repetitions of the rate after 3rd rate fallback
0: repeat 1 time
1: repeat 2 times
2: repeat 4 times
3: repeat 8 times
4: repeat 16 times</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_RATE_REP_TIME0_3RD</name>
              <description>DATA0
The number of repetitions of the third rate</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_RATE_REP_TIME0_2ND</name>
              <description>DATA0
The number of repetitions of the second rate</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_RATE_REP_TIME0_1ST</name>
              <description>DATA0
The number of repetitions of the first rate</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CTRL_RATE_REPT</name>
          <addressOffset>0x00000458</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRL_RATE_REP_TIME_4TH</name>
              <description>RTA_CTS2S
indicate the number of repetitions of the rate after 3rd rate fallback
0: repeat 1 time
1: repeat 2 times
2: repeat 4 times
3: repeat 8 times
4: repeat 16 times</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_RATE_REP_TIME_3RD</name>
              <description>RTS/CTS2S
The number of repetitions of the third rate</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_RATE_REP_TIME_2ND</name>
              <description>RTS/CTS2S
The number of repetitions of the second rate</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_RATE_REP_TIME_1ST</name>
              <description>RTS/CTS2S
The number of repetitions of the first rate</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DATA_RATE_MASK0</name>
          <addressOffset>0x0000045C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_RATE_MASK_TABLE_0</name>
              <description>Data Auto Rate Fallback Table Register 0, indexed by fb_mask_idx in TXDESC.
Each bit is mapped as the following:

