Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
Bit[0:3] = {1M, 2M, 5.5M, 11M }
Bit[4:11] = {6M, 9M, 12M, 18M, 24M, 36M, 48M, 54M}
Bit[12:21] = HT/VHT/HE MCS0~MCS9</description>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DATA_RATE_MASK1</name>
          <addressOffset>0x00000460</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_RATE_MASK_TABLE_1</name>
              <description>Data Auto Rate Fallback Table Register 1, indexed by fb_mask_idx in TXDESC.
Each bit is mapped as the following:

Bit[0:3] = {1M, 2M, 5.5M, 11M }
Bit[4:11] = {6M, 9M, 12M, 18M, 24M, 36M, 48M, 54M}
Bit[12:21] = HT/VHT/HE MCS0~MCS9</description>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DATA_RATE_MASK2</name>
          <addressOffset>0x00000464</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_RATE_MASK_TABLE_2</name>
              <description>Data Auto Rate Fallback Table Register 2, indexed by fb_mask_idx in TXDESC.
Each bit is mapped as the following:

Bit[0:3] = {1M, 2M, 5.5M, 11M }
Bit[4:11] = {6M, 9M, 12M, 18M, 24M, 36M, 48M, 54M}
Bit[12:21] = HT/VHT/HE MCS0~MCS9</description>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DATA_RATE_MASK3</name>
          <addressOffset>0x00000468</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_RATE_MASK_TABLE_3</name>
              <description>Data Auto Rate Fallback Table Register 3, indexed by fb_mask_idx in TXDESC.
Each bit is mapped as the following:

Bit[0:3] = {1M, 2M, 5.5M, 11M }
Bit[4:11] = {6M, 9M, 12M, 18M, 24M, 36M, 48M, 54M}
Bit[12:21] = HT/VHT/HE MCS0~MCS9</description>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CTRL_RATE_MASK</name>
          <addressOffset>0x0000046C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRL_RATE_MASK_TABLE</name>
              <description>CTRL(RTS/CTS2S) Auto Rate Fallback Table Register.
Each bit is mapped as the following:

Bit[0:3] = {1M, 2M, 5.5M, 11M }
Bit[4:11] = {6M, 9M, 12M, 18M, 24M, 36M, 48M, 54M}
Bit[12:21] = HT/VHT/HE MCS0~MCS9</description>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXRPT_CTRL</name>
          <addressOffset>0x00000470</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0081503F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_FTMRPT</name>
              <description>When this bit asserted, HW will report FTM rpt</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_FTMT2R_ERR</name>
              <description>Indicates the timeout error in FTM t2r report</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRPT_NUM_THRS</name>
              <description>if the number of txrpt exceeds the threshold,then assert txrpt interrupts</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRPT_DIS</name>
              <description>when this bit is enabled, HW will not generate txrpt for driver's fixed rate packets</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TXFAIL_RPT</name>
              <description>when this bit is enabled, HW will not generate txrpt for tx failed packets</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BCN_TRXRPT</name>
              <description>when this bit is enabled, HW will generate txrpt for BCN</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRPT_QUEUE_EN</name>
              <description>1: HW will report tx_status  0: no report
BIT0: BK Queue
BIT1: BE Queue
BIT2: VI Queue
BIT3: VO Queue
BIT4: MGT Queue
BIT5: HG Queue
BIT6: BCN Queue
BIT7: TB Queue
BIT8: EVENT QUEUE</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PRE_PTA_CTRL</name>
          <addressOffset>0x00000478</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00030000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTA_WL_PRI_MASK_RDQ</name>
              <description>PTCL send wl_pri to PTA when pktbuf has RDQ packet</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_WL_PRI_MASK_EVTQ</name>
              <description>PTCL send wl_pri to PTA when pktbuf has EVTQ packet</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_WL_PRI_MASK_BCNQ</name>
              <description>PTCL send wl_pri to PTA when pktbuf has BCNQ packet</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_WL_PRI_MASK_MGQ</name>
              <description>PTCL send wl_pri to PTA when pktbuf has MGQ packet</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_WL_PRI_MASK_HGQ</name>
              <description>PTCL send wl_pri to PTA when pktbuf has HGQ packet</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_WL_PRI_MASK_BK</name>
              <description>PTCL send wl_pri to PTA when pktbuf has BKQ packet</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_WL_PRI_MASK_BE</name>
              <description>PTCL send wl_pri to PTA when pktbuf has BEQ packet</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_WL_PRI_MASK_VI</name>
              <description>PTCL send wl_pri to PTA when pktbuf has VIQ packet</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_WL_PRI_MASK_VO</name>
              <description>PTCL send wl_pri to PTA when pktbuf has VOQ packet</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_WL_TX_EN</name>
              <description>enable WL PTA (should be set in init MAC)</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_EDCCA_EN</name>
              <description>0 : wl_tx signal to PTA does not consider EDCCA
1 : wl_tx signal to PTA consider EDCCA</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_GNT_BT_AWAKE</name>
              <description>Enable pollute bit function.(C card ECO item, modify hardware circuit and add two options)
0: Disable
1: Enable When (GNT_BT option/LTE_RX option/(GNT_WL==0)) == 1, retry count can't increase if Tx fail.  One or more packets will record in polluted bit field of txreport when txreport generates in Tx ok or tx drop.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BT_POLLUTE_RX</name>
              <description>enable write BT Polluted field during RX RESP</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_POLLUTE_PKT_CNT</name>
              <description>count the tx fail pkt caused by bt pollute, write 0x46C[11] will clear the counter</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PROT_MODE_CTRL</name>
          <addressOffset>0x0000047C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_TXOP_BASE_RTS</name>
              <description>enable TXOP duration-based RTS/CTS</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS_TXOP_THRS</name>
              <description>unit:32us, valid when BIT_EN_TXOP_BASE_RTS = 1</description>
              <bitRange>[30:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS_PKTTIME_THRS</name>
              <description>RTS packet txtime threshold, unit is 64 us</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS_PKTLENGTH_THRS</name>
              <description>RTS packet Length threshold, unit is 128 bytes</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BAR_MODE_CTRL</name>
          <addressOffset>0x00000480</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0F02FF7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COLLISION_DETECT_TIME</name>
              <description>0~15: The field indicated collision detect time for broadcast or Beacon packet.(unit: us)</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BAR_RTYLMT</name>
              <description>BAR retry limit</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BAR_PKTTIME_THRS</name>
              <description>BAR packet time thrs</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BAR_PKTNUM_THRS</name>
              <description>BAR Pktnum Thrs</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACID_DROP</name>
          <addressOffset>0x00000484</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACID_DROP</name>
              <description>Macid31~Macid0 Drop (per bit controlled)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACID_PAUSE</name>
          <addressOffset>0x00000488</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACID_PAUSE</name>
              <description>Macid31~Macid 0 Packet Sleep. (per bit controlled)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACID_RLS</name>
          <addressOffset>0x0000048C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACID_RELEASE</name>
              <description>Macid31~Macid0 Release(per bit controlled)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACID_PAUSE_RLS</name>
          <addressOffset>0x00000490</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACID_RLS_SEL_ONE</name>
              <description>1: will TX MPDU during macid_release_mode
0: can TX AMPDU during macid_release_mode</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MACID_OFFSET</name>
              <description>write this field to set REG_macid_release[macid_offset] = macid_value</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MACID_VALUE</name>
              <description>write this field to set REG_macid_release[macid_offset] = macid_value</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_MACID_RELEASE_RTY</name>
              <description>when release one packet for a macid, retry should happen on the same ACQ. Set 1 to remove this requirement</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_SET_MOREDATA</name>
              <description>1: Enable HW set the more data bit of the PKT that MACID release function tx.
0: Disable HW set the more data bit of the PKT that MACID release function tx.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_CLEAR_MACID_RELEASE</name>
              <description>1: HW No clear MACID Release bit after release the pkt.
0: HW will clear MACID Release bit after release the pkt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MACID_RELEASE_EN</name>
              <description>1: Enable MACID Release function. (same as MACID DROP)
0: Disable MACID Release function.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HW_SEQ0</name>
          <addressOffset>0x00000494</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HW_SSN_SEQ0</name>
              <description>When TXDESC HWSEQEN is set, MAC will overwrite SEQ control by this register. Before DRV hand over the SEQ control to HW, DRV may set the current SEQ to this register. When DRV will take back the SEQ control from HW, DRV may get the current sequence from this register.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_HWSSN</name>
              <description>HW update the SSN [6:0],
When this bit enable and EN_HWSEQ of TXDESC, MAC will overwrite MACHDR SEQ according to TXDESC QSEL
[0] BIT_HWSEQ_VO_EN
[1] BIT_HWSEQ_VI_EN
[2] BIT_HWSEQ_BE_EN
[3] BIT_HWSEQ_BK_EN
[4] BIT_HWSEQ_MGT_EN
[5] BIT_HWSEQ_HGQ_EN
[6] BIT_HWSEQ_BCN_EN,don't care  EN_HWSEQ of TXDESC
[7] BIT_HWSEQ_TBQ_EN
[8] BIT_HWSEQ_EVTQ_EN</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_HW_SEQ1_2</name>
          <addressOffset>0x00000498</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HW_SSN_SEQ2</name>
              <description>When TXDESC HWSEQEN is set, MAC will overwrite SEQ control by this register. Before DRV hand over the SEQ control to HW, DRV may set the current SEQ to this register. When DRV will take back the SEQ control from HW, DRV may get the current sequence from this register.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HW_SSN_SEQ1</name>
              <description>When TXDESC HWSEQEN is set, MAC will overwrite SEQ control by this register. Before DRV hand over the SEQ control to HW, DRV may set the current SEQ to this register. When DRV will take back the SEQ control from HW, DRV may get the current sequence from this register.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
