Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_PTCL_STATUS</name>
          <addressOffset>0x0000049C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTCL_TOTAL_PKT</name>
              <description>Total Packet in LLT</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXLLT_FULL</name>
              <description>indicate TXLLT is full</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBD_TOTAL_PKT</name>
              <description>Total Packet in TXBD FIFO</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_TXHANG_ERR</name>
              <description>Indicates the txhang error: no tx in 0xFFFF cycle</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_STATUS_ERR</name>
              <description>Indicates the status error: get invalid page (NULL PKT)</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_CTN_ERR</name>
              <description>Indicates the cnt error: get invalid page (NULL PKT)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PKTIN_ERR_2</name>
              <description>Indicates the pktin error: get invalid page (NULL PKT)</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PKTIN_ERR_1</name>
              <description>Indicates the pktin error: total page error</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PKTIN_ERR_0</name>
              <description>Indicates the pktin error: assign to invalid queue (queue_idx = 0)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_TXRPT_FULL</name>
              <description>indicates the txrpt buffer is full</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RLS_FIFO_FULL_DRV</name>
              <description>indicate TXRLS FIFO for driver is full</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RLS_FIFO_ALMOST_FULL_DRV</name>
              <description>indicate TXRLS FIFO for driver is almost full</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RLS_FIFO_FULL_FW</name>
              <description>indicate TXRLS FIFO for fw is full</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RLS_FIFO_ALMOST_FULL_FW</name>
              <description>indicate TXRLS FIFO for fw is almost full</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RTS_DATA_SEP</name>
              <description>1:rts retry cnt &amp; retry limit calculate separately</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_NULL_1</name>
              <description>Port 0/1 Tx Null 1 packet ok indicator</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_NULL_0</name>
              <description>Port 0/1 Tx Null 0 packet ok indicator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXPKT_STATISTIC</name>
          <addressOffset>0x000004A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXPKT_CNT_SEL</name>
              <description>Select the counter to show in 0X14A0 BIT_TXPKT_CNT_RPT.
0: r_TX_OK_RTY0
1: r_TX_OK_RTY1
2: r_TX_OK_RTY2
3: r_TX_OK_RTY3
4: r_TX_OK_RTY4
5: r_RTY_DROP
6: r_BMC_TXOK
7: r_TOTAL_PKT_CNT</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_MACID</name>
              <description>if BIT_REF_MACID = 0xF, count all eligible frames and ignore MACID;
else, only count the frames whose MACID = BIT_REF_MACID
BMC packet ignore MACID.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CNT_CLR</name>
              <description>Write 1 to clear the counters.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY</name>
              <description></description>
              <bitRange>[22:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_FW_RLS_FIFO_STOP_MGQ</name>
              <description>1: don't clear ptcl_mgq_has_pkt when FW release FIFO is full.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPKT_CNT_RPT</name>
              <description>The results of TXPKT counter. Depends on BIT_TXPKT_CNT_SEL.</description>
              <bitRange>[12:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PMAC_CTRL</name>
          <addressOffset>0x000004A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MP_TXNUM_THRES</name>
              <description>threshold for the number of times a frame can be transferred. If the TX counter reaches the BIT_MP_TXNUM_THRES, stop TX</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMAC_TXCNT</name>
              <description>tx statistic during PMAC</description>
              <bitRange>[19:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MP_TEST_EN_REL</name>
              <description>1: indicates that it is during the PMAC TX period</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MP_TEST_EN</name>
              <description>1: Enable PMAC function, for MP test
0: stop PMAC function</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXBD_TXRPT_RW_PTR</name>
          <addressOffset>0x000004A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXRPT_FIFO_R_PTR</name>
              <description>read pointer of TXRPT FIFO</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRPT_FIFO_W_PTR</name>
              <description>write pointer of TXRPT FIFO</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBD_R_PTR_HW</name>
              <description>read pointer of TXBD FIFO</description>
              <bitRange>[14:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBD_W_PTR_SW</name>
              <description>write pointer of TXBD FIFO</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXRLS_RW_PTR</name>
          <addressOffset>0x000004AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RLS_FIFO_R_PTR_DRV</name>
              <description>read pointer of Driver TXRLS FIFO</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RLS_FIFO_W_PTR_DRV</name>
              <description>write pointer of Driver TXRLS FIFO</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RLS_FIFO_R_PTR_FW</name>
              <description>read pointer of FW TXRLS FIFO</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RLS_FIFO_W_PTR_FW</name>
              <description>write pointer of FW TXRLS FIFO</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_EVTQ_INFO</name>
          <addressOffset>0x000004B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAIL_PKT_EVTQ</name>
              <description>The LLT index of the last packet of EVTQ.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HEAD_PKT_EVTQ</name>
              <description>The LLT index of the first packet of EVTQ.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_NUM_EVTQ</name>
              <description>The total EVTQ pkt number in TxLLT</description>
              <bitRange>[15:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEMACID_EVTQ</name>
              <description>MacID of head pkt</description>
              <bitRange>[8:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QUEUEAC_EVTQ</name>
              <description>AC type of EVTQ</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RADAR_ADDR</name>
          <addressOffset>0x000004B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADAR_ADDR</name>
              <description>The address of RADAR frame in host memory. 
Generate a pulse to inform the update of ADDR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RADAR_CFG_PAGE4</name>
          <addressOffset>0x000004B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_RDQ_NUM</name>
              <description>Clear rdq pkt number</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDQ_EN</name>
              <description>1: en rdq, can pktin</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_PAGE4</name>
          <addressOffset>0x000004FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
