Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PAGE5_ON</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x00001508</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001508</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_EDCA_VO_PARAM</name>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x002F3224</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXOPLIMIT_VO</name>
              <description>TXOP Limit
An unsigned integer in units of 32 microseconds. Value of zero indicates that a single MSDU or MMPDU in addition to a protection frame exchange can be transmitted at any rate.
Default: BK = 0h; BE = 0h; VI = 5Eh; VO = 2Fh.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CW_VO</name>
              <description>ECWmin and ECWmax encode the values of Cwmin and Cwmax respectively in an exponent form. Ex: Cwmax = 2^(ECWmax)-1
Default: BK = Ah/5h; BE = Ah/5h; VI = 5h/4h; VO = 4h/3h.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AIFS_VO</name>
              <description>Arbitrary Inter frame space
In unit of microsecond. AIFS indicates the time a non-AP QSTA should defer before either invoking a backoff or starting a transmission
Default: BK = 49h; BE = 25h; VI = 1Ch; VO = 1Ch.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_EDCA_VI_PARAM</name>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x005E4326</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXOPLIMIT_VI</name>
              <description>TXOP Limit
An unsigned integer in units of 32 microseconds. Value of zero indicates that a single MSDU or MMPDU in addition to a protection frame exchange can be transmitted at any rate.
Default: BK = 0h; BE = 0h; VI = 5Eh; VO = 2Fh.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CW_VI</name>
              <description>ECWmin and ECWmax encode the values of Cwmin and Cwmax respectively in an exponent form. Ex: Cwmax = 2^(ECWmax)-1
Default: BK = Ah/5h; BE = Ah/5h; VI = 5h/4h; VO = 4h/3h.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AIFS_VI</name>
              <description>Arbitrary Inter frame space
In unit of microsecond. AIFS indicates the time a non-AP QSTA should defer before either invoking a backoff or starting a transmission
Default: BK = 49h; BE = 25h; VI = 1Ch; VO = 1Ch.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_EDCA_BE_PARAM</name>
          <addressOffset>0x00000508</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000A42B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXOPLIMIT_BE</name>
              <description>TXOP Limit
An unsigned integer in units of 32 microseconds. Value of zero indicates that a single MSDU or MMPDU in addition to a protection frame exchange can be transmitted at any rate.
Default: BK = 0h; BE = 0h; VI = 5Eh; VO = 2Fh.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CW_BE</name>
              <description>ECWmin and ECWmax encode the values of Cwmin and Cwmax respectively in an exponent form. Ex: Cwmax = 2^(ECWmax)-1
Default: BK = Ah/5h; BE = Ah/5h; VI = 5h/4h; VO = 4h/3h.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AIFS_BE</name>
              <description>Arbitrary Inter frame space
In unit of microsecond. AIFS indicates the time a non-AP QSTA should defer before either invoking a backoff or starting a transmission
Default: BK = 49h; BE = 25h; VI = 1Ch; VO = 1Ch.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_EDCA_BK_PARAM</name>
          <addressOffset>0x0000050C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000A549</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXOPLIMIT_BK</name>
              <description>TXOP Limit
An unsigned integer in units of 32 microseconds. Value of zero indicates that a single MSDU or MMPDU in addition to a protection frame exchange can be transmitted at any rate.
Default: BK = 0h; BE = 0h; VI = 5Eh; VO = 2Fh.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CW_BK</name>
              <description>ECWmin and ECWmax encode the values of Cwmin and Cwmax respectively in an exponent form. Ex: Cwmax = 2^(ECWmax)-1
Default: BK = Ah/5h; BE = Ah/5h; VI = 5h/4h; VO = 4h/3h.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AIFS_BK</name>
              <description>Arbitrary Inter frame space
In unit of microsecond. AIFS indicates the time a non-AP QSTA should defer before either invoking a backoff or starting a transmission
Default: BK = 49h; BE = 25h; VI = 1Ch; VO = 1Ch.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BCN_MGQ_PARAM</name>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x32244413</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MGQ_CW</name>
              <description>ECWmin and ECWmax encode the values of Cwmin and Cwmax respectively in an exponent form. Ex: Cwmax = 2^(ECWmax)-1
Default: BK = Ah/5h; BE = Ah/5h; VI = 5h/4h; VO = 4h/3h.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MGQ_AIFS</name>
              <description>Arbitrary Inter frame space
In unit of microsecond. AIFS indicates the time a non-AP QSTA should defer before either invoking a backoff or starting a transmission
Default: BK = 49h; BE = 25h; VI = 1Ch; VO = 1Ch</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNCW_MAX</name>
              <description>Beacon Contention Window MAX
Defines the contention window value for back off before transmitting beacon frame. This field is set to 0 in AP mode to indicate no back off window. In ad hoc mode, its default value is 6. 26-1 = 63 time slots.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNCW_MIN</name>
              <description>Beacon Contention Window
Defines the contention window value for back off before transmitting beacon frame. This field is set to 0 in AP mode to indicate no back off window. In ad hoc mode, its default value is 6. 26-1 = 63 time slots.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNIFS</name>
              <description>Beacon Interframe Space
In units of microseconds, this register defines the medium idle time required before transmitting beacon (AP mode) or entering random back off window.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TX_QUEUE_CTRL</name>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x4000784F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DISCW</name>
              <description>When this bit is set, disable CW.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BKF_CLR_TXREQ</name>
              <description>when gen tx command done, while will backoff is invalid, then tx command will be cleared</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TXREQ_CLR_HGQ</name>
              <description>1: if this queue can't own channel ,txcmd will be cleared
0:Only TX_finish can clear txreq</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TXREQ_CLR_MGQ</name>
              <description>1: if this queue can't own channel ,txcmd will be cleared
0:Only TX_finish can clear txreq</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TXREQ_CLR_BK</name>
              <description>0: if this queue can't own channel ,txcmd will be cleared
1:Only TX_finish can clear txreq</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TXREQ_CLR_BE</name>
              <description>0: if this queue can't own channel ,txcmd will be cleared
1:Only TX_finish can clear txreq</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TXREQ_CLR_VI</name>
              <description>0: if this queue can't own channel ,txcmd will be cleared
1:Only TX_finish can clear txreq</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TXREQ_CLR_VO</name>
              <description>0: if this queue can't own channel ,txcmd will be cleared
1:Only TX_finish can clear txreq</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_STOPRDQ</name>
              <description>Stop BCNQ Queue
Write a 1 to this bit via software to immediately stop the transmission of packet from this queue including retry attempts.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_STOPEVTQ</name>
              <description>Stop BCNQ Queue
Write a 1 to this bit via software to immediately stop the transmission of packet from this queue including retry attempts.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_STOPBCNQ</name>
              <description>Stop BCNQ Queue
Write a 1 to this bit via software to immediately stop the transmission of packet from this queue including retry attempts.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_STOPHGQ</name>
              <description>Stop High Queue
Write a 1 to this bit via software to immediately stop the transmission of packet from this queue including retry attempts.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_STOPMGQ</name>
              <description>Stop Management Queue
Write a 1 to this bit via software to immediately stop the transmission of packet from this queue including retry attempts.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_STOPBK</name>
              <description>Stop BK Queue
Write a 1 to this bit via software to immediately stop the transmission of packet from this queue including retry attempts.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_STOPBE</name>
              <description>Stop BE Queue
Write a 1 to this bit via software to immediately stop the transmission of packet from this queue including retry attempts.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_STOPVI</name>
              <description>Stop VI Queue
Write a 1 to this bit via software to immediately stop the transmission of packet from this queue including retry attempts.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_STOPVO</name>
              <description>Stop VO Queue
Write a 1 to this bit via software to immediately stop the transmission of packet from this queue including retry attempts.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXNAVMASK</name>
              <description>1: Queue BKF must wait TX Nav finished 
0: Queue not need wait</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_NAVEND_RST_TXOP</name>
              <description>When set this bit, TXOP will be reset while NAV end.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TXOP_CFEND</name>
              <description>Disable TXOP_CFE function</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TBTT_OVER_BT</name>
              <description>1: Enable Beacon Tx at TBTT if BT_CCA is enabled
0: Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TXOVER_BCN</name>
              <description>1: Tx Packet with ignoring Beacon Area time
0: Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_BCN_DIS_CTN</name>
              <description>Disable the Beacon queue disable contention,when set to 0 enable the force
beacon function.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BCNERR_INCCA</name>
              <description>eneble force tx becon ignore CCA in disable contention area</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BCNERR_INEDCCA</name>
              <description>eneble force tx becon ignore EDCCA in disable contention area</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_MGQ_INTXOP</name>
              <description>When this bit is set, MGTQ may sent packets by using ACQ TXOP.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_MGQ_INRTSMF</name>
              <description>When this bit is set, MTGQ will be TX, not wait until RTS or MF transaction finished.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_HGQ_INRTSMF</name>
              <description>When this bit is set, High Q will be TX, not wait until RTS or MF transaction finished.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BCNQ_INRTSMF</name>
              <description>When this bit is set, BCNQ will be TX, not wait until RTS or MF transaction finished.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CCA_EDCCA_FILTER</name>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x1C000A8F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIFS</name>
              <description>PIFS time. It is only used in AP mode and in units of us.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CW_TIMER_STAT</name>
              <description>1: enable contention time statistic of ACQ</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CW_TIMER_TXCLR</name>
              <description>1: clear cw timer when any queue tx
0: don't clear cw timer when other queue tx</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_FILTER_CCA</name>
              <description>Enable CCA filter threshold</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA_FILTER_THRS</name>
              <description>If PHY_CCA signal width is bigger than this threshold, this PHY_CCA
signal is valid for MAC.
Unit: us</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDCCA_THRS</name>
              <description>EDCCA threshold value, edcca over this threshold will cause bkf_rst
Bit[7]: PHY_EDCCA為1時,當timer timeout時擋住TX
Bit[6:0]: timer (單位:32us)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BK_TBTT_AREA_CTRL</name>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x70A0C812</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_SIFS_BK</name>
              <description>SIFS Break Check Criteria enable for AMPDU aggregation, for normal AGGR case</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TBTT_CTN_AREA</name>
              <description>TBTT contention area,Time unit is 128us,for PORT 1 / 2</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TXOP_SIFS_BK</name>
              <description>SIFS Break Check Criteria enable for AMPDU aggregation, VALID when TXOP or RTS HOLD</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXOP_FAIL_BREAK</name>
              <description>1: if tx pkt fail in txop, then tx cfend to end txop</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TBTT_AREA_BLK_4AC</name>
              <description>When set this bit, 4AC backoff is disabled on TBTT setup period</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TBTT_AREA_FOR_BB</name>
              <description>enable notify bb that mac p0 is in tbtt area</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TBTT_PROHIBIT_HOLD</name>
              <description>TBTT_prohibit_hold time for AP mode, unit is 32 us</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TBTT_PROHIBIT_HOLD_INFRA</name>
              <description>TBTT_prohibit_hold time for infrastructure mode , unit is 2 ms</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TBTT_PROHIBIT_SETUP</name>
              <description>TBTT_prohibit_setup, unit is 32us;
If en nan-CG, this value should be set to 0x06.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
