Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_TXOP_PRE_BKF</name>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x400F400F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NAV_END_TXOP</name>
              <description>1: In txop mode, Nav protect all txop 
0: In txop mode, Nav protect to next pkt</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOPKT_END_RTSMF</name>
              <description>1: enable exit rts hold mode when there is no corresponding ac pkt to tx</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS_NAV_TXOP</name>
              <description>enable RTS NAV protect all txop</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOT_CROSS_TXOP</name>
              <description>1:tx pkt cross tbtt is prohibited 0:tx pkt cross tbtt is permitted</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAV_BLK_HGQ</name>
              <description>rxnav block HGQ</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAV_BLK_MGQ</name>
              <description>rxnav block MGQ</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_BKF_TIME</name>
              <description>when bkf timer count down this value, sel queue and gen txcmd will start. Unit: 1us</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAV_NXT_TIME</name>
              <description>In TXOP mode ,NAV setting which protects next packets</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXOP_MIN</name>
              <description>if txop counter is more than this value, than tx pkt is considered not cross tbtt. Unit: 1us</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TSFT_BCN_P0_P1_CTRL</name>
          <addressOffset>0x00000524</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0010E002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCHEDULER_RST</name>
              <description>Write this bit reset scheduler, ioreg_txfail</description>
              <bitRange>[31:31]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BYPASS_ADJ_TBTT_AREA</name>
              <description>0: Fixed an issue where tbtt_area kept pulling higher caused by tbtt_int miss 
1: follow the original practice</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_FREECNT</name>
              <description>enable freerun tsft</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_FREECNT_P</name>
              <description>reset pulse of freerun tsft</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>EN_MULTI_BCN</name>
              <description>enable multiple beacons of port0~port2</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MULTI_BCN_CS</name>
              <description>indicate which port is tx beacon</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EN_AUTO_MASK_RXPRSP_UPD</name>
              <description>valid when BIT_EN_RXPRSP_UPD = 1
1: auto disable RXPRSP's tsft update when rx probe response frame during bcn_early to tbtt(for STA mode - P0)</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_RXPRSP_UPD</name>
              <description>1: enable update tsft when RX probe response frame. (for STA mode - P0)</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P1_AUTO_SYNC_TSFT0_EN</name>
              <description>when P0 + P1 is concurrent mode, need to assert
1: sync P1's TSFT = P0's TSFT + TSFTF_SYN_OFFSET each time
0: P1's TSFT = P0's TSFT</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P1_DIS_BCN</name>
              <description>set 1 to mask the beacon early interrupt of port1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P1_EN_BCNQ</name>
              <description>When this bit is set, TSF and other beacon related functions are then enabled.
0x700(MACID1)的enable开关</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P0_TSFT_EN</name>
              <description>1: enable P0 TSFT counter, when NAN function is disable, P1 used P0 TSFT counter</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P0_TSFT_RST</name>
              <description>write this bit, bcn0 tsft will auto reset, reset to 1</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>P0_DIS_BCN</name>
              <description>set 1 to mask the beacon early interrupt of port0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P0_DIS_RX_BSSID_FIT</name>
              <description>0:HW will handle rx_beacon 1:HW will ignore rx_beacon_pk</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P0_DIS_TSF_UPT</name>
              <description>When set, disable port 0 TSF update when beacon frames or probe response frames are received.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P0_EN_BCNQ</name>
              <description>enable beacon function. When this bit is set, TSF and other beacon related functions are then enabled.
0x610(MACID)的enable开关</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PORT_BCN_SPACE</name>
          <addressOffset>0x00000528</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00640064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BCNSPACE_P1</name>
              <description>Unit is ms. the beacon space of port1</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNSPACE_P0</name>
              <description>Unit is ms. the beacon space of port0</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P0_BCN_ERLY_CTRL</name>
          <addressOffset>0x0000052C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x7F004005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELY_BCNINT_CNT_P0</name>
              <description>Be used in multiple BCNIVL early INT. When this counter =1, multiple BCNIVL early INT will be triggered.</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ELY_IGNORE_LSB</name>
              <description>1:add1ms, add128us, add32us only check tsft[10], tsft[7], tsft[5], ignore LSB
0: add1ms, add128us, add32us check tsft[9:0], tsft[6:0], tsft[4:0] when active</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ELY_32US_P0</name>
              <description>the BCN EARLY interrupt find tune with unit 32us. The Total Early time of BCN early interrupt is the ERLYINTTIM x 1ms - EARLY_32us x 32us.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERLYINTTIM_P0</name>
              <description>Time to send interrupt to notify driver to change beacon content. Time unit is TU.
It is used to wake up early at DriverEarlyTime</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P1_BCN_ERLY_CTRL</name>
          <addressOffset>0x00000530</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELY_32US_P1</name>
              <description>the BCN EARLY interrupt find tune with unit 32us. The Total Early time of BCN early interrupt is the ERLYINTTIM x 1ms - EARLY_32us x 32us.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERLYINTTIM_P1</name>
              <description>Time to send interrupt to notify driver to change beacon content. Time unit is TU.
It is used to wake up early at DriverEarlyTime</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBCN_DELAY_TXPAUSE</name>
          <addressOffset>0x00000534</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00F00F00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFDM_RXTSF_OFFSET</name>
              <description>The Datapath of  OFDM RX_tsf, unit: us</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCK_RXTSF_OFFSET</name>
              <description>The Datapath of  CCK RX_tsf, unit: us</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTRIG_DELAY</name>
              <description>add compensation of RX trigger's TSFT. Unit: us</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BCNDROP_TIME</name>
          <addressOffset>0x00000538</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00FF1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMD_TIMER</name>
              <description>When 40M/80M TX CMD ready and secondary_CCA_20/secondary_CCA_40 set for this period, then the TX CMD will be cleared.  TU: 1us</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HGQ_EMPTY_TIMEOUT_PERIOD</name>
              <description>When hgq empty for this period, close atim window. And this will block hgq dma for pcie, unless 0x524[12] set enable. TU: 32us</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCN_DROP_EN</name>
              <description>enable beacon drop function</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCN_DROP_IVL</name>
              <description>indicate the timeout of beacon drop</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DTIM_ATIM</name>
          <addressOffset>0x0000053C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x02016200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_HGQ_NOLIMIT</name>
              <description>enable no limit mode of hgq</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_EVTQ_NOLIMIT</name>
              <description>enable no limit mode of evtq</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMWND</name>
              <description>ATIM window width of P1 TX hgq in units of TU.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIM_URGENT</name>
              <description>Indicates the time before ATIM Window end. (unit : TU)</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_ATIM</name>
              <description>1: disable assert ATIM</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_AC_IN_ATIM</name>
              <description>1: Disable AC Queue Packet Tx in ATIM (only valid at Nettype: Adhoc/AP)
0: Enable AC Queue packet Tx in ATIM</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PTCL_CLR_ATIM</name>
              <description>1: enable fw_clr_sch_atim signal to clear atimon (means this is the last hgq packet)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_EVTQ_INRTSMF</name>
              <description>When this bit is set, Event Q will be TX, not wait until RTS or MF transaction finished.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTIM_BYPASS</name>
              <description>1: dtim counter will keep 0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTIM_COUNT</name>
              <description>init dtim value, act on the port of apmode</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CMD_SEL_EDCA_RANDOM_GEN</name>
          <addressOffset>0x00000540</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x01E21051</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXCMD_SEL</name>
              <description>[HW Debug Info]To select which one TXCMD Segment.
For example,
可以在0x5CF[3:0]填 0 or 6  讀取
0x5F8[7:0] : Tx Agg
0x5F9[7:0] : Tx Rate</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RAND_SET</name>
              <description>Random number generator polynomial</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PTA_TRXBCN_CTRL</name>
          <addressOffset>0x00000544</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xC0606200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTA_RXBCN_PRI_MASK</name>
              <description></description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_RXBCN_EN</name>
              <description></description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_RXBCN_DUR</name>
              <description>unit: 32us. Period of wl_rxbcn</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_RXBCN_TIME</name>
              <description>unit: 32us. Assert wl_rxbcn before TBTT</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_CNT_EN</name>
              <description>When change mode, need to count down before exit BT_MODE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPAUSE1</name>
              <description>same as 0x514[23:15], allow FW/DR to control pause jointly</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PS_TIMER_A</name>
          <addressOffset>0x00000548</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS_TIMER_A</name>
              <description>When the TSF matches the content of this register, the PS_TIMER_A_INT interrupt is issued. Unit:16us</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PS_TIMER_B</name>
          <addressOffset>0x0000054C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS_TIMER_B</name>
              <description>When the TSF matches the content of this register, the PS_TIMER_B_INT interrupt is issued. Unit:16us</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PS_TIMER_C</name>
          <addressOffset>0x00000550</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS_TIMER_C</name>
              <description>When the TSF matches the content of this register, the PS_TIMER_C_INT interrupt is issued. Unit:16us</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
