Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_PS_TIMER_TWT_CRTL0</name>
          <addressOffset>0x00000554</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS_TIMER_A_EN</name>
              <description>Enable PS_TIMER_A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TIMER_A_TSF_SEL</name>
              <description>0 for port 0, 1 for freerun, 2 for p2 backup</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TIMER_B_EN</name>
              <description>Enable PS_TIMER_B</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TIMER_B_TSF_SEL</name>
              <description>0 for port 0, 1 for freerun, 2 for p2 backup</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TIMER_C_EN</name>
              <description>Enable PS_TIMER_C</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TIMER_C_TSF_SEL</name>
              <description>0 for port 0, 1 for freerun, 2 for p2 backup</description>
              <bitRange>[24:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TIMER_D_EN</name>
              <description>Enable PS_TIMER_D</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TIMER_D_TSF_SEL</name>
              <description>0 for port 0, 1 for freerun, 2 for p2 backup</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TIMER_E_EN</name>
              <description>Enable PS_TIMER_E</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TIMER_E_TSF_SEL</name>
              <description>0 for port 0, 1 for freerun, 2 for p2 backup</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_TIMER_A</name>
              <description>It is used to wake up early at PS_Timer_A_Early Time. 
Time unit is 32us.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXBCN_TSFT_STATISTIC</name>
          <addressOffset>0x00000558</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GET_TSFT_OFFSET_EN</name>
              <description>1: Enable Enable get TSFT offset function</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPD_TSFT_EARLY</name>
              <description>0: don't update TSFT when the following scenarios occur: tim_no_hit, |TSFT - rxbcn.timestamp| &lt;= BIT_RXBCN_TSFT_THRES, and r_wait_rxbcn_finish = 1
1: update TSFT</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBCN_TSFT_THRES</name>
              <description>used for LPS MAC, if |TSFT - rxbcn.timestamp| &gt; BIT_RXBCN_TSFT_THRES, need to wait fcsok. Else, update TSFT at wmac_rxtsf_rdy (before fcsok)
unit is 1us,max is 8ms</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_RXBCN_GT_THRES_CNT</name>
              <description>enable the counter of BIT_RXBCN_GT_THRES_CNT</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR_RXBCN_GT_THRES_CNT</name>
              <description>clear the BIT_RXBCN_GT_THRES_CNT to 0</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXBCN_GT_THRES_CNT</name>
              <description>valid when BIT_EN_RXBCN_GT_THRES_CNT = 1. 
counter the number of beacon with the |TSFT - rxbcn.timestamp| exceed the threshold</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TM_CFG</name>
          <addressOffset>0x0000055C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000060</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TM_TX_PATH_TIME_OFFSET</name>
              <description>Compensate the time, from PHYTXON rising edge to transmit antenna connector. unit: 1us</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TM_RX_PATH_TIME_OFFSET</name>
              <description>Compensate the time, from receive antenna connector to DATAON rising edge. unit: 1us</description>
              <bitRange>[23:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_AIR_TIME</name>
              <description>This register sets the time from cca fall to 6us.  unit: 1us. (default:6us)</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TM_TSFT_PORT_SEL</name>
              <description>selected TM timer port
0: port0; 1: freerun</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTM_EN</name>
              <description>1: HW will parsing rx packet, to find TM frame</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTMREQ_EN</name>
              <description>1: HW will parsing rx packet, to find TM request frame</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TM_FUNC_EN</name>
              <description>1: Enable Timing Measurement function</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AX_MUEDCA_VO_PARAM</name>
          <addressOffset>0x00000560</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000431C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUEDCA_VO_PARAM_TIMER</name>
              <description>MU EDCA TIMER, in units of 1ms
Note: SPEC: The MU EDCA Timer field (8b) indicates the duration of time, in units of 8 TUs</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUEDCA_VO_PARAM_CW</name>
              <description>ECWmin and ECWmax encode the values of Cwmin and Cwmax respectively in an exponent form. Ex: Cwmax = 2^(ECWmax)-1
Default: BK = Ah/5h; BE = Ah/5h; VI = 5h/4h; VO = 4h/3h.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUEDCA_VO_PARAM_AIFS</name>
              <description>Arbitrary Inter frame space
In unit of microsecond. AIFS indicates the time a non-AP QSTA should defer before either invoking a backoff or starting a transmission
Default: BK = 49h; BE = 25h; VI = 1Ch; VO = 1Ch.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AX_MUEDCA_VI_PARAM</name>
          <addressOffset>0x00000564</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000541C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUEDCA_VI_PARAM_TIMER</name>
              <description>MU EDCA TIMER, in units of 1ms
Note: SPEC: The MU EDCA Timer field (8b) indicates the duration of time, in units of 8 TUs</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUEDCA_VI_PARAM_CW</name>
              <description>ECWmin and ECWmax encode the values of Cwmin and Cwmax respectively in an exponent form. Ex: Cwmax = 2^(ECWmax)-1
Default: BK = Ah/5h; BE = Ah/5h; VI = 5h/4h; VO = 4h/3h.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUEDCA_VI_PARAM_AIFS</name>
              <description>Arbitrary Inter frame space
In unit of microsecond. AIFS indicates the time a non-AP QSTA should defer before either invoking a backoff or starting a transmission
Default: BK = 49h; BE = 25h; VI = 1Ch; VO = 1Ch.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AX_MUEDCA_BE_PARAM</name>
          <addressOffset>0x00000568</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000A525</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUEDCA_BE_PARAM_TIMER</name>
              <description>MU EDCA TIMER, in units of 1ms
Note: SPEC: The MU EDCA Timer field (8b) indicates the duration of time, in units of 8 TUs</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUEDCA_BE_PARAM_CW</name>
              <description>ECWmin and ECWmax encode the values of Cwmin and Cwmax respectively in an exponent form. Ex: Cwmax = 2^(ECWmax)-1
Default: BK = Ah/5h; BE = Ah/5h; VI = 5h/4h; VO = 4h/3h.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUEDCA_BE_PARAM_AIFS</name>
              <description>Arbitrary Inter frame space
In unit of microsecond. AIFS indicates the time a non-AP QSTA should defer before either invoking a backoff or starting a transmission
Default: BK = 49h; BE = 25h; VI = 1Ch; VO = 1Ch.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AX_MUEDCA_BK_PARAM</name>
          <addressOffset>0x0000056C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000A549</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUEDCA_BK_PARAM_TIMER</name>
              <description>MU EDCA TIMER, in units of 1ms
Note: SPEC: The MU EDCA Timer field (8b) indicates the duration of time, in units of 8 TUs</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUEDCA_BK_PARAM_CW</name>
              <description>ECWmin and ECWmax encode the values of Cwmin and Cwmax respectively in an exponent form. Ex: Cwmax = 2^(ECWmax)-1
Default: BK = Ah/5h; BE = Ah/5h; VI = 5h/4h; VO = 4h/3h.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUEDCA_BK_PARAM_AIFS</name>
              <description>Arbitrary Inter frame space
In unit of microsecond. AIFS indicates the time a non-AP QSTA should defer before either invoking a backoff or starting a transmission
Default: BK = 49h; BE = 25h; VI = 1Ch; VO = 1Ch.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AX_TB_MUEDCA_CTRL</name>
          <addressOffset>0x00000570</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xA2000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TB_TIMER_CNT_INI</name>
              <description>the initial value of th_timer, unit: us</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HE_TB_PPDU_ONLY_EN</name>
              <description>asserted if the TWT is trigger-enabled TWT</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TB_TXPAUSE</name>
              <description>valid if BIT_HE_TB_PPSU_ONLY_EN = 1; select pause edca or not during TWT-SP; default is 1, pause.
A TWT requesting STA should not transmit frames to the TWT responding STA outside of negotiated TWT SPs and should not transmit frames that are not contained within HE TB PPDUs to the TWT responding STA within trigger-enabled TWT SPs</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_UPD_BEAM_CHG</name>
              <description>1: txcmd_beam_change TIE 0
0: first PPDU in TXOP will assert txcmd_beam_change</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_MUEDCATIMER_TF</name>
              <description>1: enable HW updating MUEDCATimer after Tx HE TB PPDU
0: disable HW updating MUEDCATimer after Tx HE TB PPDU</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUEDCA_EN</name>
              <description>1: enable HW updating MUEDCATimer
0: disable HW updating MUEDCATimer</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CCA_NAV_CHK</name>
          <addressOffset>0x00000574</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000F3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR_CTN_CHK_NAV</name>
              <description>When BASIC or INTRA NAV &gt; 0  in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Cannot backoff, cannot TX</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_CTN_CHK_ZGBTCCA</name>
              <description>When  ~GNT_WL(BT/ZigBee)  assert in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Cannot backoff, cannot TX</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_CTN_CHK_EDCCA</name>
              <description>When EDCCA assert in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Cannot backoff, cannot TX</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_CTN_CHK_CCA_S20</name>
              <description>When EDCCA assert in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Cannot backoff, cannot TX</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTN_CHK_INTRA_NAV</name>
              <description>When INTRA NAV &gt; 0  in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Cannot backoff, cannot TX</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTN_CHK_BASIC_NAV</name>
              <description>When BASIC NAV &gt; 0  in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Cannot backoff, cannot TX</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTN_CHK_ZGBTCCA</name>
              <description>When ~GNT_WL(BT/ZigBee) assert in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Cannot backoff, cannot TX</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTN_CHK_EDCCA</name>
              <description>When EDCCA assert in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Cannot backoff, cannot TX</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTN_CHK_CCA_S20</name>
              <description>When SECONDARY_CCA_20 assert in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Can backoff, cannot TX</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTN_CHK_CCA_P20</name>
              <description>When CCA assert in the AIFS/Backoff before active TX
0: Can backoff, can TX
1: Cannot backoff, cannot TX</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_POF_BCNELY_AGG_TBTT</name>
          <addressOffset>0x00000578</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description></description>
              <bitRange>[31:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_P0_TBTT_CNT</name>
              <description>enable the tbtt counter function.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P0_TBTT_CNT_THRS</name>
              <description>P0's TBTT counter threshold . Valid when  BIT_EN_P0_TBTT_CNT = 1. when tbtt_cnt &gt;= BIT_P0_TBTT_CNT_THRS, assert p0_tbtt_agg_int. UNIT: 16</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_POF_ELY_AGG</name>
              <description>update bcn_ely_agg initial value of P0 to BIT_INI_POF_ELY_AGG_CNT
1: enable
0: disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_POF_ELY_AGG_CNT</name>
              <description>bcn_ely_agg initial value of P0. Valid when BIT_EN_POF_ELY_AGG = 1</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LPSOFFLOAD_RXBCN_DIFF_CFG0</name>
          <addressOffset>0x0000057C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x07010040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_TSFT_AVG_CAL</name>
              <description>1: calculate the average value of deltaTSFT(latch hioe_int_chn_on and  cca_up) in specified period</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BCNELY_LATCH_TSFT</name>
              <description>1: latch TSFT to BIT_TSFT_AT_HIOE_RFON (0x153C) when P0's bcn_early int asserted</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSFT_AVG_CAL_PRD</name>
              <description>2^(BIT_TSFT_AVG_CAL_PERIOD), default is 128 times</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSFT_AVG_GT_THRES_CNT_MAX</name>
              <description>The max times of the BIT_TSFT_AVG_VALUE greater than BIT_TSFT_AVG_THRES, if the BIT_TSFT_AVG_VALUE exceeds the BIT_TSFT_AVG_THRES several times in a row, and the number exceeds the BIT_TSFT_AVG_GT_THRES_CNT_MAX, generate an interrupt</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSFT_AVG_THRES</name>
              <description>The threshold of deltaTSFT(latch hioe_int_chn_on and  cca_up), unit 32us</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TSFT_AVG_VALUE</name>
          <addressOffset>0x00000580</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x06400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GNT_BT_CNT</name>
              <description>WIFI TX shall wait settle time when antenna is switched from BT to WIFI/RADAR, if the BT use the same RFAFE as WIFI.
Unit: 1us</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSFT_AVG_GT_THRES_CNT</name>
              <description>statistic the times of the BIT_TSFT_AVG_VALUE than BIT_TSFT_AVG_THRES</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSFT_AVG_VALUE</name>
              <description>the average value of deltaTSFT(latch hioe_int_chn_on and  cca_up) in specified period</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
