Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_NAN_P2_CFG0</name>
          <addressOffset>0x00000584</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x12000064</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description></description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCSOK_CHK_BSSID</name>
              <description>1:HW will check bssid when fcsok</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNSPACE_P2_1</name>
              <description>Unit is ms. the beacon space of port2 sync beacon. default is 512ms</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNSPACE_P2_0</name>
              <description>Unit is ms. the beacon space of port2 disc beacon. default is 100ms</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NAN_P2_CFG1</name>
          <addressOffset>0x00000588</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00058082</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P2_TSFT_BACKUP_EN</name>
              <description>1:en tsft backup</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPD_TSFT_DIS_CHK_TA</name>
              <description>1: don't check TA_FIT when update NAN tsft</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ELY_32US_P2</name>
              <description>the BCN EARLY interrupt find tune with unit 32us. The Total Early time of BCN early interrupt is the ERLYINTTIM x 1ms - EARLY_32us x 32us.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERLYINTTIM_P2</name>
              <description>Time to send interrupt to notify driver to change beacon content. Time unit is TU.
It is used to wake up early at DriverEarlyTime</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCN_OFFSET_5G_NAN</name>
              <description>Unit is ms. the tbtt offset between 2.4G sync beacon and 5G sync bcn. Default is 128ms</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P2_TSFT_AUTO_SYNC_EN</name>
              <description>1: enable HW auto tsft sync, when sync beacon frames are received, auto update RX.timestamp + RX path delay to TSFT_P2_0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_SYNC_P2_TSFT</name>
              <description>When write this bit, TSFT P2_0 will sync to TSFT P2_1 without TSFTF_SYN_OFFSET, need co-work with BIT_P2_DIS_TSF_UPT = 1</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>P2_TSFT_RST</name>
              <description>write this bit, bcn2 tsft will reset to 1</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>P2_DIS_BCN</name>
              <description>set 1 to mask the beacon early interrupt of port2
[0]: for NAN disc beacon
[1]: for NAN sync beacon</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P2_DIS_RX_BSSID_FIT</name>
              <description>0:HW will handle rx_beacon 1:HW will ignore rx_beacon_pk</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P2_DIS_TSF_UPT</name>
              <description>When set, disable clint 2 TSF update when beacon frames or probe response frames are received.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P2_EN_BCNQ</name>
              <description>When this bit is set, TSF and other beacon related functions are then enabled.
BIT_P2_EN_BCNQ = 1 also means turning on the NAN feature</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NAN_CFG</name>
          <addressOffset>0x0000058C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x102D0161</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TBTT_HOLD_PREDICT</name>
              <description>the predicted hold time after tbtt for P0 RX beacon, unit is 1ms</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCBCN_DELAY</name>
              <description>r_HC * r_SLOTTIME * 8'd40 (unit:us)
default: r_HC = 1, r_SLOTTIME = 9, =&gt; 360us
max is 16ms (DW)</description>
              <bitRange>[26:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAN_ROLE</name>
              <description>the role of NAN device: 
2'b00: master
2'b01: no-master sync
2'b10: no-master no-sync.</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCN_PORT_PRI</name>
              <description>the priority of ports 
000: no priority
001: port2 sync bcn has higher priority than P0/P1, P2 sync &gt; P0/P1
010: port0 has higher priority than P2 sync bcn, P0 &gt; P2 sync &gt; P1
011: port1 has higher priority than P2 sync bcn, P1 &gt; P2 sync &gt; P0
100: port0 and port1 has higher priority than P2 sync bcn, P0/P1 &gt; P2 sync</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PORT_ROND</name>
              <description>1: enable round-robin of P2 disc beacon and P0/1 beacon</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TBTT_INT_CLR_P2_BCNREQ</name>
              <description>1: tbtt int can clear bcnely_req when arbitration fail</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVTQ_VLD</name>
              <description>1: enable EVTQ TX</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_5G_NAN</name>
              <description>1: enable 5G NAN mode
0: only 2.4G NAN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVTQ_EARLY</name>
              <description>the early time of evtq tx window. unit is TU</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_EDCA_REF_CFG</name>
          <addressOffset>0x00000590</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_EDCA_REF</name>
              <description>When this bit set 1, enable EDCA REF function</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_RANDOM_SHIFT_TX</name>
              <description>When this bit set 1, enable random shift TX function</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_INTERCOL_EDCA_REF</name>
              <description>When this bit set 1, enable inter-collision edca_ref</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCH_CNT_RST</name>
              <description>write "1" to set the BIT_EDCA_REF_STS_CNT to zero</description>
              <bitRange>[28:28]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>EDCA_REF_STS_CNT</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PS_TIMER_TWT_CRTL1</name>
          <addressOffset>0x00000594</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS_ELY_TIMER_E</name>
              <description>It is used to wake up early at PS_Timer_E_Early Time. 
Time unit is 32us.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_TIMER_D</name>
              <description>It is used to wake up early at PS_Timer_D_Early Time. 
Time unit is 32us.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_TIMER_C</name>
              <description>It is used to wake up early at PS_Timer_C_Early Time. 
Time unit is 32us.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_ELY_TIMER_B</name>
              <description>It is used to wake up early at PS_Timer_B_Early Time. 
Time unit is 32us.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PS_TIMER_D</name>
          <addressOffset>0x00000598</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS_TIMER_D</name>
              <description>When the TSF matches the content of this register, the PS_TIMER_B_INT interrupt is issued. Unit:16us</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PS_TIMER_E</name>
          <addressOffset>0x0000059C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS_TIMER_E</name>
              <description>When the TSF matches the content of this register, the PS_TIMER_C_INT interrupt is issued. Unit:16us</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AUDIO_CFG</name>
          <addressOffset>0x00001500</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000219</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATH_DELAY_NS_CCK</name>
              <description>the NS part of RX CCK1M PATH DELAY</description>
              <bitRange>[31:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PATH_DELAY_NS_OFDM</name>
              <description>the NS part of RX OFDM6M PATH DELAY</description>
              <bitRange>[21:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSFT_DIFF_P0_EN</name>
              <description>1:get tsft difference between local tsft and update value when update tsft</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NEW_RX_NSCNT_EN</name>
              <description>1: enable the new ns counter of rx
0: follow old ns counter as tx</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_CLK_PRD</name>
              <description>set the period of MAC CLK, default 40M - 25ns</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_IGNORE_EDCCA_NAV_CFG</name>
          <addressOffset>0x00001504</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0F150F15</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IGN_RXNAV_TH</name>
              <description>indicate the threshold of rxnav ignored, unit: 1ms</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGN_RXNAV_TXTIME</name>
              <description>indicate the tx times of ignore rxnav tx</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGN_RXNAV_TXOK</name>
              <description>1: only de-ignore rxnav when tx ok/drop</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNORE_RXNAV</name>
              <description>1: backoff ignore rxnav when reach threshold</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGN_EDCCA_TH</name>
              <description>indicate the threshold of edcca ignored, unit: 1ms</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGN_EDCCA_TXTIME</name>
              <description>indicate the tx times of ignore edcca tx</description>
              <bitRange>[6:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGN_EDCCA_TXOK</name>
              <description>1: only de-ignore edcca when tx ok/drop</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNORE_EDCCA</name>
              <description>1: backoff ignore edcca when reach threshold</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
