Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PAGE5_OFF</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x000015AC</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000015AC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_SIFS</name>
          <addressOffset>0x000005A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0E0A0E0A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIFS_TRX_OFDM</name>
              <description>This register sets the SIFS time required in NAV protection period after receiving any immediate response.
for example Ack-Data or RTS/CTS-Data. It is in unit of us.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIFS_TRX_CCK</name>
              <description>This register sets the SIFS time required in NAV protection period after receiving any immediate response.
for example Ack-Data or RTS/CTS-Data. It is in unit of us.</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIFS_CONTX_OFDM</name>
              <description>This register sets the SIFS time required for consecutive TX events for example CTS2S-Data, or broadcast bursting. It is in unit of us.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIFS_CONTX_CCK</name>
              <description>This register sets the SIFS time required for consecutive TX events for example CTS2S-Data, or broadcast bursting. It is in unit of us.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TSFT_SYN_OFFSET_SLOT</name>
          <addressOffset>0x000005A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x10243190</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAX_BCNERR</name>
              <description>When beacon TX error counter goes over this threshold, Beacon will transmit within PIFS. Unit is 4</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOTTIME</name>
              <description>This register sets the slot time value mentioned in 802.11 specification. It is in units of us.
Default: 0x9</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIFS_TIME_BK</name>
              <description>Hw will break aggr. In sifs condition</description>
              <bitRange>[16:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>2TSFT_OFFSET</name>
              <description>tsft sync. Offset (bcn0 sync to bcn1 offset or bcn1 sync to bcn0 offset). 
Unit : 128us, default is 50ms</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FTM_CTRL</name>
          <addressOffset>0x000005A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FTM_PTT_TSF_R2T_SEL</name>
              <description>0:R2T latch count sync tsf of port 0
1: R2T latch count sync tsf of port 1</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FTM_PTT_TSF_T2R_SEL</name>
              <description>0:T2R latch count sync tsf of port 0
1: T2R latch count sync tsf of port 1</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FTM_PTT_TSF_SEL</name>
              <description>0: sync tsf of port 0
1: sync tsf of port 1</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FTM_PTT</name>
              <description>partial tsf timer setting</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FTM_TSF_CNT</name>
          <addressOffset>0x000005AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCH_FTM_T2_TSFT</name>
              <description>R2T latch count sync tsf timer</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SCH_FTM_T1_TSFT</name>
              <description>T2R latch count sync tsf timer</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P0_TSFTR_L</name>
          <addressOffset>0x000005B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P0_TSF_TIMER_L</name>
              <description>low 32bits of port0's tsft</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P0_TSFTR_H</name>
          <addressOffset>0x000005B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P0_TSF_TIMER_H</name>
              <description>high 32bits of port0's tsft</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FREERUN_CNT_L</name>
          <addressOffset>0x000005B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREERUN_CNT_TIMER_L</name>
              <description>LOW 32bits of freerun cnt</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_FREERUN_CNT_H</name>
          <addressOffset>0x000005BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREERUN_CNT_TIMER_H</name>
              <description>high 32bits of freerun cnt</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P2_TSFTR_L</name>
          <addressOffset>0x000005C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P2_TSF_TIMER_L</name>
              <description>low 32bits of port2's tsft (NAN)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P2_TSFTR_H</name>
          <addressOffset>0x000005C4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P2_TSF_TIMER_H</name>
              <description>high 32bits of port2's tsft (NAN)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NDPA_NAV</name>
          <addressOffset>0x000005C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIS_NDPA_NAV_CHK</name>
              <description>1--&gt;tx NDPA/NDP can cross TBTT,0--&gt;tx NDPA/NDP can't cross TBTT</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MHDR_NAV_OFFSET</name>
              <description>NDPA NAV compensation value</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RX_TSFT_DIFF</name>
          <addressOffset>0x000005CC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBCN_TIME_VLD</name>
              <description>1: indicate [12:0] is valid. Write 1 to clear this bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBCN_TIME_DIFF_DIR</name>
              <description>1: wmac_rx_tsf &gt; TSFT
0: wmac_rx_tsf &lt;= TSFT</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBCN_TIME_DIFF</name>
              <description>unit:32us
wmac_rx_tsf - TSFT. [12] is the sign bit</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TM_TSFT_T1_T3</name>
          <addressOffset>0x000005D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCH_TM_TSFT_T1_T3</name>
              <description>T1: Latch tsft timer of Tx TM frame, unit: 1us
T3: Latch tsft timer of Tx ACK frame, unit: 1us</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TM_TSFT_T2_T4</name>
          <addressOffset>0x000005D4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCH_TM_TSFT_T2_T4</name>
              <description>T2: Latch tsft timer of Rx TM frame, unit: 1us
T4: Latch tsft timer of Rx ACK frame, unit: 1us</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TSFT_HIOE_RFON_L</name>
          <addressOffset>0x000005D8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSFT_AT_HIOE_RFON_L</name>
              <description>when hioe_int_chn_on asserted, latch the tsft[31:0] (select port by 0x1520[0])</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TSFT_HIOE_RFON_H</name>
          <addressOffset>0x000005DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSFT_AT_HIOE_RFON_H</name>
              <description>when hioe_int_chn_on asserted, latch the tsft[63:32] (select port by 0x1520[0])</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TSFT_BCN_CCAUP_L</name>
          <addressOffset>0x000005E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSFT_AT_BCN_CCA_UP_L</name>
              <description>when CCA asserted, latch the tsft[31:0] (select port by 0x1520[0]).
 updated to this register after judging that it is a beacon frame</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TSFT_BCN_CCAUP_H</name>
          <addressOffset>0x000005E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSFT_AT_BCN_CCA_UP_H</name>
              <description>when CCA asserted, latch the tsft[63:32] (select port by 0x1520[0]).
 updated to this register after judging that it is a beacon frame</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXOP_BREAK_CFG</name>
          <addressOffset>0x000005E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description></description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TXOP_BREAK</name>
              <description>1: enable TXOP break gen_cmd and TXOP abort TX</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXOP_BRK_MARGIN</name>
              <description>extra transtime during TXOP, unit: 2us
if data_transtime + BIT_TXOP_BRK_MARGIN*2 exceed the remaining TXOP count, will abort this TX</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P2_TSFT_BACKUP_L</name>
          <addressOffset>0x000005EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P2_TSF_BACKUP_L</name>
              <description>low 32bits of port2's tsft_backup (NAN)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P2_TSFT_BACKUP_H</name>
          <addressOffset>0x000005F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P2_TSF_BACKUP_H</name>
              <description>high 32bits of port2's tsft_backup (NAN)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SCHEDULER_DBG</name>
          <addressOffset>0x000005F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_SCHEDULER</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SCH_TXCMD</name>
          <addressOffset>0x000005F8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCH_TXCMD</name>
              <description>Scheduler TXCMD Content</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RADAR_CFG</name>
          <addressOffset>0x000005FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00648000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADAR_REQ</name>
              <description>asserted when need to tx radar pkt,FW set, SW clear</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_RADAR_CNT</name>
              <description>Need to wait some time when detect the posedge or negedge of gnt_radar, unit:us</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADAR_LIFETIME</name>
              <description>Radar packet lifetime, unit:32us</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AUDIO_INT_CFG</name>
          <addressOffset>0x000015A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xA0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUDIO_SEL_P0</name>
              <description>1: select P0's TSFT to trigger audio latch count</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUDIO_TRIG_UNIT</name>
              <description>0: trigger audio latch period is 1ms
1: period is 2ms
2: period is 4ms
3: period is 8ms
......
6: period is 64ms
7: period is 128ms</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUDIO_STR_PLAY_SEL</name>
              <description>select ps_timer interrput for audio start play function
1: select ps_timer_a int
2: select ps_timer_b int
3: select ps_timer_c int
4: select ps_timer_d int
5: select ps_timer_e int
else: TIE0</description>
              <bitRange>[27:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_P0_UPDATETSFT_DIFF</name>
          <addressOffset>0x000015A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSFT_DIFF_VLD</name>
              <description>1: indicate [20:0] is valid.
0: wmac_rx_tsf &lt;= TSFT</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSFT_DIFF_US_DIR</name>
              <description>1: update_tsft_us &gt; TSFT_us
0: update_tsft_us &lt;= TSFT_us</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSFT_DIFF_US</name>
              <description>unit:1us
update_tsft_us - TSFT. [20] is the sign bit
if diff &gt;=255, this value would be 8'hff</description>
              <bitRange>[19:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSFT_DIFF_NS_DIR</name>
              <description>1: update_tsft_ns &gt; TSFT_ns
0: update_tsft_ns &lt;= TSFT_ns</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSFT_DIFF_NS</name>
              <description>unit:1ns
update_tsft_ns - TSFT. [10] is the sign bit</description>
              <bitRange>[9:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AUDIO_LAT_TSFT</name>
          <addressOffset>0x000015A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUDIO_LAT_TSFT_US</name>
              <description>low 22bits of audio latch tsft_us</description>
              <bitRange>[31:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AUDIO_LAT_TSFT_NS</name>
              <description>audio latch tsft_ns</description>
              <bitRange>[9:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
