Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WMAC_PAGE6</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x00000700</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000700</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_WMAC_CR</name>
          <addressOffset>0x00000600</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_RXUC_BBYE_MACID</name>
              <description>when rx handshake relay byebye frame,update macid of the transmitter to this reg</description>
              <bitRange>[13:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIGGER_TSFT_EN</name>
              <description>When set, enable sync tsft from trigger</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_ADDRCAM</name>
              <description>When set,disable filtercam funciton,and use old filter</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP_A3_MODE</name>
              <description>When set,enable search macid cam using rxa3. The packet will send to driver when rxa3 match and fcs ok</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SP_A1_MODE</name>
              <description>When set,enable search macid cam using rxa1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOSTER_MODE</name>
              <description>When set,enable booster mode. Realy and booster are not used samtime</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RELAY_MODE</name>
              <description>When set,enable relay mode. Realy and booster are not used samtime</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REPEAT_MODE</name>
              <description>When set,enable repeat mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TCR</name>
          <addressOffset>0x00000604</addressOffset>
          <size>32</size>
          <description>Transmission Configuration Register</description>
          <resetValue>0x00100000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXPWR_CTL_DISGCLK</name>
              <description>1:txpwr_ctl clock gating disable
0:txpwr_ctl clock gating enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MORE_DATA</name>
              <description>when set top 1, set more data bit to 1 in ACK/BA/MBA</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_NOTX_IN_RXNDP</name>
              <description>1: block original tx when receiving NDP packet</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_EN_EOF</name>
              <description>when set to 1, enable single ampdu for qos data packet. In early mode,not set to 1.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BF_SEL</name>
              <description>1: set ndp_rx_standby when rx ppdu of ndpa end;
0: set ndp_rx_standby when rx ndpa packet fcs end;</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_PWRMGT_HWCTL</name>
              <description>If this bit is set to 1, MAC will overwrite power bit of frame control according to 
PWR_ST.  (only for RTS/CTS/ACK/CFEND/BA/BAR frames)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SMOOTH_VAL</name>
              <description>smooth value of plcp header HTSIG2</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_EN_SCRAM_INC</name>
              <description>Increase 1 in service field scrambler seed per tx end</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FETCH_MPDU_AFTER_WSECRDY</name>
              <description>If set to 1,mactx_mpdu_gen will fetch mpdu after wsec is ready when sectype is not tkip/wep40/wep104</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_SIGTA</name>
              <description>when set to 1, disable signaling TA information for response packet</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_A2B0</name>
              <description>when set to 1, not check bit 0 of rx a2</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MSK_SIGBCRC</name>
              <description>when set to 1, mask sigb crc in service field  for vht packet</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_TXSK_PERPKT</name>
              <description>Search key for each mpdu</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_ICV</name>
              <description>Integrity Check Value. This bit indicates the existence of an ICV appended to an encipherment packet.
1: No ICV appended
0: ICV appended</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_CFENDFORM</name>
              <description>CF-End Frame Format.The Address 2 field of CF-End is defined to be the address of the STA contained in the AP, but in 802.11n a STA can also send CF-End.The Address 2 field is not specified clearly in this case. This register chooses between MAC ID of the STA or BSSID of the network.
0: BSSID
1: MAC ID</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_CRC</name>
              <description>Append 32-bit Cyclic Redundancy Check. This bit indicates the existence of a CRC32 appended to a packet.
1: No CRC32 appended
0: A CRC32 is appended</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_PWRMGT_CTL</name>
              <description>If this bit is set to 1, MAC will overwrite power bit of frame control according to PWR_ST. (only for data frame)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_PWRMGT_VAL</name>
              <description>MAC will overwrite power bit of frame control according to PWR_ST.(only for data frame)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_UPD_TIMIE</name>
              <description>when set to 1, enable hw to update beacon's time field</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_VHTSIGA1_TXPS</name>
              <description>This bit controls TXOP_PS_NOT_ALLOWED bit value of VHT-SIG-A1 field in TX VHT packets
1: TXOP_PS_NOT_ALLOWED is set to 1
0: TXOP_PS_NOT_ALLOWED is set to 0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_PADSEL</name>
              <description>AMPDU Padding pattern selection
0: 32-bit Zero padding, 
1: Zero length delimiter.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_DISGCLK</name>
              <description>when set to 1,disable MACTX clock gating control.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RCR</name>
          <addressOffset>0x00000608</addressOffset>
          <size>32</size>
          <description>Receive Configuration Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_RCR_APP_FCS</name>
              <description>When set, wmac RX will append FCS after payload.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_APP_MIC</name>
              <description>When this bit is set to 1, MACRX will retain the MIC at the bottom of the packet. Otherwise, MIC will be removed and reported the status in RXDESC. When a MPDU is encrypted with TKIP without MIC, MACRX will ignore this option, that is, MIC must be remained in back of the plain text.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_APP_ICV</name>
              <description>When this bit is set to 1, MACRX will retain the ICV at the bottom of the packet. Otherwise, MIC will be removed and reported the status in RXDESC.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_APP_PHYSTS</name>
              <description>Append RXFF0 PHY Status Enable
When this bit is set, then PHY Status is appended before RX packet in RXFF. When this bit is set, the RX_DRV_INFO_SZ shall be set to include PHY Status report.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_VHT_DACK</name>
              <description>This bit to control response type for vht single mpdu data packet.
1: ACK as response
0: BA as response</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLAN_RX_REQ_SIFS_CLR</name>
              <description></description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_MFBEN</name>
              <description>Enable immediate MCS Feedback function
1: Enable. When Rx packet with MRQ = 1"b1, then search KEYCAM to find sender"s MCS Feedback function and send response
0: Disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_DISCHKPPDULEN</name>
              <description>When set,do not check PPDU while the PPDU length is smaller than 14 byte.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_PKTCTL_DLKEN</name>
              <description>When set,while rx path dead lock occurs, reset rx path</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_DISGCLK</name>
              <description>When set,disable macrx clock gating control</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_TIMPSR_EN</name>
              <description>When set, enable RX Beacon TIM Parser</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_BCMDINT_EN</name>
              <description>Broadcast data packet interrupt enable. When this bit is set, this bit is auto
clear by MAC. As long as a data type broadcast packet is received, this bit
will be set.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_UCMDINT_EN</name>
              <description>Unicast data packet with FC.MD = 1 interrupt enable. When this bit is set, this bit is auto clear by MAC. As long as a data type unicast packet is received, this bit will be set.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_RXSK_PERPKT</name>
              <description>Executing key search per MPDU</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_HTCBFMC</name>
              <description>1: HTC -&gt; MFC
0: MFC-&gt; HTC</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_CHK_PREVTXA2</name>
              <description>When set,enable check rxa1 with txa2.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_ACK_CBSSID</name>
              <description>The field effects behavior of BA/ACK frame.                                                                                       0:Only A1 match to send BA/ACK frame.                                                                                                1:A1 match and satisfy BSSID condition(if BIT_CBSSID_DATA = 1) will send BA/ACK frame. If BIT_CBSSID_DATA = 0, hardware send BA/ACK frame decided by A1 match condition.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_CHKTA_MGNT</name>
              <description>Check TransmitteBCN
When set to 1, MAC will check the Transmitter Address (A2) of RX beacon or Probe response to determine if this packet belongs to this Transmitter Address (Address 2) . Both in  Infrastructure mode and  Ad-hoc mode.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_DISDECNMYPKT</name>
              <description>This bit determines whether hw need to do decryption.
0: If A1 match or broadcast, do decryption.
1: Do decryption,do not check A1</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_AICV</name>
              <description>Accept Integrity Check Value Error packets. This bit determines whether packets with ICV errors will be accepted or rejected.
1: Accept
0: Reject</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_ACRC32</name>
              <description>Accept CRC32 Error packets.
When set to 1, packets with CRC32 errors will be accepted. When set to 0,
packets with CRC32 errors will be rejected.
1: Accept
0: Reject</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_CBSSID_MGNT</name>
              <description>Check BSSID_BCN
When set to 1, MAC will check the BSSID of RX beacon or Probe
response to determine if this packet belongs to this BSSID.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_CBSSID_DATA</name>
              <description>Check BSSID_DATA, To DS, From DS Match Packet.
When set to 1, MAC will check the Rx data type frame"s BSSID, To DS,
and From DS fields, to determine if it is set to Link OK in an Infrastructure
or Ad hoc network. Note this setting is independent of nettype. Driver must
set this bit in ad hoc mode and client mode.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_APWRMGT</name>
              <description>Accept Power Management Packet.
This bit determines whether the RTL8192D will accept or reject packets
with the power management bit set.
1: Accept
0: Reject</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_ADD3</name>
              <description>Accept Address 3 Match Packets.
Set this bit to 1 to accept broadcast/multicast data type frames that Address
3 matching RTL8190"s MAC address. This bit is valid only when NETYPE
(bit 3-2, MSR) is set to Link OK on an Infrastructure network.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_AB</name>
              <description>Accept Broadcast packets.
This bit determines whether broadcast packets will be accepted or rejected.
1: Accept
0: Reject</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_AM</name>
              <description>Accept Multicast packets.
This bit determines whether multicast packets will be accepted or rejected.
1: Accept
0: Reject</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_APM</name>
              <description>Accept Physical Match packets.
This bit determines whether physical match packets will be accepted or
rejected.
1: Accept
0: Reject</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RCR_AAP</name>
              <description>Accept Destination Address packets.
This bit determines whether packets with a destination address will be
accepted or rejected. 
1: Accept
0: Reject</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXPKT_CTL</name>
          <addressOffset>0x0000060C</addressOffset>
          <size>32</size>
          <description>RX Packet Control Register</description>
          <resetValue>0x310404D0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHYSTS_WTIME</name>
              <description>wait physts timeout timer, unit 16 mac clock</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_EXT_DBGSEL</name>
              <description>enable extend dbg port sel</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXGCK_DLY_SEL</name>
              <description>MAC_RX wait some time to gate clock after making the decision (about gating clock).
Unit: T (MAC clock cycle)
0: 0
1: 2
2: 4
3: 8
4: 16
5: 32
6: 64
7: 128</description>
              <bitRange>[25:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_RST_RESP</name>
              <description>When set to 1,enable bb/rdrdy_err/cca_spoofing to reset mac and will not tx response</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXD_OFFSET_SEL</name>
              <description>select 2bytes of rxd to debug port
0: 0~1 bytes; 1: 2~3 bytes; 2: 4~5 bytes; 3: 6~7 bytes;</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RX_DRVINFO_SZ</name>
              <description>RX DESC Driver Info Size: For RXPKTBUF layout, this field indicates the offset starting from the end of RXDESC to the beginning of RX packet. The unit is 8-byte. This value will be copied to DRV_INFO_SIZE field in RXDESC.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RX_DLK_TIME</name>
              <description>macrx dead lock timer timeout value (unit in 4us). As data_on is deasserted and no RXD is received but macrx still waits coming RXD, the deadlock timer will be enabled in this case</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDRDY_NUM_CHK_EN</name>
              <description>When set, enable check rdrdy number is enough or not. If number is not enough will rst macrx</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NEW_RX_RST_EN</name>
              <description>when set, enable new rx rst macrx when macrx is active</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXPKTLMT</name>
              <description>RX PKT Upper Limit. The unit is 512 bytes. When "0", no RX limit is forced.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
