Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_MACID</name>
          <addressOffset>0x00000610</addressOffset>
          <size>32</size>
          <description>MAC ID Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACID0_L</name>
              <description>MAC Identification Number Register BIT[31:0]. Relay mode, when r_P2_WTNAP=1, as relay STA addr; r_P2_WTNAP=0, as relay STA and relay AP addr</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACID_H</name>
          <addressOffset>0x00000614</addressOffset>
          <size>32</size>
          <description>MAC ID Register</description>
          <resetValue>0x00030000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P2_WTNAP</name>
              <description>when relay mode, set1,use macid2 as port2 addr;  set0, use macid0 as port2 addr</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PORT2</name>
              <description>When set1,enable NAN PORT2 funtion for nan rx and response. Relay mode set 0</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PORT1</name>
              <description>When set1,enable PORT1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PORT0</name>
              <description>When set1,enable PORT0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MACID0_H</name>
              <description>MAC Identification Number Register BIT[47:32], relay mode, when r_P2_WTNAP=1, as relay STA addr; r_P2_WTNAP=0, as relay STA and relay AP addr</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BSSID</name>
          <addressOffset>0x00000618</addressOffset>
          <size>32</size>
          <description>BSSID Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BSSID0_L</name>
              <description>Basic Station Set Identification BIT[31:0]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BSSID_H</name>
          <addressOffset>0x0000061C</addressOffset>
          <size>32</size>
          <description>BSSID Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BSSID0_H</name>
              <description>Basic Station Set Identification BIT[47:32]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LA_TRIGGER</name>
          <addressOffset>0x00000620</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTRIG_STOP_SEL</name>
              <description>select tx trigger stop signal for LA dump</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTRIG_STOP_SEL</name>
              <description>select rx trigger stop signal for LA dump</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXTRIG_TYPE</name>
              <description>mapping to frame control type and subtype filed, for LA trigger select</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTRIG_TYPE</name>
              <description>mapping to frame control type and subtype filed, for LA trigger select</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_A1_ADDR_MASK</name>
          <addressOffset>0x00000624</addressOffset>
          <size>32</size>
          <description>A1 Addr Mask Register</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_RXA1_MASK</name>
              <description>mask rx A1 addr [39:8] for test</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_INVALID_PKT_CTL</name>
          <addressOffset>0x00000628</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000000C0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXGCK_OFDMCCA_EN</name>
              <description>This bit is set to 1 to let OFDMCCA be one of the signals that can wakeup MAC from Rx_idle</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPSF_PKTLEN_THR</name>
              <description>Packet txtime threshold for invalid packet decision
3'd0:  32us
3'd1:  64us
3'd2:  128us
3'd3:  256us
3'd4:  512us
3'd5:  1024us
3'd6:  2048us
3'd7:  4096us
Only the packet which txtime is longer than this threshold will trigger an invalid_pkt pulse.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPSF_OFDM_RSTEN</name>
              <description>This bit is set to 1 to reset MAC Rx before sending OFDM (include OFDM, HT, VHT) packet triggered invalid_pkt pulse
(0 for debug)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPSF_CCK_RSTEN</name>
              <description>This bit is set to 1 to reset MAC Rx before sending CCK packet triggered invalid_pkt pulse(0 for debug)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPSF_MHCHKEN</name>
              <description>1:enable MAC to inform BB enter power saving mode as rx unmatch my MACID unicast or unmatch my BSSID Broadcast/Mutlicast mpdu</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPSF_AMCHKEN</name>
              <description>1:enable MAC to inform BB enter power saving mode as rx unmatch my MACID unicast or unmatch my BSSID Broadcast/Mutlicast ampdu</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PWRBIT_SETTING</name>
          <addressOffset>0x0000062C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_CLI0_PWRBIT_EN</name>
              <description>For client0 (port1). If this bit is set to 1, MAC will overwrite power bit of frame control according to CLI0_PWR_ST. (only for data frame)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CLI0_PWRBIT_VAL</name>
              <description>For client0 (port1). MAC will overwrite power bit of frame control according to CLI0_PWR_ST.(only for data frame)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_TCR_CTL</name>
          <addressOffset>0x00000630</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x08060000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZLD_NUM</name>
              <description>Fetch zero length delimiter number(unit : 4bytes) when mactx underflow</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDF_THSD</name>
              <description>[22]: enable underflow recovery;r_UDF_THSD[7]=0,disable underflow recovery;
[21:16]: Underflow threshold</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_TSFT_OFS</name>
              <description>BIT_WMAC_TCR_TSFT_OFS[7:0] is for cck stamp time offset; 
BIT_WMAC_TCR_TSFT_OFS[15:8] is for ofdm rate time offset;</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_STMP_THSD</name>
          <addressOffset>0x00000634</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_TCR_E_TSFT_OFS</name>
              <description>BIT_WMAC_TCR_TSFT_OFS[7:0] is for ht/vht/he stamp time offset;</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_USTIME_EDCA</name>
          <addressOffset>0x00000638</addressOffset>
          <size>32</size>
          <description>US Time Tuning for EDCA Register</description>
          <resetValue>0x100A0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_SPEC_SIFS_OFDM</name>
              <description>The spec SIFS value for duration calculation</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SPEC_SIFS_CCK</name>
              <description>The spec SIFS value for duration calculation</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RESP_SIFS_CCK</name>
          <addressOffset>0x0000063C</addressOffset>
          <size>32</size>
          <description>Response SIFS for CCK Register</description>
          <resetValue>0x0002D07E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_ACKTO_OFDM</name>
              <description>This register sets the Ack time out value after Tx unicast packet with OFDM rate. It is in units of us.</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_ACKTO_CCK</name>
              <description>This register sets the Ack time out value after Tx unicast packet with CCK rate. It is in units of us.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ACKTO</name>
          <addressOffset>0x00000640</addressOffset>
          <size>32</size>
          <description>ACK Timeout Register</description>
          <resetValue>0x013A0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_EIFS</name>
              <description>This register sets the EIFS value mentioned in 802.11 specification. It is in
units of us. To receive 1Mbps ACK frame, EIFS = SIFS + 144us (preamble
length) + 48us (PLCP header length) + 112us (14 bytes of data) = 314us.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_NESS</name>
              <description>number of extend ht-ltf for ht ppdu</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RECCA_CTRL</name>
          <addressOffset>0x00000644</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_RXAI_INFO_RST</name>
              <description>write 1 to clear bit6 and bit5 flag,one pulse</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WMAC_RXAI_PRTCT_REL</name>
              <description>If MAC_reset_protect is set to 0 by MAC decision circuit (address/A-MPDU checking), set this bit to 1.
Reset by BIT_RXAI_INFO_RST = 1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WMAC_RXAI_PRTCT_VIO</name>
              <description>If MAC gets BB_reset_MAC pulse when MAC_reset_protect = 1, set this bit to 1.
Reset by BIT_RXAI_INFO_RST = 1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WMAC_RXAI_PRTCT_SEL</name>
              <description>MAC_reset_protect rises at
0: DATA_ON rises
1: PLCP check OK (OFDM/CCK) or receiving 3rd/2nd (VHT/HT) RDRDY</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXAI_AGG_CHKEN</name>
              <description>This bit is only workable when BIT_RXAI_ADDR_CHKEN = 1.
1: if and only if the receiving address matched PPDU is A-MPDU and is not VHT single MPDU, then MAC inform BB not doing reCCA.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXAI_ADDR_CHKEN</name>
              <description>This bit is set to 1 to enable MAC to inform BB not doing reCCA during receiving the address matched PPDU.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CSI_PTR</name>
          <addressOffset>0x00000648</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSI_RADDR_LATCH</name>
              <description>txff read pointer latch value after Tx CSI report pkt (unit: 8B)</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_WADDR_LATCH</name>
              <description>txff write pointer latch value at ndp_valid negative edge (unit: 8B)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BF_CTL</name>
          <addressOffset>0x0000064C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00004800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_CSI_START_PAGE</name>
              <description>The starting page number of csi rpt in buffer,unit 128 byte</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_PAUSE_BB_CLR_TH</name>
              <description>MAC_PAUSE_BB High to Low clear threshold of csidma syncff read-write pointer</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_NOCHK_BFPOLL_BMP</name>
              <description>Set this bit to ignore retransmission bitmap of rx beamforming report poll</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CSI_OFDM_LEN_TH</name>
              <description>CSI frame length threshold for using legacy OFDM (unit: 128B). 0 means disabled.
If CSI frame length &gt; threshold, search from VHT or HT bitmap
If CSI frame length &lt; threshold, search from legacy OFDM bitmap</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MU_BFEE_DIS</name>
              <description>If set to 1, HW will be SU only beamformee and not response to NDPA or Beamforming report poll.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NAV_THRSHOLD</name>
          <addressOffset>0x00000650</addressOffset>
          <size>32</size>
          <description>NAV Threshold Register</description>
          <resetValue>0x00000426</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_NAV_UPBDY</name>
              <description>When NAV update is beyond this value, then NAV update is aborted. When this field is 0x00, NAV_UPPER function is disable. The unit is 128us.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RxMyRTS_NAV</name>
              <description>RX my RTS NAV. As rx my unicast RTS and RxMyRTS_NAV is not equal to zero, then rx NAV is set to wait response transition time and RxMyRTS_NAV to avoid contention with the TXOP originator. If RxMyRTS_NAV is equal to zero, this mechanism is disabled</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RTS_RST_DUR</name>
              <description>RTS NAV Reset Time. This is the value in us, not including the time of CTS frame, to reset the NAV set by an RTS frame if no PHY indication occurred during this time. Refer to 802.11 1999 Section 9.2.5.4 for detailed description.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BACAMCMD</name>
          <addressOffset>0x00000654</addressOffset>
          <size>32</size>
          <description>Block ACK CAM Command Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BACAM_RST</name>
              <description>Set 1 to reset BA CAM. Hardware will set the invalid bit for all entries. After reset is finished this bit is reset to 0.</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WMAC_TXSBMPMOD</name>
              <description>Bit[15]: if macrx_dma idle, grant txsbmp_req
Bit[14]: if macrx is idle, grant txsbmp_req
00: If FSM is idle, grant txsbmp_req
01: If FSM and mac rx is idle, grant txsbmp_req
10: If FSM and macrx_dma is idle, grant txsbmp_req
11: if FSM, macrx and macrx_dma is idle, grant txsbmp_req</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_PLCP_MONITOR</name>
          <addressOffset>0x00000658</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_PLCP_TRX_SEL</name>
              <description>Selection of Tx/Rx plcp header
0:Rx 
1:Tx</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_PLCP_RDSIG_SEL</name>
              <description>Selection of plcp header signal field 
0:LSIG
1:HTSIG1/VHTSIGA1     
2:HTSIG2/VHTSIGA2   
3:VHTSIGB  
4: SERVICE field</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RATE_IDX</name>
              <description>ppdu type follow trxinfo definition</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WMAC_PLCP_RDSIG</name>
              <description>Selected signal field to read out</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
