Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_LBK_DLY</name>
          <addressOffset>0x00000660</addressOffset>
          <size>32</size>
          <description>Loopback Delay Register</description>
          <resetValue>0x00000019</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_TRX_STS_TYPE</name>
              <description>The type and subtype field of frame control of rx packet</description>
              <bitRange>[23:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXACT_IND</name>
              <description>Indicate MAC/PHY is busy to tx packet</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXACT_IND</name>
              <description>Indicate MAC is busy to rx packet</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WMAC_LBK_DLY</name>
              <description>Loopback Delay. In unit of 'us'; indicates the delay after which the tdrdy_mac starts. In wep/tkip mode,
the delay should be larger than 15, because the initial delay of security is about 1320 cycles, approximately to 16.5 us.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXERR_RPT</name>
          <addressOffset>0x00000664</addressOffset>
          <size>32</size>
          <description>RX Error Report Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_RXPKTCNT_SEL</name>
              <description>Rx packet counter report selection
RXERR_RPT_SEL[2:0]: Counter description
3'd0: counter 0
3'd1: counter 1
3'd2: counter 2
3'd3: counter 3
3'd4: counter 4
3'd5: counter 5
3'd6: counter 6
3'd7: counter 7</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPKTCNT_RST</name>
              <description>Write "1" to set the counter to zero. One pulse</description>
              <bitRange>[28:28]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UDPKTCNT_SET</name>
              <description>loading user define packet counter, one pulse</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WMAC_RXPKTCNT_CFG</name>
              <description>[23:22} Select matched BSSID: 2'b0: Port 0 2'b1: Port 1 2'b2: Port 2; otherwise, do not care bssid match or not
[21:18] User defined SubType
[17:16] User defined Type</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RPT_COUNTER</name>
              <description>The reported counter value corresponding to Report type selected.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_TRXPTCL_CTL</name>
          <addressOffset>0x00000668</addressOffset>
          <size>32</size>
          <description>WMAC TX/RX Protocol Control Register</description>
          <resetValue>0x0EA01000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_EN_STOP_UPDNAV</name>
              <description>When this bit set 1. If RX packet with EDCA_REF is low, not update NAV.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RST_EDCA_ACKTO</name>
              <description>While in ACKTO duration, reset scheduler top to TX</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RST_EDCA_EIFS</name>
              <description>While in EIFS duration, reset scheduler top to TX</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_PLCPCHK_RST_EIFS</name>
              <description>Reset EIFS counter while receive correct PLCP.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CCA_RST_EIFS</name>
              <description>Reset EIFS counter while CCA on</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_UPD_MYRXPKTNAV</name>
              <description>Do not update NAV, while receiving my packet.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RESP_EARLY_TXBA</name>
              <description>While phyrxon down, mac_rxactive on. Ignore mac rx busy, respond BA immediately.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RESP_CHNBUSY</name>
              <description>Define channel busy condition in responder to determine RX busy
1: PHYRXON (OFDM_VBON/CCKCCA)
0: CCA (CCKCCA/OFDMCCA)</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RESP_SPLCPEN</name>
              <description>Enable responder send SPLCP CCK response for acknowledging Rx SPLCP CCK
packet</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RESP_SGIEN</name>
              <description>Enable responder send SGI HT-OFDM response for acknowledging Rx SGI
HT-OFDM packet</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RESP_LDPC_EN</name>
              <description>if rxpkt with ldpc, response pkt with ldpc</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_RESP_ACKINCCA</name>
              <description>Disable to response ack when cca goes high after SIFS</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_RESP_CTSINCCA</name>
              <description>8812
Disable to response cts when cca goes high after SIFS</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SECOND_CCA_TIMER</name>
              <description>8812
The maximum time interval in us that secondary cca is pull high
before primary cca When receive duplicated rts. When station
response with cts, if the time that secondary cca pull high before
primary cca is larger than this threshold, then secondary cca is judged
to be interference, otherwise it is judged to the received RTS frame.
default: 3"b0</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RFMOD</name>
              <description>8812
RF_BW indication, Used to decide response duplicated cts txsc
2"b00: 20M, 2"b01: 40M, 2"b10: 80M
e.g: when RF_BW= 80M, duplicated cts BW= 40M, txsc = 9 or 10
when RF_BW = 40M, duplicated cts BW = 40M, txsc = 0</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RESP_CTS_DYNBW_SEL</name>
              <description>8812 Response cts bw selection when dynamic rts frame is received
00: current maximum bw indicated by secondary cca
01: bw fall back by one level based on bw in 2"b00 if not reach 20M
10: bw fall back by one level based on bw in 2"b01 if not reach 20M
11: bw fall back by one level based on bw in 2"b10 if not reach 20M
e.g, current maximum bw indicated by secondary_cca is 80M, when set to 2"b00, the response cts bw is 80M, when set to 2"b01, cts bw is 40M, when set to 2"b10 or 2"b11 , cts bw is 20M</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_TRXPTCL_CTL_H</name>
          <addressOffset>0x0000066C</addressOffset>
          <size>32</size>
          <description>WMAC TX/RX Protocol Control Register Higher Bit</description>
          <resetValue>0x00042007</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_ACKRXBA_TYPESEL</name>
              <description>Determine response type for RX BA, and the definition as the bellow
0: NAV
1: Send ACK
ACKBA_TYPESEL[0]: used for Basic BA
ACKBA_TYPESEL[1]: used for Compression BA
ACKBA_TYPESEL[2]: RSVD
ACKBA_TYPESEL[3]: used for MTID BA</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_ACKRXBA_ACKPCHK</name>
              <description>If set 1, then check ACK Policy of BA control field to determine whether send response or not. When this bit set to 1 and
a. ACK Policy of Rx BA control field is 0, then response type is controlled by ACLBA_TYPESEL.
b. ACK Policy of Rx BA control field is 1, then don't send response
If set 0, then ignore the ACK policy of RX BA control field and response type controlled by ACKBA_TYPESEL
ACKBA_ACKPCHK[0]: used for Basic BA
ACKBA_ACKPCHK[1]: used for Compression BA
ACKBA_ACKPCHK[2]: RSVD
ACKBA_ACKPCHK[3]: used for MTID BA</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_ACKRXBAR_TYPESEL</name>
              <description>Determine response type for RX BAR, and the definition as the bellow
00: NAV
01: Send BA
10: Send ACK
ACKBAR_TYPESEL[1:0]: used for Basic BAR
ACKBAR_TYPESEL[3:2]: used for Compression BAR
ACKBAR_TYPESEL[5:4]: RSVD
ACKBAR_TYPESEL[7:6]: used for MTID BAR</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_ACKRXBAR_ACKPCHK</name>
              <description>If set 1, then check ACK Policy of BAR control field to determine whether send response or not. When this bit set to 1 and
a. ACK Policy of Rx BAR control field is 0, then response type is controlled by ACLBAR_TYPESEL.
b. ACK Policy of Rx BAR control field is 1, then don't send response
If set 0, then ignore the ACK policy of RX BAR control field and response type
controlled by ACKBA_TYPESEL
ACKBA_ACKPCHK[0]: used for Basic BAR
ACKBA_ACKPCHK[1]: used for Compression BAR
ACKBA_ACKPCHK[2]: RSVD
ACKBA_ACKPCHK[3]: used for MTID BAR</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXBA_IGNOREA2</name>
              <description>Disable check A2 field of RX BA</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SAVE_ALL_TXOPADDR</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_EN_TXCTS_TOTXOPOWNER_INRXNAV</name>
              <description>together with bit41, implement 802.11ac txop owner function</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_TXBA_AMPDUFCSERR</name>
              <description>Disable to send BA for responding RX AMPDU with FCS error subframe</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_TXBA_RXBARINFULL</name>
              <description>Disable to send BA for responding RX control wrapper BAR dropped by rxpkbuffer full</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_TXCTS_INFULL</name>
              <description>Disable to send CTS for responding RX control wrapper RTS dropped by rxpktbuffer full</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_EN_TXACKBA_INTXOP</name>
              <description>If this bit is set, then MAC will Tx ACK/BA to respond previous rx my unitcast packets send by another STA during my TXOP</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_EN_TXCTS_INRXNAV</name>
              <description>Enable to send CTS in Rx NAV</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_EN_TXCTS_INTXOP</name>
              <description>Enable to send CTS for responding RX RTS during our TXOP period</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TRANSMIT_ADDRSS_0</name>
          <addressOffset>0x00000674</addressOffset>
          <size>32</size>
          <description>TA0 Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_TRANS_ADDR0_L</name>
              <description>bcn and prob response transmitter address for port 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TRANSMIT_ADDRSS_0_H</name>
          <addressOffset>0x00000678</addressOffset>
          <size>32</size>
          <description>TA0 Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_TRANS_ADDR0_H</name>
              <description>bcn and prob response transmitter address for port 0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CAMDBG</name>
          <addressOffset>0x0000067C</addressOffset>
          <size>32</size>
          <description>CAM Debug Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_KEYCAM_DBGSEL</name>
              <description>Select TX/RX CAM Information.
Set to 1 to retrieve latest Tx search result.
Set to 0 to retrieve latest Rx search result.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYCAM_DBGOUT</name>
              <description>[15]:Security Key Found in CAM
0: key not found
1: key found
[14:]: rx spp valid
[13:11]: rx found security key type 
[10]: rx found security key ext_sectype 
[9:7]:rsvd
[6:0]:Security KEY ADDR</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SECCFG</name>
          <addressOffset>0x00000680</addressOffset>
          <size>32</size>
          <description>Security Configuration Register</description>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_DIS_GCLK_SEC</name>
              <description>Disable gated clock control for AES/GCMP/WAPI engine.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_AES_SEL_QC</name>
              <description>[12]:1: use QC[7] to compute mic; 0: not use QC[7] to compute mic
[11]:1:use QC[7] to compute ctr; 0: not use QC[7] to compute ctr</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CKEYID</name>
              <description>If this bit is set to 1, key search engine need to check if key ID matched. If this bit is
set to 0, then key ID table must be filled with 2"b00.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXBCUSEDK</name>
              <description>Force RX Broadcast packets Use Default Key
If this bit is set to 1, use default key for RX key search when received packet is broadcast and multicast.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXDEC</name>
              <description>Enable Rx Decryption
Setting 1 to enable Rx hardware decryption.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TXENC</name>
              <description>Enable Tx Encryption
Setting to 1 to enable Tx hardware encryption.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BCN_IEPSR0</name>
          <addressOffset>0x00000684</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_BCN_MBSSID_MASK</name>
              <description>enable tim no hit don't check whether  BC/MC packets are buffered at nontransmitted BSSID</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_CLR_N</name>
              <description>enable clear macbssid indicator when no multiple BSSID element is found.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_IE1_PSR</name>
              <description>enable parser specified ie 1 element</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_IE0_PSR</name>
              <description>enable parser specified ie0 element</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_MBSSID_PSR</name>
              <description>enable parser multiple BSSID element</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_SW_MBSSID</name>
              <description>enable the MaxBSSID indicator value from SW</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_MBSSID_N</name>
              <description>SW write the value of MaxBSSID Indicator field</description>
              <bitRange>[25:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_ID1_EXT</name>
              <description>indicate current ie is the extend element which need to parser extend id field</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_IE_ID1</name>
              <description>specified Element ID, set corresponding interrupt when it is parsed</description>
              <bitRange>[16:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_ID0_EXT</name>
              <description>indicate current ie is the extend element which need to parser extend id field</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_IE_ID0</name>
              <description>specified Element ID, set corresponding interrupt when it is parsed</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
