Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_BCN_IEPSR1</name>
          <addressOffset>0x00000688</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_BCN_MBSSID_OFS</name>
              <description>the multiple bssid element offset (byte unit) in frame body</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_N0_CHG</name>
              <description>indicate parsed maxmbssid indicator field value has changed which leads to the change of N0.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_MBSSID_VAL</name>
              <description>indicate ofs and n0 change bit is valid.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_OPS_PSR_EN</name>
              <description>enable parser ops frame tim elemnt and ops element</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TIM_TIMPSR_EN</name>
              <description>enable parser tim frame tim element</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_BMC_MASK</name>
              <description>bcn tim hit bc/mc mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BCN_MBSSID_IDX</name>
              <description>the multiple bssid index that current sta connect with</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SOUNDING_CFG</name>
          <addressOffset>0x0000068C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_EN_NDP_NSS2</name>
              <description>enable nss=2 when tx ndp in fpga mode</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BFINFO_20M_0</name>
              <description>beamforming info</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MYPKT_FLAG</name>
          <addressOffset>0x00000690</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_WMMPS_UAPSD_TID</name>
              <description>[7:0]:Disable interrupt 8051 when rx WMMPS UAPSD Qos data with TID7-TID0</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXMGTIN0</name>
              <description>It is set to 1 if NIC received management frame with correct BSSID and DA (including unicast and BMC).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDATAIN2</name>
              <description>It is set to 1 if NIC received data frame with correct BSSID and DA (including unicast and BMC).</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDATAIN1</name>
              <description>It is set to 1 if NIC received data frame with correct BSSID and DA (including unicast and BMC).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDATAIN0</name>
              <description>It is set to 1 if NIC received data frame with correct BSSID and DA (including unicast and BMC).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_ZB_COEX_TB</name>
          <addressOffset>0x00000694</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_ZB_COEX_TABLE</name>
              <description>bt and zigbee coexist table</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NAN_BSSID_L</name>
          <addressOffset>0x00000698</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_BSSID_NAN_L</name>
              <description>Low 32bit address for NAN BSSID. It will be used as father mac address when relay mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NAN_BSSID_H</name>
          <addressOffset>0x0000069C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_BSSID_NAN_H</name>
              <description>High 16bit address for NAN BSSID. It will be used as father mac address when relay mode.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXFLTMAP0</name>
          <addressOffset>0x000006A0</addressOffset>
          <size>32</size>
          <description>RX Filter Map Group 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_CTRLFLT15En</name>
              <description>When set, frames with type=01 and subtype=1111 are received into RXFF.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT14En</name>
              <description>When set, frames with type=01 and subtype=1110 are received into RXFF.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT13En</name>
              <description>When set, frames with type=01 and subtype=1101 are received into RXFF.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT12En</name>
              <description>When set, frames with type=01 and subtype=1100 are received into RXFF.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT11En</name>
              <description>When set, frames with type=01 and subtype=1011 are received into RXFF.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT10En</name>
              <description>When set, frames with type=01 and subtype=1010 are received into RXFF.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT9En</name>
              <description>When set, frames with type=01 and subtype=1001 are received into RXFF.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT8En</name>
              <description>When set, frames with type=01 and subtype=1000 are received into RXFF.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT7En</name>
              <description>When set, frames with type=01 and subtype=0111 are received into RXFF.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT6En</name>
              <description>When set, frames with type=01 and subtype=0110 are received into RXFF.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT5En</name>
              <description>When set, frames with type=01 and subtype=0101 are received into RXFF.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT4En</name>
              <description>When set, frames with type=01 and subtype=0100 are received into RXFF.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT3En</name>
              <description>When set, frames with type=01 and subtype=0011 are received into RXFF.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT2En</name>
              <description>When set, frames with type=01 and subtype=0010 are received into RXFF.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT1En</name>
              <description>When set, frames with type=01 and subtype=0001 are received into RXFF.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRLFLT0En</name>
              <description>When set, frames with type=01 and subtype=0000 are received into RXFF.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT15En</name>
              <description>When set, frames with type=00 and subtype=1111 are received into RXFF.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT14En</name>
              <description>When set, frames with type=00 and subtype=1110 are received into RXFF.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT13En</name>
              <description>When set, frames with type=00 and subtype=1101 are received into RXFF.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT12En</name>
              <description>When set, frames with type=00 and subtype=1100 are received into RXFF.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT11En</name>
              <description>When set, frames with type=00 and subtype=1011 are received into RXFF.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT10En</name>
              <description>When set, frames with type=00 and subtype=1010 are received into RXFF.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT9En</name>
              <description>When set, frames with type=00 and subtype=1001 are received into RXFF.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT8En</name>
              <description>When set, frames with type=00 and subtype=1000 are received into RXFF.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT7En</name>
              <description>When set, frames with type=00 and subtype=0111 are received into RXFF.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT6En</name>
              <description>When set, frames with type=00 and subtype=0110 are received into RXFF.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT5En</name>
              <description>When set, frames with type=00 and subtype=0101 are received into RXFF.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT4En</name>
              <description>When set, frames with type=00 and subtype=0100 are received into RXFF.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT3En</name>
              <description>When set, frames with type=00 and subtype=0011 are received into RXFF.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT2En</name>
              <description>When set, frames with type=00 and subtype=0010 are received into RXFF.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT1En</name>
              <description>When set, frames with type=00 and subtype=0001 are received into RXFF.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGTFLT0En</name>
              <description>When set, frames with type=00 and subtype=0000 are received into RXFF.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RXFLTMAP</name>
          <addressOffset>0x000006A4</addressOffset>
          <size>32</size>
          <description>RX Filter Map Group 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_DATAFLT15En</name>
              <description>When set, frames with type=10 and subtype=1111 are received into RXFF.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT14En</name>
              <description>When set, frames with type=10 and subtype=1110 are received into RXFF.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT13En</name>
              <description>When set, frames with type=10 and subtype=1101 are received into RXFF.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT12En</name>
              <description>When set, frames with type=10 and subtype=1100 are received into RXFF.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT11En</name>
              <description>When set, frames with type=10 and subtype=1011 are received into RXFF.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT10En</name>
              <description>When set, frames with type=10 and subtype=1010 are received into RXFF.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT9En</name>
              <description>When set, frames with type=10 and subtype=1001 are received into RXFF.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT8En</name>
              <description>When set, frames with type=10 and subtype=1000 are received into RXFF.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT7En</name>
              <description>When set, frames with type=10 and subtype=0111 are received into RXFF.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT6En</name>
              <description>When set, frames with type=10 and subtype=0110 are received into RXFF.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT5En</name>
              <description>When set, frames with type=10 and subtype=0101 are received into RXFF.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT4En</name>
              <description>When set, frames with type=10 and subtype=0100 are received into RXFF.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT3En</name>
              <description>When set, frames with type=10 and subtype=0011 are received into RXFF.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT2En</name>
              <description>When set, frames with type=10 and subtype=0010 are received into RXFF.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT1En</name>
              <description>When set, frames with type=10 and subtype=0001 are received into RXFF.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATAFLT0En</name>
              <description>When set, frames with type=10 and subtype=0000 are received into RXFF.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BCN_PSR_RPT0</name>
          <addressOffset>0x000006A8</addressOffset>
          <size>32</size>
          <description>Beacon Parser Report Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTIM_CNT0</name>
              <description>The DTIM count field of the TIM element of Rx beacon</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTIM_PERIOD0</name>
              <description>The DTIM period field of the TIM element of Rx beacon</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HAS_MY_BC0</name>
              <description>Indicate BC/MC packets are buffered in transmitted BSSID or AP</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HAS_MY_BSSID0</name>
              <description>Indicate BC/MC packets are buffered in nontransmitted BSSID, SW need check crespponding dtim count field in multiple bssid index field</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HAS_MYAID0</name>
              <description>Indicate has my unicast packet</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RPT_VALID0</name>
              <description>when set to 1, indicate the tim report is valid</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_AID0</name>
              <description>AID for MACID0</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NAN_TA_L</name>
          <addressOffset>0x000006AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_TA_NAN_L</name>
              <description>Low 32bit address for NAN BSSID. It will be used as soft ap addr of father node when relay mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
