Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_NAN_TA_H</name>
          <addressOffset>0x000006B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_TA_NAN_H</name>
              <description>High 16bit address for NAN BSSID, It will be used as soft ap addr of father node when relay mode.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_STATE_MON</name>
          <addressOffset>0x000006B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_STATE_SEL</name>
              <description>WMAC read and write FSM selection:
000,001:read mactx status
010,011:read mactx status
100:read response status
00xxx: write [6:0]to mactx fsm when [7] valid
01xxx:write [6:0]to macrx fsm when [7] valid
100xx: write [6:0]to response fsm when [7] valid</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_STATE_CUR</name>
              <description>when BIT_WRITE_FSM_EN is valid,is rsvd. When BIT_WRITE_FSM_EN is not valid, means read status</description>
              <bitRange>[23:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_FSM_EN</name>
              <description>when set 1, generate write pulse, otherwise means read status</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WMAC_STATE_NXT</name>
              <description>when BIT_WRITE_FSM_EN is valid,Indicate the FSM current state to write.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ERROR_EVT_CTL</name>
          <addressOffset>0x000006B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSIRPT_LEN_BB_MORE_THAN_MAC</name>
              <description>Indicate MAC Rx csi rxd number overflow</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_CHKSUM_FAIL</name>
              <description>Indicate MAC Rx csi rpt checksum error</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACRX_ERROR_INTPS5</name>
              <description>RSVD</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACRX_ERROR_INTPS4</name>
              <description>[20]: Indicate last MPDU length of AMPDU or PPDU length is error.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACRX_ERROR_INTPS3</name>
              <description>[19]: Indicate rxfifo or mac phy interface fifo overflow</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACRX_ERROR_INTPS2</name>
              <description>[18]: Indicate MAC Rx occurs internal halt event</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACRX_ERROR_INTPS1</name>
              <description>[17]: Indicate Rx packet length &gt;= 12K bytes</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACRX_ERROR_INTPS0</name>
              <description>[16]: Indicate MAC Rx occurs halt event</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WMAC_PRETX_ERRHDL_EN</name>
              <description>Pre tx error block enable signal</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MACTX_ERROR_INTPS4</name>
              <description>RSVD</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACTX_ERROR_INTPS3</name>
              <description>[3]: Indicate PHY fetch plcp before it is ready</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACTX_ERROR_INTPS2</name>
              <description>[2]: phy_txen is set ,but wait phy_phytxon time out</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACTX_ERROR_INTPS1</name>
              <description>[1]: Indicate TXD FIFO underflow,ppdu fetch zld</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACTX_ERROR_INTPS0</name>
              <description>[0]: Indicate TXD FIFO underflow,mpdu fetch zld</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_COEX_CFG_MACID_SRCH</name>
          <addressOffset>0x000006BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_OOB</name>
              <description>out of band indication (0: in band; 1: out of band)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_ANT_SEL</name>
              <description>single or dual antenna (0: single; 1: dual)</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SRCH_FIFOFULL</name>
              <description>when set to 1, when fifofull, stop macid search;</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_COEX_TABLE_V1</name>
          <addressOffset>0x000006C0</addressOffset>
          <size>32</size>
          <description>BT Coexistence Control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTA_TABLE_0</name>
              <description>coexistence table, used at dual antenna &amp; out of band</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_COEX_TABLE2_V1</name>
          <addressOffset>0x000006C4</addressOffset>
          <size>32</size>
          <description>BTCoexistence Control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTA_TABLE_1</name>
              <description>coexistence table, used at dual antenna &amp; in band or single antenna</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_COEX_BREAK_TABLE</name>
          <addressOffset>0x000006C8</addressOffset>
          <size>32</size>
          <description>BT Coexistence Control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTA_TABLE_3</name>
              <description>Table used to break BT activity, when new WLAN request is coming and BT
is on transmitting or receiving</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTA_TABLE_2</name>
              <description>Table used to break WLAN activity, when new BT request is coming and
WLAN is on transmitting or receiving</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_COEX_PRI_MASK</name>
          <addressOffset>0x000006CC</addressOffset>
          <size>32</size>
          <description>BT Coexistence Control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_MASK</name>
              <description>[31]: Priority Mask for P2 NAN sync Beacon TBTT
[30]: Priority Mask for P2 NAN disc Beacon TBTT
[29]: Priority Mask for P2 NAN DW
[28]: Priority Mask for RX Response Packet
[27]: Priority Mask for RX OFDM
[26]: Priority Mask for RX CCK
[25:19]: Priority Mask for Tx Queue
[18:11]: Priority Mask for Tx NAV
[10]: Priority Mask for Tx CCK
[9]: Priority Mask for Tx OFDM
[8]: Priority Mask for Tx Retry Packet
[7:4]: Priority Mask for Tx packet number
[3]: Priority Mask for P1 TBTT
[2]: Priority Mask for P0 TBTT
[1]: Priority Mask for Tx response
[0]: Priority Mask for Rx response</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_MU_BF_CTL</name>
          <addressOffset>0x000006D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_RETXBFRPTSEQ_UPD</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RESP_TXINFO_CFG</name>
          <addressOffset>0x000006D8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_RESP_MFB</name>
              <description>MFB information in register for response packet</description>
              <bitRange>[31:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CSI_CTRL</name>
          <addressOffset>0x000006DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x7C000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_CSIREQ_OPT</name>
              <description>clear csi report request if response fsm idle</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_USE_NDPARATE</name>
              <description>1: use ndpa rx rate to decide csi report rate
0: use ndp rx rate to decide csi report rate</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_CONTENT_BMASK</name>
              <description>byte mask of 4byte contents value that need to compare
when set to 1, the conrresponding byte need to compare</description>
              <bitRange>[29:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_OFFSET</name>
              <description>used for rx normal mode
the payload offset for compare with configured value. 0 meansthe 0-3 bytes payload need to compare after header/iv/eiv</description>
              <bitRange>[25:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CSI_RATE_FORCE_EN</name>
              <description>0: disable CSI force rate. Refer to RRSR bitmask
1: CSI frame Tx rate refers to 0x6DC[29:24]</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CSI_RSC_FORCE</name>
              <description>If csi_force_rate_en = 1, CSI frame sub-channel configuration
00: Primary 20Mhz BW(0x483[3:0])
01: Follow Rx packet BW.
10: Duplicate mode.
11: Reserved</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CSI_GID_SEL</name>
              <description>SIG-A content
1 :  group id=0, 0 :  group id=63</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSIRD_EMPTY_APPZERO</name>
              <description>0: Not append zero data when rx_fifo read csi data to empty. If csi data length of BB transmitted is smaller than MAC expected, Tx CSI report would be FCS error.
1: Append zero data when rx_fifo read csi data to empty. If csi data length of BB transmitted is smaller than MAC expected, there would be zero before FCS field of Tx CSI report pkt and the CSI report pkt would be FCS ok</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CSI_RATE_FB_EN</name>
              <description>Enable CSI frame rate fallback (only one step in CSI RRSR)
This bit is set to 1 to enable MAC to use previous latched csi resp rate for retry pkt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_WRPTR_WO_CHKSUM</name>
              <description>This bit is set to 1 when rx_fifo don't enable csi data checksum.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADAR_DATA_WTLMT</name>
              <description>Wait timeout value after data on, unit 4 mac clock cycles</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_PAGE6</name>
          <addressOffset>0x000006E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description>DUMMY</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CHINFO_CONTENT</name>
          <addressOffset>0x000006E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHINFO_CONTENT</name>
              <description>the packet text value need hw to compare for channel info rx normal mode. When the content check function is enables, channel info will be reiggered only when the text match the cfg value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SOUNDING_CFG1</name>
          <addressOffset>0x000006E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000FE000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADAR_SIZE</name>
              <description>radar prefull window for hw to check if buffer is enough for next radar pkt</description>
              <bitRange>[31:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BF_ENDADDR</name>
              <description>beamforming csi data occupy size of csi buffer, eco use</description>
              <bitRange>[20:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_CSIBUF_ENDADDR</name>
              <description>chinfo buffer endaddr extension. Chinfo buffer size={EXT_CSIBUF_ENDADDR, CSIBUF_ENDADDR}. Eco use</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RELAY_IGNORE_BCNOFSAP</name>
              <description>0: update tsft when bcn a2 fit last soft ap addr
1: not update tsft when bcn a2 fit last soft ap addr, eco use</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TXCSI_AID0</name>
              <description>P_AID of the associated bemaformer0</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CHINFO_ADDR</name>
          <addressOffset>0x000006EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHINFO_TX_ADDR_L</name>
              <description>low 32bit tx address for trigger channel info</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CHINFO_CFG</name>
          <addressOffset>0x000006F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x21180000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHINFO_CONTENT_EN</name>
              <description>used for rx normal mode
1: the payload( excluding mac header/iv/eiv/mic/fcs) of the specified location must match the configured value
0: do not check the payload value</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_DROP_INVALID</name>
              <description>when set to 1, will drop channe info if valid bit of bb header is 0</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_FCS</name>
              <description>when set to 1, will not check channel info fcs ok flag</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_WTM_OUT</name>
              <description>BB does't send channel info when timeout occur</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHINFO_TIME_OUT</name>
              <description>BB send channel info length is less than report length</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_BUFF_FULL</name>
              <description>Indicate rxcsibuff full occur</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHINFO_DATA_WTLMT</name>
              <description>Wait timeout value after repuest channe info, unit 4 mac clock cycles</description>
              <bitRange>[24:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_RPT_DUMMY</name>
              <description>1:rx chinfo rpt alll segment
0: rx chinfo rpt only data</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_TXADDR_EN</name>
              <description>1: chinfo trigger condition need check a2 match txaddr or rx is cts/ack
0: not need to check a2</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_A1_EN</name>
              <description>1: chinfo trigger condition need check a1 match self mac address
0: not need to check a1</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_MODE</name>
              <description>channel info mode setting. 0: enable normal rx trigger; 1: enable ndpa trigger; note: repsonse mode decided by tx descriptor. Valid when r_CHINFO_EN is 1.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_EN</name>
              <description>enable for getting channel info from BB. When set to 0, will not trigger channel info function</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHINFO_TX_ADDR_H</name>
              <description>high 16bit tx address for trigger channel info</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
