Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_RXCSIBUF_CFG</name>
          <addressOffset>0x000006F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x17F407F4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADAR_DROP_INVALID</name>
              <description>when set to 1, will not drop radar info if valid bit of bb header is 0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADARBUF_ENDADDR</name>
              <description>rx radarbuffer boundary, default is 3K bytes</description>
              <bitRange>[30:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADARBUF_THRESHOD</name>
              <description>rx radar buffer full threshold, size must greater than or equal to radar descriptors</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADAR_RX_EN</name>
              <description>enable for getting radar rpt from BB. When set to 0, will not rx radar rpt from bb</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MONOSENSE_RX_EN</name>
              <description>enable for getting monosense from BB. When set to 0, will not rx monosense</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSIBUF_ENDADDR</name>
              <description>rxcsibuffer boundary, default is 1K bytes</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSIBUF_THRESHOD</name>
              <description>rxcsibuffer full threshold, size must greater than or equal to csi descriptors</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CHINFO_TRIG_TYPE0</name>
          <addressOffset>0x000006F8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_CTRL_TRIG15En</name>
              <description>When set, frames with type=01 and subtype=1111 will triggerchannel info.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG14En</name>
              <description>When set, frames with type=01 and subtype=1110 will triggerchannel info.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG13En</name>
              <description>When set, frames with type=01 and subtype=1101 will triggerchannel info.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG12En</name>
              <description>When set, frames with type=01 and subtype=1100 will triggerchannel info.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG11En</name>
              <description>When set, frames with type=01 and subtype=1011 will triggerchannel info.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG10En</name>
              <description>When set, frames with type=01 and subtype=1010 will triggerchannel info.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG9En</name>
              <description>When set, frames with type=01 and subtype=1001 will triggerchannel info.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG8En</name>
              <description>When set, frames with type=01 and subtype=1000 will triggerchannel info.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG7En</name>
              <description>When set, frames with type=01 and subtype=0111 will triggerchannel info.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG6En</name>
              <description>When set, frames with type=01 and subtype=0110 will triggerchannel info.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG5En</name>
              <description>When set, frames with type=01 and subtype=0101 will triggerchannel info.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG4En</name>
              <description>When set, frames with type=01 and subtype=0100 will triggerchannel info.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG3En</name>
              <description>When set, frames with type=01 and subtype=0011 will triggerchannel info.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG2En</name>
              <description>When set, frames with type=01 and subtype=0010 will triggerchannel info.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG1En</name>
              <description>When set, frames with type=01 and subtype=0001 will triggerchannel info.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CTRL_TRIG0En</name>
              <description>When set, frames with type=01 and subtype=0000 will triggerchannel info.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG15En</name>
              <description>When set, frames with type=00 and subtype=1111 will triggerchannel info.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG14En</name>
              <description>When set, frames with type=00 and subtype=1110 will triggerchannel info.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG13En</name>
              <description>When set, frames with type=00 and subtype=1101 will triggerchannel info.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG12En</name>
              <description>When set, frames with type=00 and subtype=1100 will triggerchannel info.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG11En</name>
              <description>When set, frames with type=00 and subtype=1011 will triggerchannel info.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG10En</name>
              <description>When set, frames with type=00 and subtype=1010 will triggerchannel info.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG9En</name>
              <description>When set, frames with type=00 and subtype=1001 will triggerchannel info.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG8En</name>
              <description>When set, frames with type=00 and subtype=1000 will triggerchannel info.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG7En</name>
              <description>When set, frames with type=00 and subtype=0111 will triggerchannel info.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG6En</name>
              <description>When set, frames with type=00 and subtype=0110 will triggerchannel info.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG5En</name>
              <description>When set, frames with type=00 and subtype=0101 will triggerchannel info.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG4En</name>
              <description>When set, frames with type=00 and subtype=0100 will triggerchannel info.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG3En</name>
              <description>When set, frames with type=00 and subtype=0011 will triggerchannel info.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG2En</name>
              <description>When set, frames with type=00 and subtype=0010 will triggerchannel info.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG1En</name>
              <description>When set, frames with type=00 and subtype=0001 will triggerchannel info.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MGT_TRIG0En</name>
              <description>When set, frames with type=00 and subtype=0000 will triggerchannel info.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CHINFO_TRIG_TYPE1</name>
          <addressOffset>0x000006FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_DATA_TRIG15En</name>
              <description>When set, frames with type=10 and subtype=1111 will triggerchannel info.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG14En</name>
              <description>When set, frames with type=10 and subtype=1110 will triggerchannel info.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG13En</name>
              <description>When set, frames with type=10 and subtype=1101 will triggerchannel info.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG12En</name>
              <description>When set, frames with type=10 and subtype=1100 will triggerchannel info.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG11En</name>
              <description>When set, frames with type=10 and subtype=1011 will triggerchannel info.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG10En</name>
              <description>When set, frames with type=10 and subtype=1010 will triggerchannel info.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG9En</name>
              <description>When set, frames with type=10 and subtype=1001 will triggerchannel info.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG8En</name>
              <description>When set, frames with type=10 and subtype=1000 will triggerchannel info.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG7En</name>
              <description>When set, frames with type=10 and subtype=0111 will triggerchannel info.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG6En</name>
              <description>When set, frames with type=10 and subtype=0110 will triggerchannel info.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG5En</name>
              <description>When set, frames with type=10 and subtype=0101 will triggerchannel info.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG4En</name>
              <description>When set, frames with type=10 and subtype=0100 will triggerchannel info.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG3En</name>
              <description>When set, frames with type=10 and subtype=0011 will triggerchannel info.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG2En</name>
              <description>When set, frames with type=10 and subtype=0010 will triggerchannel info.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG1En</name>
              <description>When set, frames with type=10 and subtype=0001 will triggerchannel info.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DATA_TRIG0En</name>
              <description>When set, frames with type=10 and subtype=0000 will triggerchannel info.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
