Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WMAC_PAGE7</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x000007F0</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000007F0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_MACID1</name>
          <addressOffset>0x00000700</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_MACID1_L</name>
              <description>MAC Identification Number Register for port 1. relay mode as soft ap macid</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACID1_1</name>
          <addressOffset>0x00000704</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_MACID1_H</name>
              <description>MAC Identification Number Register for port 1. relay mode as soft ap macid</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_FSM_RESET</name>
          <addressOffset>0x00000708</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACRX_RST</name>
              <description>write 1 to RESET FSM of macrx</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MACTX_CTL_RST</name>
              <description>write 1 to RESET FSM of mactx_ctl</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>LPS_CTRL_POFF_RST</name>
              <description>write 1 to RESET FSM of wmac_tlps_ctrl_poff</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TRXPTCL_RXTRIG_RST</name>
              <description>write 1 to RESET FSM of wmac_trxptcl_rxtig</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TRXPTCL_TXCTL_RST</name>
              <description>write 1 to RESET FSM of wmac_trxptcl_txctl</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TRXPTCL_RESP_RST</name>
              <description>write 1 to RESET FSM of wmac_trxptcl_resp</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CLM_NLM</name>
          <addressOffset>0x0000070C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCA_IDUNMATCH_CNT</name>
              <description>not my packet counter</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IDUNMATCH_CNT_CLR</name>
              <description>write 1 to reset cca_idunmatch_cnt</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MACID_STATIC_SEL</name>
              <description>1:statistic a1 match packet;0:statistic a1 match packet,my bss bc and mc packet</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACID2</name>
          <addressOffset>0x00000710</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_MACID2_L</name>
              <description>MAC Identification Number Register for port 2.
relay mode, enable r_P2_WTNAP, as relay ap addr</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACID2_1</name>
          <addressOffset>0x00000714</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_MACID2_H</name>
              <description>MAC Identification Number Register for port 2
relay mode, enable r_P2_WTNAP, as relay ap addr</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SND_PTCL_CTRL</name>
          <addressOffset>0x00000718</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x42000080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_NDP_TIMER</name>
              <description>A timeout value for MAC to leave NDP_Rx_standby_state and go back to normal Rx mode. (unit: 2us)</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CHK_RPTPOLL_A2_DIS</name>
              <description>1: For any A1-matched BF Rpt Poll, send back VHT-CB
0: If A1-matched BF Rpt Poll's A2 fails to match the previous receiving NDPA's A2, do not send VHT-CB</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CSI_CHKSUM_DIS</name>
              <description>1:Disable check 16bit checksum value of csi report from BB 
 0:Enable check 16bit checksum value of csi report from BB</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_USE_NSTS</name>
              <description>1: use Nsts as Nr, 0: use register value as Nr</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_VHT_PLCP_CHK</name>
              <description>[6]:1: disable check vhtsigb crc
[5]:1: disable check vhtsiga crc</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_HT_NDPA_EN</name>
              <description>Set to 1, MAC would inform BB of preparing to receive NDP if the received NDP Announcement MPDU is valid.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_VHT_NDPA_EN</name>
              <description>Set to 1, MAC would inform BB of preparing to receive NDP if the received NDPA is valid.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BEAMFORM_STATUS</name>
          <addressOffset>0x0000071C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_CHECK_SOUNDING_SEQ</name>
              <description>Set to 1,MAC would check sounding sequence number of received CSI report 
and transmitted NDPA</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ZB_STATISTIC_0</name>
          <addressOffset>0x00000720</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATIS_ZB_RSTB</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ZB_STATISTIC_1</name>
          <addressOffset>0x00000724</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATIS_ZG_L</name>
              <description>for statistic</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ZB_STATISTIC_2</name>
          <addressOffset>0x00000728</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATIS_ZG_H</name>
              <description>for statistic</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ZB_COEX_TABLE_1</name>
          <addressOffset>0x00000740</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZB_COEX_TABLE_1</name>
              <description>coexistence table between WLAN and Zigbee, 
selected by BIT_COEX_TABLE_SEL = 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ZB_COEX_TABLE_2</name>
          <addressOffset>0x00000744</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZB_COEX_TABLE_2</name>
              <description>coexistence table between WLAN and Zigbee, 
selected by BIT_COEX_TABLE_SEL = 1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ZB_BREAK_TABLE</name>
          <addressOffset>0x00000748</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZB_BREAK_TABLE_H</name>
              <description>Table used to break ZB activity, when new WLAN request is coming and ZB is on transmitting or receiving</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZB_BREAK_TABLE_L</name>
              <description>Table used to break WLAN activity, when new ZB request is coming and WLAN is on transmitting or receiving</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_EXT_ZB_DETEC_CTRL</name>
          <addressOffset>0x0000074C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x40C80000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZB_TRX_DETECT</name>
              <description>Valid if BIT_ZIGBEE_MODE = 1 &amp; BIT_EXT_ZIGBEE_MODE = 0 (external mode, directional PRIORITY) 
After ZB_PRI_DETECT_TIME duration, if ZB_PRIORITY is low or goes low during ZB_TRX_INIT_DETECT_TIME, Zigbee will receive packets; otherwise, if ZG_PRIORITY is high or goes high, ZB will TX data. Unit 1us.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZB_PRI_DETECT</name>
              <description>Valid if BIT_ZIGBEE_MODE = 1 &amp; BIT_EXT_ZIGBEE_MODE = 0 (external mode, directional PRIORITY) 
After ZB_REQUEST asserting, if ZG_PRIORITY is asserted within this ZB_PRI_DETECT_TIME duration, ZG will initiate high priority activities; otherwise, if ZB_PRIORITY is not asserted within this duration, it would be low priority activities. Units 1us. (0-255us)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZB_CNT_THR</name>
              <description>ZB count threshold, unit: us</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZB_ARB_TIME</name>
              <description>8 bit timer register : Arbitration window of ZB trx request (unit: us)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RADAR_COEX</name>
          <addressOffset>0x00000758</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADAR_BT_COEX_TABLE</name>
              <description>COEX table of radar &amp; BT, radar force wl_tx = 1, wl_pri = 1</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADAR_BT_BREAK_TABLE</name>
              <description>BREAK table of radar &amp; BT, radar force wl_tx = 1, wl_pri = 1</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADAR_ZB_COEX_TABLE</name>
              <description>COEX table of radar &amp; ZB, radar force wl_tx = 1, wl_pri = 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADAR_ZB_BREAK_TABLE</name>
              <description>BREAK table of radar &amp; ZB, radar force wl_tx = 1, wl_pri = 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_COEX_SW_CFG</name>
          <addressOffset>0x0000075C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GNT_WL_RX_SW</name>
              <description>SW control GNT_WL_RX</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_WL_RX_SW_EN</name>
              <description>SW control GNT_WL_RX enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_WL_TX_SW</name>
              <description>SW control GNT_WL_TX</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_WL_TX_SW_EN</name>
              <description>SW control GNT_WL_TX enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_WL_SW</name>
              <description>SW control GNT_WL</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_WL_SW_EN</name>
              <description>SW control GNT_WL enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_WL_RFC_SW</name>
              <description>SW control GNT_WL_RFC</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_WL_RFC_SW_EN</name>
              <description>SW control GNT_WL_RFC enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_RADAR_SW</name>
              <description>SW control GNT_RADAR</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_RADAR_SW_EN</name>
              <description>SW control GNT_RADAR enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_RADAR_RFC_SW</name>
              <description>SW control GNT_RADAR_RFC</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_RADAR_RFC_SW_EN</name>
              <description>SW control GNT_RADAR_RFC enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_RX_SW</name>
              <description>SW control GNT_BT_RX</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_RX_SW_EN</name>
              <description>SW control GNT_BT_RX enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_TX_SW</name>
              <description>SW control GNT_BT_TX</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_TX_SW_EN</name>
              <description>SW control GNT_BT_TX enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_AFE_SW</name>
              <description>SW control BT AFE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_AFE_SW_EN</name>
              <description>SW control BT AFE enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_SWAES_CFG</name>
          <addressOffset>0x00000760</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BTCOEX_SW_RST</name>
              <description></description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BOTH_POL</name>
              <description>grant both choose GNT_BT  polarity:
0 : deassert GNT_BT  signal as PTA grant both WiFI and BT.
1 : assert GNT_BT signal as PTA grant both WiFi and BT.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_ARB_INST_EN</name>
              <description>1: enable GNT_BT_BYPASS_PRIORITY 
0 : disable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_ARB_TIME</name>
              <description>8 bit timer register : Arbitration window of bt trx request ( in the unit of us)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
