Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_BT_COEX_ENH</name>
          <addressOffset>0x00000764</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x1803DE00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZIGBEE_EN</name>
              <description>Enable ZigBee function</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZIGBEE_MODE</name>
              <description>0: SOC
1: external</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_ZIGBEE_MODE</name>
              <description>The mode of external ZigBee
1: static PRIORITY
0: directional PRIORITY</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_TABLE_SEL</name>
              <description>Select coexistence table for WLAN &amp; ZB
0: BIT_COEX_TABLE_WL_ZB_1
1: BIT_COEX_TABLE_WL_ZB_2</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_ZB_GNT_POLAR</name>
              <description>Select the polar of ZB_GRANT, for extarnal ZB
0: low active
1: high active</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZB_ARB_INST_EN</name>
              <description>1: enable the time limit of ZigBee request (zb_pri | zb_rx | zb_tx), PTA is valid during ( &lt;=BIT_ZB_ARB_TIME)
0: disable 
Co-work with BIT_ZB_ARB_TIME</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZB_CNT_THREN</name>
              <description>ZB count threshold enable, for statistics
co-work with BIT_ZB_CNT_THR</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZB_STATISTIC_EN</name>
              <description>enable statistic of ZB</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_ZB_BB_SW_EN</name>
              <description>Enable SW control gnt_zb_bb</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_ZB_BB_SW</name>
              <description>SW value</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_ZB_RFC_SW_EN</name>
              <description>Enable SW control gnt_zb_rfc</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_ZB_RFC_SW</name>
              <description>SW value</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_ZB_EXT_SW_EN</name>
              <description>Enable SW control gnt_zb_o of external ZigBee</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_ZB_EXT_SW</name>
              <description>SW value,  external ZigBee</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_ZB_REQ_POLAR</name>
              <description>Select the polar of ZB_REQUEST, for static mode external ZB
0: low active
1: high active</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_BT_DONT_CARE</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_ZB_DONT_CARE</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BTG_LNA1_GAIN_SEL</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_RFC_SW</name>
              <description>SW control BT RF</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_RFC_SW_EN</name>
              <description>SW control BT RF enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_BB_SW</name>
              <description>SW control BT baseband</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GNT_BT_BB_SW_EN</name>
              <description>SW control BT baseband enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_CNT_THREN</name>
              <description>BT count threshold enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_CNT_THR</name>
              <description>BT count threshold</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WLAN_ACT_MASK_CTRL</name>
          <addressOffset>0x00000768</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTA_GNT_INFO</name>
              <description>[0]: gnt_wl
[1]: gnt_bt_bb
[2]: gnt_bt_rfc
[3]: gnt_zb_bb
[4]: gnt_zb_rfc
[5]: gnt_wl_tx
[6]: gnt_wl_rx
[7]: gnt_bt_tx
[8]: gnt_bt_rx
[9]: gnt_bt_afe
[10]: gnt_wl_rfc
[11]: gnt_radar
[12]: gnt_radar_rfc</description>
              <bitRange>[31:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WLAN_ACT_MASK_CTRL_L</name>
              <description>[15:8]: WLAN will reserve channel for BT during MASK OFF duration. Unit 0.625ms
[7:0]: WLAN can block BT during MASK On duration. Unit 0.625ms</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WLAN_ACT_MASK_CTRL_1</name>
          <addressOffset>0x0000076C</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATIS_BT_RSTB</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>WLRX_TER_BY_CTL</name>
              <description>When wlan receive a control packet without fit address, whether the signal indicating wlan rx can be terminated as soon as the address check finish is not only controlled by r_WLRX_TER_BY_AD, but also should be refereed to this bit. 
1: enable; 0: disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLRX_TER_BY_AD</name>
              <description>When wlan receive the packet without fit address, the signal indicating wlan rx can be terminated as soon as the address check finish. This feature can be enabled by this bit. 
1: en</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLAN_ACT_MASK_CTRL_H</name>
              <description>[9]: Antenna diversity for 2 antenna mode: MAC_ANT_SEL = GNT_BT ^ ANT_DIVERDITY_SEL
[8]: Enable the control of antenna selection through GNT_BT:GNT_BT=1: ANT_SEL for BT device; GNT_BT=0: ANT_SEL for WL device.
[7:3]:RSVD
[2]:When WLACT_LOW_GNTWL_EN = 1, the TRX of WLAN are blocked according to the BTCOEX table arbitration during MASK OFF duration. WLACT_LOW_GNTWL_EN = 0, the TRX of WLAN are paused during MASK OFF duration..
[1]:When WLACT_HIGH_GNTBT_EN = 1, the TRX of WLAN are blocked according to the BTCOEX table arbitration during MASK ON duration. When WLACT_HIGH_ GNTBT_EN = 0, the TRX of WLAN are not paused during MASK OFF duration.
[0]:When NAV update is beyond this value, then NAV update is aborted. When this field is 0x00, NAV_UPPER function is disable. The unit is 128us.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_COEX_ENHANCED_INTR_CTRL</name>
          <addressOffset>0x0000076E</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_STAT_DELAY</name>
              <description>For CSR, BT_PRI and BT_STAT go high form low at the same time. Thus, BT_STAT
 need delay BT_STAT_DELAY time to trigger hardware. Unit: 1us</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_TRX_INIT_DETECT</name>
              <description>After BT_PRI asserting for BT_TRX_INIT_DETECT us, 
if BT_STAT is low, then BT will receive packets; otherwise, if BT goes high, BT will TX data. Unit 4us.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_PRI_DETECT_TO</name>
              <description>After BT_PRI asserting, if BT_STAT is asserted within this TO duration, BT will initiate high priority activities; otherwise, if BT_STAT is not asserted within this duration, it would be low priority activities. Units 1us.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GRANTALL_WLMASK</name>
              <description>grant all mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATIS_BT_EN</name>
              <description>When this bit is set, the BT_ACT_STATISTICS counters starts counting</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_WL_ACT_MASK</name>
              <description>Enable WLAN_ACT Mask Function (related to 0x768h-0x76Dh)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENHBT</name>
              <description>Enable Enhanced BT Interface (we suggest to use with BT mode 2)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_ENHANCED_CTRL0</name>
          <addressOffset>0x00000770</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATIS_BT0</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_ENHANCED_CTRL1</name>
          <addressOffset>0x00000774</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATIS_BT1</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_PROPRI</name>
          <addressOffset>0x00000778</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_CMD_RPT</name>
              <description></description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RPT_FROM_BT</name>
              <description></description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_PROPRI</name>
              <description>[7:6]: When EN_BT_PROFILE_OR_HID is set "1", hardware also need to checkthis value to trigger an interrupt.
0: default, TX and RX; 1: TX; 2: RX; 3: Reserved
[5]: When the control of TDMA mode is firmware and firmware also receive signal that NULL packet for BT had sent, firmware can fill this bit to notify HW PTA to pull WLAN_ACT to low and the interval is Tbt
[4]: 0: default, PTA TDMA mode is hardware mode. 1: enable firmware mode.
[3]:0: default, disable PTA TDMA mode; 1: enable TDMA mode:
a. WLAN_ACT default is high.
b. Hardware mode:
When NULL packet for BT had sent, hardware will notify PTA to start
TDMA mode.
Firmware mode:
When NULL packet for BT had sent, hardware will trigger an interrupt to
notify firmware. Then, firmware need to set TDMA_BT_START_NOTIFY
to notify PTA to start TDMA mode
[2]: 0: default, no matter which WLAN_ACT is high or low, PTA doesn't execute co-exist table scheme; 1: enable, When WLAN_ACT is high, PTA execute xo-exist table scheme
[1]: Enable GPIO2 and GPIO3 exchange. (Note: need to enable mode2 and enhance 3 wire) If Enable RTK BT mode, set this bit to 1 to disable granting to BT device when arbitration
[0]: Enable RTK BT mode</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_Status_Report_Register</name>
          <addressOffset>0x0000077C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_PROFILE</name>
              <description>When WLAN received CMD_ID 0x3, it will recorder to this.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_POWER</name>
              <description>When WLAN received CMD_ID 0x2, it will recorder to this</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_PRETECT_STATUS</name>
              <description>When WLAN received CMD_ID 0x0, it will recorder to this</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_INFO</name>
              <description>command information from BT</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_Interrupt_Control_Register</name>
          <addressOffset>0x00000780</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_FUNC_EN</name>
              <description>[31]: When firmware had prepared packet to send to BT, it need to set this bit to notify hardware that it can transmit.
0: There isn't a valid packet in register" WLAN_RPT_ PKT".
1: There is a valid packet in register" WLAN_RPT_ PKT".
[30]: Enable two interrupt:1) PTA sent the report packet successfully; 2) PTA sent a query packet
0: Disable
1: Enable
[29]: When MAC had sent NULL packet for BT and firmware also set nav_for_bt bit, hardware triggers an interrupt to notify firmware.
0: Disable
1: Enable
[28]: When WLAN receive cmd_id "0", hardware trigger an interrupt to notify firmware.
0: Disable
1: Enable
[27]: When WLAN received the packet including BT Power and check register "BT_STATUS_RPT", if data contents aren't the same, hardware can trigger an interrupt to notify firmware.
0: Disable
1: Enable
[26]: When WLAN received the packet including BT channel number, hardware can trigger an interrupt to notify firmware.
0: Disable
1: Enable
[25]: When WLAN received the packet including that BT had multi-slots, hardware can trigger an interrupt to notify firmware.
0: Disable
1: Enable</description>
              <bitRange>[31:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLAN_RPT_NOTIFY</name>
              <description>[24]:Enable two interrupt 1) When WLAN received the packet including that WLAN specific profile and check register "BT_STATUS_RPT", if data contents aren't the same, hardware can trigger an interrupt to notify firmware.
2) When WLAN received the report packet including HID information, hardware will trigger an interrupt to notify firmware.
0: Disable
1: Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLAN_RPT_DATA</name>
              <description>Data contents, When the report packet had sent, hardware will clear this
register.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO_BT_CMDID</name>
              <description>Command id: 0x80~FF</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_DATA</name>
              <description>When WLAN received the packet BT sent, hardware will place data to this register in addition to CMD_ID 0x0 ~ 0x3.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WLAN_Report_Time_Out_Control_Register</name>
          <addressOffset>0x00000784</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHAN_TABLE0</name>
              <description>0: leave PTA
1: enter PTA</description>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO_EN</name>
              <description>Isolation table enable bit.
0: disable
1: enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_RPT_TO</name>
              <description>When WLANＨW received query packet, HW timer counts. If timer equals
to WLAN_RPT_TO and HW can"t send packet, it will give up query packet
at this time. When BT sent another query packet, WLAN HW need to send
the previous packet and it shouldn't trigger an interrupt to firmware. Unit:
4us.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_Isolation_Table_Register_Register_1</name>
          <addressOffset>0x00000788</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHAN_TABLE1</name>
              <description>0: leave PTA
1: enter PTA</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
