Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_BT_Isolation_Table_Register_Register_2</name>
          <addressOffset>0x0000078C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_ISR_STS7</name>
              <description>When WLAN received the report packet including HID information, hardware will trigger an interrupt to notify firmware</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_ISR_STS6</name>
              <description>When WLAN received a query packet, hardware triggers an interrupt to notify firmware</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_ISR_STS5</name>
              <description>When MAC had sent NULL packet for BT and firmware also set nav_for_bt bit, hardware triggers an interrupt to notify firmware</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_ISR_STS4</name>
              <description>When PTA sent the report packet successfully, hardware triggers an interrupt to notify firmware.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_ISR_STS3</name>
              <description>When WLAN received the packet including BT Power and check register "BT_STATUS_RPT", if data contents aren't the same, hardware can trigger an interrupt to notify firmware</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_ISR_STS2</name>
              <description>When WLAN received the packet including BT channel number, hardware can trigger an interrupt to notify firmware.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_ISR_STS1</name>
              <description>When WLAN received the packet including that BT had multi-slots, hardware can trigger an interrupt to notify firmware</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_ISR_STS0</name>
              <description>When WLAN received the packet including that WLAN specific profile and check register "BT_STATUS_RPT", if data contents aren't the same, hardware can trigger an interrupt to notify firmware.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHAN_TABLE2</name>
              <description>0: leave PTA
1: enter PTA</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_TDMA_Time_Register</name>
          <addressOffset>0x00000790</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_TIME</name>
              <description>[31:6]: The time is that WLAN_ACT is low. Unit: us
[5:0]: When wifi detected the raising edge of BT report packet, wifi need to counter BT_RPT_SAMPLE_RATE. Then hw could detect which is high or low. Uint: 20 ns</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BT_ACT_Register</name>
          <addressOffset>0x00000794</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_BLE_EN</name>
              <description>Decide the GNT_BT_TX / RX 
0: GNT_BT_TX = GNT_BT &amp; BT_TX ;  GNT_BT_RX = GNT_BT &amp; BT_RX
1: GNT_BT_TX = GNT_BT &amp; (BT_TX | BT_BLE) ;  GNT_BT_RX = GNT_BT &amp; (BT_RX | BT_BLE)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_EISR_EN</name>
              <description>BT eisr enable</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_EISR_STS7</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_EISR_STS6</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_EISR_STS5</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_EISR_STS4</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_EISR_STS3</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_EISR_STS2</name>
              <description>[10]: When BT_ACT signal is falling edge, it will trigger an interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_EISR_STS1</name>
              <description>[9]: When BT_ACT signal is raising edge, it will trigger an interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_EISR_STS0</name>
              <description>[8]: When BT_TIME expired, it will trigger an interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_CH</name>
              <description>When hardware receive cm_id "1", it will recorder to this.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_VENDOR_CFG</name>
          <addressOffset>0x000007A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_VENDOR_ADV_EN</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_VENDOR_ADV_EN</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_OPT_SIG2</name>
              <description></description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_OPT_SIG1</name>
              <description></description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_INI_SIG</name>
              <description></description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_VENDOR_TSFT_CTL</name>
          <addressOffset>0x000007A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_VENDOR_TSFT_EN</name>
              <description>vendor tsft emable for rx</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_VENDOR_NS_OFFSET</name>
              <description>vendor ns offset for rx</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_VENDOR_TSFT_EN</name>
              <description>vendor tsft emable for tx</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_VENDOR_NS_OFFSET</name>
              <description>vendor ns offset for tx</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TCR_TSFT_OFS</name>
          <addressOffset>0x000007B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_TCR_TSFT_NS_OFS</name>
              <description>tcr_tsft_ns_ofs</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ANTTRN_CTR_1_V1</name>
          <addressOffset>0x000007B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APPEND_MACID_IN_RESP_EN</name>
              <description>Whether to append MACID in the rx descriptor of rx response packet</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTTRN_ENABLE</name>
              <description>Enable the antenna training function</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_IQ_DUMP</name>
          <addressOffset>0x000007C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_IQD_WROVER</name>
              <description></description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DUMP_ADDR_LATCH</name>
              <description></description>
              <bitRange>[30:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MACDBG_TRIG_IQDUMP</name>
              <description>Enable dump bb ADC signal trigger from MAC debug port which controled by r_LEVEL_PULSE_SEL.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_TIME_SEL</name>
              <description>dump ok time to finish dump signal(unit is 1us)</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_TRIG_REG</name>
              <description>dump bb ADC sel mac strigger even
write this reg to 1 to trig dump finish</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LEVEL_PULSE_SEL</name>
              <description>if dump bb ADC signal :
[3] for sel mac trigger event
if dump mac dbg signal
[4:3] : 2'b00 : level signal match
[4:3] : 2'b01 : posedge match
[4:3] : 2'b10 : negdge match</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_LA_MAC</name>
              <description>enable dump mac dbg signal</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_IQDUMP</name>
              <description>enable dump bb ADC signal</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IQDATA_DUMP</name>
              <description>enable data dump for txpktbuffer high 64K</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MASK_LA_MAC</name>
          <addressOffset>0x000007C4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_MASK_LA_MAC</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MATCH_REF_MAC</name>
          <addressOffset>0x000007C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_MATCH_REF_MAC</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_FTM_CTL</name>
          <addressOffset>0x000007CC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL_DEBUG_DATA</name>
              <description></description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TIMEOUT</name>
              <description>Set this bit to 1 to reset mdpk read pointer</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_RE_START</name>
              <description>Before setting 0x7C0[1:0] =2'b11, set this bit to 1 to enable MDPK access mode</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LA_MAC_TIMEOUT_UNIT_SEL</name>
              <description>LA mode triggered by mac debug port timeout value unit selection.
2'b00: 1us, 2'b01:32us, 2'b10: 1ms, 2'b11:RSVD</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LA_MAC_TIMEOUT_VALUE</name>
              <description>LA mode triggered by mac debug port timeout value, available with non-zero value.</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LEVEL_PULSE_SEL_EXT</name>
              <description>LA mode triggered by mac debug port timeout event</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_TIME_UNIT_SEL</name>
              <description>Select trigger time unit of 0x7C0[14:8].
3'b000 : 1us , 3'b001 : 2us ,  3'b010 : 4us , 
3'b011 : 8us , 3'b100 : 16us ,  3'b101 : 32us ,
3'b110 : 64us, 3'b111 : RSV</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TXD_DEBUG</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_RXD_DEBUG</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRX_TRIG_SEL_DEBUG</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRX_TRIG_SEL_PATT</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_IQD_LEN_BREAK</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IQD_LENGTH_REF</name>
              <description></description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRX_TRIG_SEL_WMAC</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXFTM_TXACK_SC</name>
              <description>When HW receive FTM pkt, HW will use RX FTM BW as response ACK TXBW.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXFTM_TXACK_BWEQ</name>
              <description>When HW receive FTM pkt, HW will use RX FTM SC as response ACK TXSC.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXFTM_EN</name>
              <description>If BIT_FTM_TYPE = 1 &amp;&amp; BIT_RXFTM_EN=1, 
 HW will parsing rx packet, to find FTM request frame.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXFTM_BYDRV</name>
              <description>If set this bit to 1,Rx FTMREQ/FTM can be receive into rxpktbuffer.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXFTMREQ_EN</name>
              <description>If BIT_FTM_TYPE = 1 &amp;&amp; BIT_RXFTMREQ_EN=1,
 HW will parsing rx packet, to find FTM request frame.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_FTM_FUNC_EN</name>
              <description>Fine timing measurement function; 0: Disable 1:enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_TRIG_SEL</name>
          <addressOffset>0x000007D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRIG_STOP_MAC</name>
              <description>during TXD_DEBUG or RXD_DEBUG mode, set CR 0-&gt;1 will trig iqdump stop</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_TRIG_SEL</name>
              <description>dump bb ADC sel mac strigger even
2'b00 : rxpkt ok trig dump ok
2'b01 : rxpkt_fauil trig dump ok
2'b10 : rxpkt cca rise edge to trig dump ok
2'b11: rx type match</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
