Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_WMAC_OPTION_FUNCTION_1</name>
          <addressOffset>0x000007D4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0080A000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_RXFIFO_FULL_TH</name>
              <description>csi buffer full window size</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RX_SYNCFIFO_SYNC</name>
              <description></description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DELIM_CHKREJ</name>
              <description>1:state is delim check rx error to jump to error state
0:state is delim check rx_error_to_end to jump to error state</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SRCH_TXRPT_REF_DROP</name>
              <description>when this bit is set 1, reference macid drop information when macid search</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SRCH_TXRPT_PERPKT</name>
              <description>enable search txrpt buffer for macid every pkt</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SRCH_TXRPT_MID</name>
              <description>enable search txrpt buffer for macid</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_PFIN_TOEN</name>
              <description>rx fifo fsm flush state timeout to error stage</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_FIL_SECERR</name>
              <description>sec len error drop(sec len is zero)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_FIL_CTLPKTLEN</name>
              <description>drop the rx pkt if the rx ctrl pkt len large than r_WMAC_RX_FIL_LEN</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_FIL_FCTYPE</name>
              <description>drop the ofdm pkt if the rx ofdm leg pkt fc type is 2'b11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_FIL_FCPROVER</name>
              <description>drop the ofdm pkt if the rx ofdm leg pkt fc version illegal</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TCR_MPAR_NDP</name>
              <description>nop ok check bb ndp vld &amp; mac rx ndp check ok</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RX_FILTER_FUNCTION</name>
          <addressOffset>0x000007D8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x10000041</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_RXHANG_EN</name>
              <description>Force read error content from fifo to solve rxhang.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MHRDDY_LATCH</name>
              <description>enable mac header ready latch when state is not wait fcs or error</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MHRDDY_CLR</name>
              <description>enable mac header start to clear mac header ready latch signal</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPKTCTL_FSM_BASED_MPDURDY1</name>
              <description>Adjust mpdu_rdy timing to solve FSM behavier error.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_DIS_VHT_PLCP_CHK_MU</name>
              <description>Disable check sigb crc value of MU plcp header.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHK_DELIMIT_LEN</name>
              <description>Drop mpdu if delimeter mpdu length smaller than mac header length + 4.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPKTCTL_FSM_BASED_MPDURDY</name>
              <description>when this bit is set 1, rxpktfifo_ctl FSM jumps based on mpdu_valid(all MPDU data has been transferred to rxpktbuffer), when this bit is set 0, rxpktfifo_ctl FSM jumps based on fcs_valid(all MPDU data has been parsed by rx_parser)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXFIL_FEND</name>
              <description>when this bit set 1,icvmic_valid signal is cleared when icvmic_rdy is valid(ICV/MIC is parsed)</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MPDURDY_CLR</name>
              <description>when the bit is set 1,  the last MPDU which will be transferred to rxpktfifo is ready and error occurs, mpdu_rdy signal is also valid(is means all MPDU data has been transferred to rxpktbuffer)</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYSTS_RPT_ONCE</name>
              <description>keep original physts rx design, only use the last physts (rx after data_on fall).</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOT_WAIT_LAST_PHYSTS</name>
              <description>last mpdu don't wait last physts, use the current physts in  physts buffer</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXFIL_FCSE</name>
              <description>If rx pkt is not ampdu and rejected, 
reset rxpkt_ctl FSM immediately after parsing header</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXFIL_MESH_DEL</name>
              <description>drop the ofdm pkt if the rx ofdm leg pkt fc type is 2'b11</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RXFIL_LEN</name>
              <description>use with 0x7D4[12]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_OPTION_FUNCTION_3</name>
          <addressOffset>0x000007E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x001845A5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_TXNDP_SIGB</name>
              <description>SIGB for NDP packet when BW =40MHz</description>
              <bitRange>[20:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_CMD_SEL</name>
          <addressOffset>0x000007E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAC_CMD_SHIFT</name>
              <description></description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_CMD_SEL</name>
              <description></description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WMAC_DBG_SHIFT</name>
          <addressOffset>0x000007E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACTX_CMD_SHIFT</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WSEC_OPTION</name>
          <addressOffset>0x000007EC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00180000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDEC_UNI_MGNT</name>
              <description>decryption enable of rx unicast management pkt, 0x680[3] shall also be set valid</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENC_UNI_MGNT</name>
              <description>encryption enable of tx unicast management pkt, 0x680[2] shall also be set valid</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SEC_MASKIV</name>
              <description>MASK IV[15:8] for GCMP security</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SEC_PN_SEL</name>
              <description>Security GCMP  header PN selection</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAPI_FC_NOMASK</name>
              <description></description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAPI_QC_NOMASK</name>
              <description></description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GCM_WAPI_FC_NOMASK</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY</name>
              <description>DUMMY</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
