Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WMAC_PAGE17</name>
      <groupName>WIFI</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>0x00001800</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG_TWT_BC_ID</name>
          <addressOffset>0x00001700</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BC_TWT_ID</name>
              <description>twt id bitmap, each bit corresponding to a ID value, only latch the report of valid twt id</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TWT_BC_RPT0</name>
          <addressOffset>0x00001704</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_BCN_TWT_PSR</name>
              <description>when set, enable beacon twt broadcast ie parser</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TWT_PERSISTENCE</name>
              <description>persistence value, if persistence value in TWT IE is smaller than the reg value, will latch the twt id report</description>
              <bitRange>[25:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TWT_RPT_0</name>
              <description>specified twt id report</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TWT_BC_RPT1</name>
          <addressOffset>0x00001708</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TWT_RPT_1</name>
              <description>specified twt id report</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_OPS_RPT_AND_N</name>
          <addressOffset>0x0000170C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBSSID_N_MEM</name>
              <description>multi-bssid n value</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OPS_DURATION_RPT</name>
              <description>ops frame duration field report</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RX_CFG</name>
          <addressOffset>0x00001710</addressOffset>
          <size>32</size>
          <description>rx configure register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_BSS_COLOR_DISABLED</name>
              <description>sw should set this bit when rx beacon from associated AP</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VHTNDPA_SUAID_0_EN</name>
              <description>when set, ndpa that sta info use 0 as aid will check as fit when rx vht/he ndpa</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MBA_RSVD_AID_EN</name>
              <description>when set, accept multi-sta ba tha use rsvd aid: 2045 in aid_tid_info as response, used in pre assocaition</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM_NO_HIT_REJECT</name>
              <description>when set, reject tim no hit beacon</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_CHK_HENDP_LEN</name>
              <description>disable check HE NDP lsig length value</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHK_MGNT_BSSID</name>
              <description>enable check port0 management frame bssid</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHK_CTL_BSSID</name>
              <description>enable check port0 control packet bssid,except ack and cts</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKBSSID_MGNT_P1</name>
              <description>enable check port1 management frame bssid</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKBSSID_CTL_P1</name>
              <description>enable check port1 control frame bssid</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKBSSID_DATA_P1</name>
              <description>enable check port1 data frame bssid</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKBSSID_NAN_P2</name>
              <description>enable check port2 bssid</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKBSSID_MGNT_P2</name>
              <description>when relay mode, enable check port2 management frame bssid</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTER_PPDU_REJECT</name>
              <description>enable reject inter ppdu</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_MACH_UPD_LEN</name>
              <description>enable macrx_pktfifo_ctl update mpdu length in MACHDR_CHK state</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFER_TB</name>
              <description>enable to receive TB PPDU for debug mode</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPSF_INTER_MPDU</name>
              <description>enable invalid packet check for inter ppdu, inter ppdu valid when plcp and mac header are inter bss</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUP_ADDR3_EN</name>
              <description>when set, enable check supper address3</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKBSSID_CTL_P2</name>
              <description>when relay mode, enable check port2 control frame bssid</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKBSSID_DATA_P2</name>
              <description>when relay mode, enable check port2 data frame bssid</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LA_EVENT_OPTION</name>
          <addressOffset>0x00001714</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LASTOP_FCS_ERROR</name>
              <description>stop LA record when continue fcs error&gt;= threshold
0:disable;1:4; 2:8;3:12</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LASTOP_RX_FSM_HANG</name>
              <description>stop LA record when RX FSM timeout</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LASTOP_PLCP_ERROR</name>
              <description>stop LA record when RX plcp error occur, include length error, parity error or crc8 error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LASTOP_RX_INCOMP</name>
              <description>stop LA record when RX content is incompleted, include PLCP or PSDU are incompleted</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AID</name>
          <addressOffset>0x00001718</addressOffset>
          <size>32</size>
          <description>aid register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AID11</name>
              <description>specified the aid of the sta that mactx response using all ack</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TRAN_BSSID0_L</name>
          <addressOffset>0x0000171C</addressOffset>
          <size>32</size>
          <description>trasmitted bssid register0_l</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_TRANSBSSID0_L</name>
              <description>lower 32 bits of transmitted bssid0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TRAN_BSSID0_H</name>
          <addressOffset>0x00001720</addressOffset>
          <size>32</size>
          <description>trasmitted bssid register0_h</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBSSID_IN_ORDER</name>
              <description>transbssid direct mask, not change order</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BSS_COLOR2</name>
              <description>bss color of current BSS of port1</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PARTAID</name>
              <description>enable inter ppdu decision according to partial aid for VHT ppdu</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_MBSSID</name>
              <description>enable multibssid function for transmitted bssid compare</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BSS_COLOR0</name>
              <description>bss color of current BSS of port0</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TRANSBSSID0_H</name>
              <description>higher 16 bits of transmitted bssid0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MAC_PHY_CONTROL</name>
          <addressOffset>0x00001724</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0007C3C9</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID_MATCH_MPDU</name>
              <description>when set, per mpdu will trigger rx_id_match, else per ppdu trigger</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID_MATCH_CNT</name>
              <description>rx macid match pulse counter, unit is mac clock</description>
              <bitRange>[20:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVALID_PKT_CNT</name>
              <description>invalid packet pulse counter, unit is mac clock</description>
              <bitRange>[13:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPKT_OK_FAIL_CNT</name>
              <description>rxpkt ok or fail pulse counter, unit is mac clock</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GID_POS_EN_l</name>
          <addressOffset>0x0000172C</addressOffset>
          <size>32</size>
          <description>VHT group id position enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GID_POSITION_EN_L</name>
              <description>VHT group id position enable</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GID_POS0</name>
          <addressOffset>0x00001730</addressOffset>
          <size>32</size>
          <description>VHT group id position0 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GID_POSITION0</name>
              <description>VHT group id position0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GID_POS1</name>
          <addressOffset>0x00001734</addressOffset>
          <size>32</size>
          <description>VHT group id position1 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GID_POSITION1</name>
              <description>VHT group id position1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GID_POS2</name>
          <addressOffset>0x00001738</addressOffset>
          <size>32</size>
          <description>VHT group id position2 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GID_POSITION2</name>
              <description>VHT group id position2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GID_POS3</name>
          <addressOffset>0x0000173C</addressOffset>
          <size>32</size>
          <description>VHT group id position3 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GID_POSITION3</name>
              <description>VHT group id position3</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BSSCOLOR_BITMAP_L</name>
          <addressOffset>0x00001740</addressOffset>
          <size>32</size>
          <description>bss color bitmap register_l</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BSSCOLOR_BITMAP_L</name>
              <description>low 32bits bss color bitmap</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BSSCOLOR_BITMAP_H</name>
          <addressOffset>0x00001744</addressOffset>
          <size>32</size>
          <description>bss color bitmap register_h</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BSSCOLOR_BITMAP_H</name>
              <description>high 32bits bss color bitmap</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PBSSID_BITMAP_L</name>
          <addressOffset>0x00001748</addressOffset>
          <size>32</size>
          <description>partial bssid bitmap register_l</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARTIAL_BSSID_BITMAP_L</name>
              <description>low 32bits partial bssid bitmap</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PBSSID_BITMAP_H</name>
          <addressOffset>0x0000174C</addressOffset>
          <size>32</size>
          <description>partial bssid bitmap register_h</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARTIAL_BSSID_BITMAP_H</name>
              <description>high 32bits partial bssid bitmap</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SR_CFG0</name>
          <addressOffset>0x00001750</addressOffset>
          <size>32</size>
          <description>spatial reuse configure register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPRUSE_RSVD_EN</name>
              <description>enable spatia reuse when plcp header spratial reuse field vaule smaller than 14 or value is 15 and is srg ppdu</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL_SRG_CHECK_EN</name>
              <description>enable control packet srg ppdu check</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRG_CHECK_EN</name>
              <description>enable srg ppdu check</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_EN</name>
              <description>enable spatial reuse function</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SR_CFG1</name>
          <addressOffset>0x00001754</addressOffset>
          <size>32</size>
          <description>spatial reuse configure register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NONSRG_OBSS_PD_MAX</name>
              <description>the maximum value of non_SRG OBSS_PD</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NONSRG_OBSS_PD_MIN</name>
              <description>the minimum value of non_SRG OBSS_PD</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRG_OBSS_PD_MAX</name>
              <description>the maximum value of OBSS_PD</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRG_OBSS_PD_MIN</name>
              <description>the minimum value of OBSS_PD</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACTX_SR</name>
          <addressOffset>0x00001758</addressOffset>
          <size>32</size>
          <description>SR field configure</description>
          <resetValue>0x00400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_WAIT_PHY_REF</name>
              <description>mactx hang handle,wait phytxon timeout</description>
              <bitRange>[23:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SR_FIELD_EN</name>
              <description>enable sr field reg cfg</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SR_VAL15_ALLOW</name>
              <description>sr field can be the value 15</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_PLCP_SR_FIELD</name>
              <description>value of SR field</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
