Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_MACTX_MISC</name>
          <addressOffset>0x0000175C</addressOffset>
          <size>32</size>
          <description>misc ctrl cfg</description>
          <resetValue>0x2C000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTIME_CAL_DISGCLK</name>
              <description>disable the clock gating of the txtime compute module</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CCK_LOCKED_CLK</name>
              <description>indicate that the transmit freuqency and symbol clocks are derived from the same oscilator</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_RST_BB_CNT</name>
              <description>macclk cycle number of wmac_rst_bb signal</description>
              <bitRange>[28:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_TXDFIFO_RDY</name>
              <description>sw read txd fifo ready</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_TXDFIFO_ADDR</name>
              <description>sw read txd fifo address,[6:1] is address, [0] : 0 read low 32bit; 1 read high 32bit;</description>
              <bitRange>[10:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_FORCE_READ_TXDFIFO</name>
              <description>during tx procedure, force read txd fifo, which is only use at the situation when bb is hang.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_SW_RD</name>
              <description>eanble sw read txdfifo</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOFPAD_EN</name>
              <description>enable eof pad operation at the end of mpdu</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACTX_MHDR0</name>
          <addressOffset>0x00001760</addressOffset>
          <size>32</size>
          <description>MAC header configure</description>
          <resetValue>0x6014D000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UPH_CAS_QOS_SEL</name>
              <description>HTC field UPH+CAS format enable,only work in tb_ppdu</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QNULL_ACK_POL_VAL</name>
              <description>ack policy bit of tb qos null</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_EN_HW_SSN</name>
              <description>enable the hw ssn for qos null frame</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TB_QOSNULL_PWRMGT_VAL</name>
              <description>the power bit in tb qos null, used during twt operation</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCR_BA_RSVD_VAL</name>
              <description>multi-sta BA bactl rsvd filed value</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QOS_NULL_TID_VAL</name>
              <description>tid value of qos null</description>
              <bitRange>[25:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_LEGACY_USTIMER</name>
              <description>timer cnt before bb fetch txd for ofdm, for underflow setting</description>
              <bitRange>[21:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_NON_LEGACY_USTIMER</name>
              <description>timer cnt before bb fetch txd for he/vht/ht/cck, for underflow setting</description>
              <bitRange>[16:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQR_PRIMCH</name>
              <description>shift bqr bitmap to the allocated primary 20M channel</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQR_TID_VAL</name>
              <description>bandwidth query report TID value</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BSR_QOS_SEL</name>
              <description>HTC field BSR format enable,only work in tb_ppdu</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BSR_VO_TID_SEL</name>
              <description>1: tid 7; 0: tid 6;</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BSR_VI_TID_SEL</name>
              <description>1: tid 5; 0: tid 4;</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BSR_BE_TID_SEL</name>
              <description>1: tid 2; 0: tid 1;</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BSR_BK_TID_SEL</name>
              <description>1: tid 3; 0: tid 0;</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MACTX_TXD_FIFO</name>
          <addressOffset>0x00001768</addressOffset>
          <size>32</size>
          <description>fifo do</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TXDFIFO_DOUT</name>
              <description>sw read rxd_out</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTRIG_TEST_COMM_0</name>
          <addressOffset>0x00001780</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTRIG_COMMON_0</name>
              <description>low 32bit of comm field in trigger frame of test mode</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTRIG_TEST_COMM_1</name>
          <addressOffset>0x00001784</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTRIG_COMMON_1</name>
              <description>high32bit of comm field in trigger frame of test mode</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTRIG_TEST_USER_0</name>
          <addressOffset>0x00001788</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTRIG_USERINFO_0</name>
              <description>low 32bit of user field in trigger frame of test mode</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTRIG_TEST_USER_1</name>
          <addressOffset>0x0000178C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTRIG_USERINFO_1</name>
              <description>high 32bit of user field in trigger frame of test mode</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTRIG_TEST_USER_2</name>
          <addressOffset>0x00001790</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTRIG_BSS_COLOR</name>
              <description></description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTRIG_MACID</name>
              <description>macid</description>
              <bitRange>[25:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTRIG_FCSCHK_EN</name>
              <description>1:enable fcs check</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTRIG_PORT_SEL</name>
              <description>port sel</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTRIG_EN</name>
              <description>enable rx trigger test mode</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXTRIG_USERINFO_2</name>
              <description>L</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTRIG_TEST_CTRL</name>
          <addressOffset>0x00001794</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTRIG_RU26_DIS</name>
              <description>disable response to trigger frame when ru allocation addressed to me is 26-tone</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UL_MU_DIS</name>
              <description>Disable to respond UL response triggered by any trigger frame. Per port config.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UL_MU_DATA_DIS</name>
              <description>Disable to respond UL data triggered by basic trigger frame. Per port config.
(BA/ACK/BSR/BQR are still allowed to Tx)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTRIG_DURATION</name>
              <description>duration of trigger frame</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTRIG_STATUS</name>
              <description>[7:4]:trig_cntr
[3:0]:ctl_state</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SIFS_TIMING_CTRL_CCK</name>
          <addressOffset>0x00001798</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00011846</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R2T_SIFS_CCK</name>
              <description>This register sets the SIFS time required for any immediate response for
example Data-Ack. It is in unit of 100ns.(default:7.5us)</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>T2T_SIFS_CCK</name>
              <description>This register sets the SIFS time required for consecutive TX events for
example CTS-Data, or broadcast bursting. It is in unit of 100ns.(default:7.5us)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SIFS_TIMING_CTRL_OFDM</name>
          <addressOffset>0x0000179C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x3D020882</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_AIR_END_TIME</name>
              <description>This register sets the time from cca fall to 6us. It is in unit of 100ns.(default:6us)</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>R2T_SIFS_OFDM</name>
              <description>This register sets the SIFS time required for any immediate response for
example Data-Ack. It is in unit of 100ns.(default:12.6us)</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>T2T_SIFS_OFDM</name>
              <description>This register sets the SIFS time required for consecutive TX events for
example CTS-Data, or broadcast bursting. It is in unit of 100ns.(default:13us)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_AX_TB_TIMING_CTRL</name>
          <addressOffset>0x000017A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0001F86A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_ACKMD_EN</name>
              <description>receive ack frame will generate interrupt of ack_more_data=0/1</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MORE_TF_EN</name>
              <description>receive trigger frame within my bssid but not addressed to me will generate interrupt of more_tf=0/1</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TB_SIFS_USE_NORMAL</name>
              <description>1:choose 0x179c sifs when rx trigger
0:choose 0x17A0[19:10] sifs when rx trigger</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TB_SIFS_REF</name>
              <description>This register sets the for sifs time between cca falling edge of trigger frame and mactx_enable rising edge.It is in unit of 100ns.(default:12.6us)</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TB_TIMEOUT_REF</name>
              <description>This register sets the max time for tb data aggragation, It is in unit of 100ns.(default:12us)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_SR_CONTROL_DBG</name>
          <addressOffset>0x000017A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXPPDU_SRG</name>
              <description>the received pkt is an srg ppdu</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SR_UPD_EN</name>
              <description>the received pkt is allowed to update basic nav</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SR_RESTRICTED</name>
              <description>the spatial reuse type is restricted</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SR_PD_TX</name>
              <description>the value of received power level minus obss_pd_min</description>
              <bitRange>[24:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SR_TIMER_TX</name>
              <description>time can be used for spatial reuse</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NAV_CTRL</name>
          <addressOffset>0x000017A8</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000B04</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_STOP_UPD_INTRANAV</name>
              <description>disable updating intra nav</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_STOP_UPD_BASICNAV</name>
              <description>disable updating basic nav</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TF_UP_NAV_EN</name>
              <description>1:enable updating intra nav when receiving trigger frame</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTRL_PLCP_EN</name>
              <description>1:use txop_dur as sr_tx_timer</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_INTRANAV_INTXOP</name>
              <description>enable updating intra nav in my txop</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_BASICNAV_INTXOP</name>
              <description>enable updating basic nav in my txop</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_USABLE_TIMER_THRES</name>
              <description>If received pkt can operate spatial reuse,the min threshold for sr_timer_tx. unit:256us(default:1024us)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RESP_CONTROL</name>
          <addressOffset>0x000017AA</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000043</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_SIFS_BUSY_DELAY</name>
              <description>start to check channel status after a period of delay start from edcca falling edge,unit:100ns</description>
              <bitRange>[15:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_TX_WITH_FCSERR</name>
              <description>1:if resp_chk_fcs is low and mactx starts to generate mpdu,will tx response with wrong crc32</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_CHK_FCS_ABORT_TX</name>
              <description>1:if resp_chk_fcs is low when sifs reach,will not respond to the received packet</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_GI_LTF_USE_RX</name>
              <description>1:will use gi ltf type in rxpkt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_ERSU_USE_RX</name>
              <description>enable response tx with ersu when rx ersu</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_DCM_USE_RX</name>
              <description>enable response tx with dcm when rx dcm</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_NAV_STATUS</name>
          <addressOffset>0x000017B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_INTRA_NAV_DUR</name>
              <description>intra_nav</description>
              <bitRange>[29:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WMAC_BASIC_NAV_DUR</name>
              <description>basic_nav</description>
              <bitRange>[13:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
