Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_RESP_CONTROL_1</name>
          <addressOffset>0x000017B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x62E40004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESP_CHK_TXNAV</name>
              <description>check txnav when need to response</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_CHK_INTRA_NAV</name>
              <description>check intra nav when need to response</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_CHK_BASIC_NAV</name>
              <description>check basic nav when need to response</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_HTC_EN</name>
              <description>enable appending htc  when need to response</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_RATE_DOWNGRADE</name>
              <description>enable downgrade response rate from HE to VHT, VHT to HT, HE to HT when need to response</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_DCM_EN</name>
              <description>enable using dcm need to response</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_DCM_ONLY_MCS0</name>
              <description>limit response rate to MCS0 when response tx with HE DCM packet</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_TBPPDU_CHK_PWR</name>
              <description>check tb ppdu tx power when rx trigger, if txpwr_ctrl send signal of abort,will not reply with tb ppdu</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_RXTRIG_CHK_INSIFS</name>
              <description>check whether channel is idle during sifs, if csreq=1 in trigger frame, will not reply with tb ppdu</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_CHK_EDCCA</name>
              <description>check edcca when response</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_CHK_BTCCA</name>
              <description>check btcca when response</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_CHK_SEC_CCA20</name>
              <description>check sec 20 cca when response</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_BMOD_WI_RTK_SIG</name>
              <description>mac will tx response with b mode special preamble when receiving b mode with special preamble</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_TXACK_WITH_A1MATCH</name>
              <description>check if rx a1=r_macid0/1 with all bits matched</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIFS_ABORT_TB</name>
              <description>abort ptcl generate tb cmd when sifs reach</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_GI_LTF</name>
              <description>5:1x+0.8
4:1x+1.6
3:2x+0.8
2:2x+1.6
1:4x+0.8
0:4x+3.2
not support 1x+1.6 when response</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_CHK_ZBCCA</name>
              <description>check zigbee cca when response</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_CHK_EDCCA_PER20</name>
              <description>check edcca_per20_bitmap_sifs[0] when tx response</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_CHK_TB_RESP</name>
              <description>if tx tb and receive pgack ,consider as tx ok if this option is enabled</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_CHK_SMPDU_RESP</name>
              <description>if tx smpdu and receive ack or mba,consider as tx ok if this option is enabled</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHK_AMPDU_RESP_MBA_ACK</name>
              <description>if tx ampdu or tb data and receive mba_ack, consider as tx ok if this option is enabled</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_TXRATE</name>
              <description>tx rate use to decide response rate</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RESP_RATE_RRSR</name>
          <addressOffset>0x000017B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x01010101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESP_RRSR_HE</name>
              <description>Data Rate Control Table Register 
BitMap to indicate the response/protection/expected_response rate to use in this BSS. All management and control response frames should obey the rates set in the bitmap. Each bit is mapped as the following: 

HE 1SS MCS0~MCS7

