Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
Response rate must be less than or equal to the rate of the initiating frame. If none of the bits are set, no response is generated by Rtl8712.
If both the legacy rates and HT rates are defined as Basic Rates, fill in only the legacy portion of the bitmap. If only HT rates are defined as Basic Rates, fill in both the legacy and HT portion of the bitmap.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_RRSR_VHT</name>
              <description>VHT 1SS MCS0~MCS7</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_RRSR_HT</name>
              <description>HT 1SS MCS0~MCS7</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_RRSR_OFDM</name>
              <description>{6M, 9M, 12M, 18M, 24M, 36M, 48M, 54M}</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_RESP_RATE_RRSR_1</name>
          <addressOffset>0x000017BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RRSR_SC</name>
              <description>Response frame sub-channel configuration.
Response frames (CTS, ACK, BA) are transmitted in the following condition.
00: Primary 20Mhz BW(0x483[3:0] = 0x8AC[5:2]).
01: Follow Rx packet BW mode.
10: Duplicate mode.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_RRSR_CCK</name>
              <description>{1M, 2M, 5.5M, 11M }</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_RATE_EN</name>
              <description>[0]:enable respnse rate of CCK and OFDM
[1]:enable respnse rate of HT
[2]:enable respnse rate of VHT
[3]:enable respnse rate of HE</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BEAMFORMING_CTRL</name>
          <addressOffset>0x000017C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x18408086</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMAC_HE_CSI_RATE</name>
              <description>HE CSI init rate(HE mode+ MCS)</description>
              <bitRange>[28:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_VHT_CSI_RATE</name>
              <description>VHT CSI init rate(VHT mode + MCS)</description>
              <bitRange>[22:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_HT_CSI_RATE</name>
              <description>HT CSI init rate(HT mode  + MCS)</description>
              <bitRange>[16:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_OFDM_CSI_RATE</name>
              <description>ODFM CSI INIT RATE</description>
              <bitRange>[10:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_MIMO_PARA_CNT</name>
              <description>width of mimo_para_en,deafult:1(mac clk:20M,pluse width:100ns)</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CSI_BFRP_STOPTX</name>
              <description>stop tx when rx ndpa/ndp and wait for bfrp poll frame</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_HE_NDPA_EN</name>
              <description>Set to 1, MAC would inform BB of preparing to receive NDP if the received NDPA is valid.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_BEAMFORMING_CTRL_1</name>
          <addressOffset>0x000017C4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x01080000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSI_LEN_ERR_FLAG</name>
              <description>CSI length error</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR_CSI_ERR_FLAG</name>
              <description>clear tb csi_length error flag</description>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CSI_LEN_RD_SEL</name>
              <description>0:read csi rpt length form bb
1:read csi rpt length form mac</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_CSI_WAIT_TIMER</name>
              <description>set this timer after receiving BFRP or VHT/HE NDPA not solicit a CSI rpt frmae frame me,and should be cleared when receiving a BFRP addressed to me and tx CSI successfully. unit:256us,defult 16ms</description>
              <bitRange>[25:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_LEN</name>
              <description>csi rpt length choosed by 0x17c4[28]</description>
              <bitRange>[17:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_LBK_CFG</name>
          <addressOffset>0x000017C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000012</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLBK_RDY_PERIOD</name>
              <description>tdrdy/rdrdy interval count</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_GID_POS_EN_H</name>
          <addressOffset>0x000017CC</addressOffset>
          <size>32</size>
          <description>VHT group id position enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GID_POSITION_EN_H</name>
              <description>VHT group id position enable</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TRX_PKTCNT_CTRL</name>
          <addressOffset>0x000017D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXPKTCNT_RST</name>
              <description>Reset tx packet counter</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_UDPKTCNT_SET</name>
              <description>loading user define packet counter cfg</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TXPKTCNT_SEL</name>
              <description>Tx packet counter selection 
3'd0: counter 0
3'd1: counter 1
3'd2: counter 2
3'd3: counter 3
3'd4: counter 4
3'd5: counter 5
3'd6: counter 6
3'd7: counter 7</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TXPKTCNT_CFG</name>
              <description>User define
[5:2]:subtype
[1:0]:type</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TRX_PKTCNT</name>
          <addressOffset>0x000017D4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RO_WMAC_TXPKTCNT_RPT</name>
              <description>Tx packet counter</description>
              <bitRange>[24:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TRXPKTCNT_CFG</name>
          <addressOffset>0x000017DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTCNT_7_CFG</name>
              <description>Packet counter 7 type config. If configured , counter 7 will count only for the selected type. bit[31] = 0:  Tx, bit[31]=1:  Rx.
4'b0000: Tx User Define MPDU
4'b0001: Tx HE SU MPDU
4'b0010: Tx HE SU PPDU
4'b0011: Tx HE TB MPDU
4'b0100: Tx HE TB PPDU
4'b1000: Rx packet full drop
4'b1001: Rx drop packet
4'b1010: Rx invalid packet
4'b1011: Rx total OK
4'b1100: Rx total Fail
4'b1101: Rx User Define OK
4'b1110: Rx CCK OK
4'b1111: Rx CCK Fail</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT_6_CFG</name>
              <description>Packet counter 6 type config. If configured , counter 6 will count only for the selected type. bit[27] = 0:  Tx, bit[27]=1:  Rx.
4'b0000: Tx Total MPDU
4'b0001: Tx Total PPDU
4'b0010: Tx HT MPDU
4'b0011: Tx HT PPDU
4'b0100: Tx VHT SU MPDU
4'b0101: Tx VHT SU PPDU
4'b1000: Rx HE MU OK
4'b1001: Rx HE MU Fail
4'b1010: Rx HE MU PPDU
4'b1011: Rx packet full drop
4'b1100: Rx drop packet
4'b1101: Rx invalid packet
4'b1110: Rx total OK
4'b1111: Rx total Fail</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT_5_CFG</name>
              <description>Packet counter 5 type config. If configured , counter 5 will count only for the selected type. bit[23] = 0:  Tx, bit[23]=1:  Rx.
4'b0000: Tx HE TB MPDU
4'b0001: Tx HE TB PPDU
4'b0010: Tx Total MPDU
4'b0011: Tx Total PPDU
4'b1000: Rx HE SU OK
4'b1001: Rx HE SU Fail
4'b1010: Rx HE SU PPDU
4'b1011: Rx HE SU False Alarm
4'b1100: Rx HE MU OK
4'b1101: Rx HE MU Fail
4'b1110: Rx HE MU PPDU
4'b1111: Rx HE MU False Alarm</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT_4_CFG</name>
              <description>Packet counter 4 type config. If configured , counter 4 will count only for the selected type. bit[19] = 0:  Tx, bit[19]=1:  Rx.
4'b0000: Tx HE SU MPDU
4'b0001: Tx HE SU PPDU
4'b0010: Tx HE TB MPDU
4'b0011: Tx HE TB PPDU
4'b1000: Rx VHT MU OK
4'b1001: Rx VHT MU Fail
4'b1010: Rx VHT MU PPDU
4'b1011: Rx VHT MU False Alarm
4'b1100: Rx HE SU OK
4'b1101: Rx HE SU Fail
4'b1110: Rx HE SU PPDU
4'b1111: Rx HE SU False Alarm</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT_3_CFG</name>
              <description>Packet counter 3 type config. If configured , counter 3 will count only for the selected type. bit[15] = 0:  Tx, bit[15]=1:  Rx.
4'b0000: Tx VHT SU MPDU
4'b0001: Tx VHT SU PPDU
4'b0010: Tx HE SU MPDU
4'b0011: Tx HE SU PPDU
4'b1000: Rx VHT SU OK
4'b1001: Rx VHT SU Fail
4'b1010: Rx VHT SU PPDU
4'b1011: Rx VHT SU False Alarm
4'b1100: Rx VHT MU OK
4'b1101: Rx VHT MU Fail
4'b1110: Rx VHT MU PPDU
4'b1111: Rx VHT MU False Alarm</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT_2_CFG</name>
              <description>Packet counter 2 type config. If configured , counter 2 will count only for the selected type.  bit[11] = 0:  Tx, bit[11]=1:  Rx.
4'b0000: Tx HT MPDU
4'b0001: Tx HT PPDU
4'b0010: Tx VHT SU MPDU
4'b0011: Tx VHT SU PPDU
4'b1000: Rx HT OK
4'b1001: Rx HT Fail
4'b1010: Rx HT PPDU
4'b1011: Rx HT False Alarm
4'b1100: Rx VHT SU OK
4'b1101: Rx VHT SU Fail
4'b1110: Rx VHT SU PPDU
4'B1111: Rx VHT SU False Alarm</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT_1_CFG</name>
              <description>Packet counter 1 type config. If configured , counter 1 will count only for the selected type. bit[7] = 0:  Tx, bit[7]=1:  Rx.
4'b0000~4'b0111: Tx OFDM PPDU
4'b1000: Rx OFDM OK
4'b1001: Rx OFDM Fail
4'b1010: Rx OFDM False Alarm
4'b1011: Rx HT OK
4'b1100: Rx HT Fail
4'b1101: Rx HT PPDU
4'b1110: Rx HT False Alarm</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT_0_CFG</name>
              <description>Packet counter 0 type config. If configured , counter 0 will count only for the selected type. bit[3] = 0:  Tx, bit[3]=1:  Rx.
4'b0000~4'b0111: Tx CCK PPDU
4'b1000: Rx CCK OK
4'b1001: Rx CCK Fail
4'b1010: Rx CCK False Alarm
4'b1011: Rx OFDM OK
4'b1100: Rx OFDM Fail
4'b1101: Rx OFDM False Alarm</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_RESP_CTL</name>
          <addressOffset>0x000017E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0003F000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESP_ACK_IGNORE_MACRX</name>
              <description>when set, will response tx regardless of macrx active</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_ACK_NON_EOF</name>
              <description>when set, will response tx ack to mgt frame with eof=0 in trigger frame</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_STOP_RESPONSE</name>
              <description>when set, will not resposne tx</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WMAC_TXRAW_IGNOREA1</name>
              <description>when set, will not check rx a1 of packet that is response to txraw</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_ACTRL_BQR_EN</name>
              <description>when set, hw would update BQR info to A-CTRL</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_ACTRL_UPH_EN</name>
              <description>when set, hw would update UPH info to A-CTRL</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_ACTRL_BSR_EN</name>
              <description>when set, hw would update BSR info to A-CTRL</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_ACTRL_CAS_EN</name>
              <description>when set, hw would update CAS info to A-CTRL</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_LDPC_SEL</name>
              <description>1: follow ctrl reg 0x668[15]; 0: follow rx pkt, used when control info is not valid</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_DCM_SEL</name>
              <description>1: follow ctrl reg 0x17e0[25]; 0: follow rx pkt, used when control info is not valid</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_BSR_FORMATE</name>
              <description>0: queue size of QOS field us non-he formate; 1: queue size of QOS field us he formate,vaild when</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_NOMINAL_PAD</name>
              <description>norminal packet padding:0:0us;1:8us;2:16us;Tpe is decided by nominal packet adding and pre-FEC padding factor</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_EARLY_START</name>
              <description>when set,response satrt early when responsd to non-trigger frame</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_USE_EARLY_FCS</name>
              <description>when set, use rx fifo fcs when response data that use wep/tkip</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_ALLACK_EN</name>
              <description>when set, enable tx multi sta ba-all ack as response, used when control info is not valid</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP_EARLY_START_TRIG</name>
              <description>when set,response satrt early when rx trigger frame except basic trigger</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_TXPWR_CTL</name>
          <addressOffset>0x000017E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXPWR_FAST_MODE_EN</name>
              <description>fast mode enable for txpwr_ctl, tie 1 for AMEBAD2</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY_PAGE17</name>
          <addressOffset>0x000017E8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY</name>
              <description>DUMMY</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MASK_LA_TRX_DBG_L</name>
          <addressOffset>0x000017F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LA_TRX_PATTERN_MASK_L</name>
              <description>used for mask for debug port in iqdump</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_MASK_LA_TRX_DBG_H</name>
          <addressOffset>0x000017F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LA_TRX_PATTERN_MASK_H</name>
              <description>used for mask for debug port in iqdump</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_REF_LA_TRX_DBG_L</name>
          <addressOffset>0x000017F8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LA_TRX_PATTERN_REF_L</name>
              <description>used for mask for debug port in iqdump</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_REF_LA_TRX_DBG_H</name>
          <addressOffset>0x000017FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LA_TRX_PATTERN_REF_H</name>
              <description>used for mask for debug port in iqdump</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
