Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES_REG</name>
      <baseAddress>0x400c0000</baseAddress>
      <size>0x00001000</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>cpu_datain_3</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>CPU Data Input register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu_datain_3</name>
              <description>Input register bit[32*3+31:32*3] of the AES engine in the slave mode, only used in Slave_mode.
As input to the engine, such as plaintext or ciphertext, the input order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, data = {cpu_datain_3[7:0], cpu_datain_3[15:8], cpu_datain_3[23:16], cpu_datain_3[31:24], cpu_datain_2[7:0], cpu_datain_2[15:8], cpu_datain_2[23:16], cpu_datain_2[31:24], cpu_datain_1[7:0], cpu_datain_1[15:8], cpu_datain_1[23:16], cpu_datain_1[31:24], cpu_datain_0[7:0], cpu_datain_0[15:8], cpu_datain_0[23:16], cpu_datain_0[31:24]}
If byte_swap = 1, data = {cpu_datain_3, cpu_datain_2, cpu_datain_1, cpu_datain_0}
Note that when user starts to write input data, 128bits (4 words) should be written together, that is, user is not allowed to read-write interleave. In other word, no partial write (3 words/2 words/1 words) is allowed, and no read can be inserted between writes.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cpu_datain_2</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>CPU Data Input register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu_datain_2</name>
              <description>Input register bit[32*2+31:32*2] of the AES engine in the slave mode, only used in Slave_mode.
As input to the engine, such as plaintext or ciphertext, the input order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, data = {cpu_datain_3[7:0], cpu_datain_3[15:8], cpu_datain_3[23:16], cpu_datain_3[31:24], cpu_datain_2[7:0], cpu_datain_2[15:8], cpu_datain_2[23:16], cpu_datain_2[31:24], cpu_datain_1[7:0], cpu_datain_1[15:8], cpu_datain_1[23:16], cpu_datain_1[31:24], cpu_datain_0[7:0], cpu_datain_0[15:8], cpu_datain_0[23:16], cpu_datain_0[31:24]}
If byte_swap = 1, data = {cpu_datain_3, cpu_datain_2, cpu_datain_1, cpu_datain_0}
Note that when user starts to write input data, 128bits (4 words) should be written together, that is, user is not allowed to read-write interleave. In other word, no partial write (3 words/2 words/1 words) is allowed, and no read can be inserted between writes.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cpu_datain_1</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>CPU Data Input register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu_datain_1</name>
              <description>Input register bit[32*1+31:32*1] of the AES engine in the slave mode, only used in Slave_mode.
As input to the engine, such as plaintext or ciphertext, the input order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, data = {cpu_datain_3[7:0], cpu_datain_3[15:8], cpu_datain_3[23:16], cpu_datain_3[31:24], cpu_datain_2[7:0], cpu_datain_2[15:8], cpu_datain_2[23:16], cpu_datain_2[31:24], cpu_datain_1[7:0], cpu_datain_1[15:8], cpu_datain_1[23:16], cpu_datain_1[31:24], cpu_datain_0[7:0], cpu_datain_0[15:8], cpu_datain_0[23:16], cpu_datain_0[31:24]}
If byte_swap = 1, data = {cpu_datain_3, cpu_datain_2, cpu_datain_1, cpu_datain_0}
Note that when user starts to write input data, 128bits (4 words) should be written together, that is, user is not allowed to read-write interleave. In other word, no partial write (3 words/2 words/1 words) is allowed, and no read can be inserted between writes.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cpu_datain_0</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>CPU Data Input register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu_datain_0</name>
              <description>Input register bit[32*0+31:32*0] of the AES engine in the slave mode, only used in Slave_mode.
As input to the engine, such as plaintext or ciphertext, the input order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, data = {cpu_datain_3[7:0], cpu_datain_3[15:8], cpu_datain_3[23:16], cpu_datain_3[31:24], cpu_datain_2[7:0], cpu_datain_2[15:8], cpu_datain_2[23:16], cpu_datain_2[31:24], cpu_datain_1[7:0], cpu_datain_1[15:8], cpu_datain_1[23:16], cpu_datain_1[31:24], cpu_datain_0[7:0], cpu_datain_0[15:8], cpu_datain_0[23:16], cpu_datain_0[31:24]}
If byte_swap = 1, data = {cpu_datain_3, cpu_datain_2, cpu_datain_1, cpu_datain_0}
Note that when user starts to write input data, 128bits (4 words) should be written together, that is, user is not allowed to read-write interleave. In other word, no partial write (3 words/2 words/1 words) is allowed, and no read can be inserted between writes.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cpu_dataout_3</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>CPU Data Output register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu_dataout_3</name>
              <description>Output register bit[32*3+31:32*3] of the AES engine in the slave mode, only used in Slave_mode.
By waiting for the interrupt or polling the aes_slave_done signal to know whether the AES operation is completed. The result of AES will be stored in this register. The data order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, rdata = {cpu_dataout_3[7:0], cpu_dataout_3[15:8], cpu_dataout_3[23:16], cpu_dataout_3[31:24], cpu_dataout_2[7:0], cpu_dataout_2[15:8], cpu_dataout_2[23:16], cpu_dataout_2[31:24], cpu_dataout_1[7:0], cpu_dataout_1[15:8], cpu_dataout_1[23:16], cpu_dataout_1[31:24], cpu_dataout_0[7:0], cpu_dataout_0[15:8], cpu_dataout_0[23:16], cpu_dataout_0[31:24]}
If byte_swap = 1,r data = {cpu_dataout_3, cpu_dataout_2, cpu_dataout_1, cpu_dataout_0}
Note that when user starts to read output data, 128bits (4 words) should be read together, that is, user is not allowed to read-write interleave. In other word, no partial read (3 words/2 words/1 words) is allowed, and no write can be inserted between reads.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cpu_dataout_2</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>CPU Data Output register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu_dataout_2</name>
              <description>Output register bit[32*2+31:32*2] of the AES engine in the slave mode, only used in Slave_mode.
By waiting for the interrupt or polling the aes_slave_done signal to know whether the AES operation is completed. The result of AES will be stored in this register. The data order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, rdata = {cpu_dataout_3[7:0], cpu_dataout_3[15:8], cpu_dataout_3[23:16], cpu_dataout_3[31:24], cpu_dataout_2[7:0], cpu_dataout_2[15:8], cpu_dataout_2[23:16], cpu_dataout_2[31:24], cpu_dataout_1[7:0], cpu_dataout_1[15:8], cpu_dataout_1[23:16], cpu_dataout_1[31:24], cpu_dataout_0[7:0], cpu_dataout_0[15:8], cpu_dataout_0[23:16], cpu_dataout_0[31:24]}
If byte_swap = 1,r data = {cpu_dataout_3, cpu_dataout_2, cpu_dataout_1, cpu_dataout_0}
Note that when user starts to read output data, 128bits (4 words) should be read together, that is, user is not allowed to read-write interleave. In other word, no partial read (3 words/2 words/1 words) is allowed, and no write can be inserted between reads.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cpu_dataout_1</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>CPU Data Output register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu_dataout_1</name>
              <description>Output register bit[32*1+31:32*1] of the AES engine in the slave mode, only used in Slave_mode.
By waiting for the interrupt or polling the aes_slave_done signal to know whether the AES operation is completed. The result of AES will be stored in this register. The data order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, rdata = {cpu_dataout_3[7:0], cpu_dataout_3[15:8], cpu_dataout_3[23:16], cpu_dataout_3[31:24], cpu_dataout_2[7:0], cpu_dataout_2[15:8], cpu_dataout_2[23:16], cpu_dataout_2[31:24], cpu_dataout_1[7:0], cpu_dataout_1[15:8], cpu_dataout_1[23:16], cpu_dataout_1[31:24], cpu_dataout_0[7:0], cpu_dataout_0[15:8], cpu_dataout_0[23:16], cpu_dataout_0[31:24]}
If byte_swap = 1,r data = {cpu_dataout_3, cpu_dataout_2, cpu_dataout_1, cpu_dataout_0}
Note that when user starts to read output data, 128bits (4 words) should be read together, that is, user is not allowed to read-write interleave. In other word, no partial read (3 words/2 words/1 words) is allowed, and no write can be inserted between reads.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cpu_dataout_0</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>CPU Data Output register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu_dataout_0</name>
              <description>Output register bit[32*0+31:32*0] of the AES engine in the slave mode, only used in Slave_mode.
By waiting for the interrupt or polling the aes_slave_done signal to know whether the AES operation is completed. The result of AES will be stored in this register. The data order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, rdata = {cpu_dataout_3[7:0], cpu_dataout_3[15:8], cpu_dataout_3[23:16], cpu_dataout_3[31:24], cpu_dataout_2[7:0], cpu_dataout_2[15:8], cpu_dataout_2[23:16], cpu_dataout_2[31:24], cpu_dataout_1[7:0], cpu_dataout_1[15:8], cpu_dataout_1[23:16], cpu_dataout_1[31:24], cpu_dataout_0[7:0], cpu_dataout_0[15:8], cpu_dataout_0[23:16], cpu_dataout_0[31:24]}
If byte_swap = 1,r data = {cpu_dataout_3, cpu_dataout_2, cpu_dataout_1, cpu_dataout_0}
Note that when user starts to read output data, 128bits (4 words) should be read together, that is, user is not allowed to read-write interleave. In other word, no partial read (3 words/2 words/1 words) is allowed, and no write can be inserted between reads.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>iv_3</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>IV register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv_3</name>
              <description>IV register bit[32*3+31:32*3]
Except for ECB mode, other modes require IV as input. The user should set the IV before using the AES engine. The IV order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, iv = {iv_3[7:0], iv_3[15:8], iv_3[23:16], iv_3[31:24], iv_2[7:0], iv_2[15:8], iv_2[23:16], iv_2[31:24], iv_1[7:0], iv_1[15:8], iv_1[23:16], iv_1[31:24], iv_0[7:0], iv_0[15:8], iv_0[23:16], iv_0[31:24]}
If byte_swap = 1, iv = {iv_3, iv_2, iv_1, iv_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>iv_2</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>IV register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv_2</name>
              <description>IV register bit[32*2+31:32*2]
Except for ECB mode, other modes require IV as input. The user should set the IV before using the AES engine. The IV order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, iv = {iv_3[7:0], iv_3[15:8], iv_3[23:16], iv_3[31:24], iv_2[7:0], iv_2[15:8], iv_2[23:16], iv_2[31:24], iv_1[7:0], iv_1[15:8], iv_1[23:16], iv_1[31:24], iv_0[7:0], iv_0[15:8], iv_0[23:16], iv_0[31:24]}
If byte_swap = 1, iv = {iv_3, iv_2, iv_1, iv_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>iv_1</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>IV register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv_1</name>
              <description>IV register bit[32*1+31:32*1]
Except for ECB mode, other modes require IV as input. The user should set the IV before using the AES engine. The IV order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, iv = {iv_3[7:0], iv_3[15:8], iv_3[23:16], iv_3[31:24], iv_2[7:0], iv_2[15:8], iv_2[23:16], iv_2[31:24], iv_1[7:0], iv_1[15:8], iv_1[23:16], iv_1[31:24], iv_0[7:0], iv_0[15:8], iv_0[23:16], iv_0[31:24]}
If byte_swap = 1, iv = {iv_3, iv_2, iv_1, iv_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>iv_0</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>IV register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iv_0</name>
              <description>IV register bit[32*0+31:32*0]
Except for ECB mode, other modes require IV as input. The user should set the IV before using the AES engine. The IV order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, iv = {iv_3[7:0], iv_3[15:8], iv_3[23:16], iv_3[31:24], iv_2[7:0], iv_2[15:8], iv_2[23:16], iv_2[31:24], iv_1[7:0], iv_1[15:8], iv_1[23:16], iv_1[31:24], iv_0[7:0], iv_0[15:8], iv_0[23:16], iv_0[31:24]}
If byte_swap = 1, iv = {iv_3, iv_2, iv_1, iv_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
