Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>config</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>Configuration register</description>
          <resetValue>0x80400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aes_idle</name>
              <description>When using slave mode to compute gmac and cmac, since the result is a tag, there would be no data in output fifo, therefore, we use this bit to indicate that gmac/cmac has finished (finished means: no input data in input fifo waited to be processed and aes engine has finished all computation)user can polling this bit to check whether aes engine is not running when using GMAC/CMAC.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>soft_reset_trigger_busy</name>
              <description>Writting 1 to trigger a soft reset. All registers except the mutex register will be reset. Read the bit until 0 to determine if the soft reset is complete.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu_fifo_status</name>
              <description>CPU FIFO status (slave mode FIFO status) {input fifo full (1b), output fifo empty (1b), input data write cnt (2b), output data read cnt (2b)}, for user to check input/output fifo status.
When aes_intr asserted (error_cpu_fifo), user can check FIFO status.</description>
              <bitRange>[23:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cmac_last</name>
              <description>Only used in CMAC mode.
CMAC mode can be divided into several blocks to calculate.
This bit controls whether the last block. If set to 1, it means that the transaction is the last time, and the last block will XOR the subkey.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gcm_last</name>
              <description>In some cases, user would need to use slave mode to compute gcm last when all other computations (GMAC) are computed in DMA mode (see Lalu AES GCM Mode). In such cases, user should not set cpu_datain, user should set engine mode to slave mode first and then set gcm_last to trigger AES engine. Note that user should clear this be to zero after calculation.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>random_op_mode</name>
              <description>Random operation insertion mode.
1: Dynamically insert random cycle of dummy operation in each AES round.
0: Insert fixed cycle (specify by random_op_cycle) of dummy operation in each AES round.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>random_op_cycle</name>
              <description>Random operation cycle. Range from 0~3.
0: Not insert any dummy operation.
1~3: Insert specific cycle of dummy operation.</description>
              <bitRange>[14:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>core_select</name>
              <description>Cipher core select.
1: Select SM4 as cipher core
0: Select AES as cipher core</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sca_mask_en</name>
              <description>SCA mask enable. SW should also set the chn0_sca_mask registers when system initalization.
1: enable SCA protection
0: disable SCA protection</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wait_for_slave_en</name>
              <description>Pready can be low or always stay high
Set to 1: pready will always be 1
Set to 0: pready could be 0 (wait states), default: 0
The difference is that, if set to 1, whenever cpu writes data to input fifo when input fifo is full/read output data from output fifo when output fifo is empty,pready will stay 1, and respond an error (pslverr asserted) immediately. If set to 0, when cpu writes data to input fifo when input fifo is full, however, if there is still space in output fifo, pready will stay 0 untill aes consumes input data from input fifo, that is, there are spaces for incoming input data now. then, pready is asserted, and there will be no error response.When cpu reads data from output fifo when output fifo is empty, however, if there is still available data in input fifo, pready will stay 0 untill aes push output data to output fifo, that is, there is output data waiting to be read now. then, pready is asserted, and there will be no error response.if cpu attempts to write data to input fifo when input is full and output fifo is also full/read data from output fifo when output data is empty and input fifo is also empty, pready will be asserted and respond an error.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>de_key_gen</name>
              <description>In general, the decryption key will be derived when decrypting in ECB or CBC mode. If the user has prepared the decryption key, can set this register to 0 to skip the cycles of derived.
If 1, it will generate a key when decrypting.
If 0, it will not generate the key, but instead uses the input to start decrypting.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>first_block</name>
              <description>If using dma mode, the usage of "first block" is the same as original (before this version). If using slave mode, set "first_block" to 1 is meaningless. that is, it's dont care.When using slave mode, the last step after setting all registers is to set cpu datain. After setting cpu datain (128 bits) in total, AES engine will start computing automatically.(recommend to set to 0 if using slave mode)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_de</name>
              <description>1'b0: decrypt
1'b1: encrypt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>key_size</name>
              <description>2'b00: 128 bits
2'b01: 192 bits
2'b10: 256 bits</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cipher_mode</name>
              <description>4'b0000: ECB mode
4'b0001: CBC mode
4'b0010: CFB mode
4'b0011: OFB mode
4'b0100: CTR mode
4'b0101: GMAC mode (only available when SUPPORT_GCM=1)
4'b0110: GCM mode (only available when SUPPORT_GCM=1)
4'b0111: CMAC mode
4'b1000: XTS mode (only available when SUPPORT_XTS=1)</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>engine_mode</name>
              <description>0: Slave mode
1: DMA mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cipher_len</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>Input length register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cipher_len</name>
              <description>In the CFB, OFB and CTR mode, whether the last block is 16-byte aligned affects the length of the output.
In the XTS and CMAC mode, the last block requires additional computation. The user needs to provide the total length for reference. In the GCM mode, the user needs to inform the length of the plaintext or ciphertext. The plaintext or ciphertext does not need to be given at once. But every time add data before the end of the calculation, the user needs to update the data length. Will be used in the last GMAC calculation of GCM.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gmac_len_1</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description>AAD length register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>gmac_len_1</name>
              <description>AAD length register bit[32*1+31:32*1] in GMAC and GCM mode
In the GCM or GMAC mode, the user needs to inform the length of the Additional Authenticated Data (AAD). The length of the one AAD needs to be accumulated. Will be used in the last GMAC calculation of GCM.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gmac_len_0</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>AAD length register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>gmac_len_0</name>
              <description>AAD length register bit[32*0+31:32*0] in GMAC and GCM mode
In the GCM or GMAC mode, the user needs to inform the length of the Additional Authenticated Data (AAD). The length of the one AAD needs to be accumulated. Will be used in the last GMAC calculation of GCM.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>tag_3</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>Tag register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tag_3</name>
              <description>Tag register bit[32*3+31:32*3]
After a complete GCM operation, a tag will be generated. The tag will stored in this register. In addition, because GCM can be done in segments, tag can be used as input when GCM is started again. The tag order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, tag = {tag_3[7:0], tag_3[15:8], tag_3[23:16], tag_3[31:24], tag_2[7:0], tag_2[15:8], tag_2[23:16], tag_2[31:24], tag_1[7:0], tag_1[15:8], tag_1[23:16], tag_1[31:24], tag_0[7:0], tag_0[15:8], tag_0[23:16], tag_0[31:24]}
If byte_swap = 1, tag = {tag_3, tag_2, tag_1, tag_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>tag_2</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>Tag register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tag_2</name>
              <description>Tag register bit[32*2+31:32*2]
After a complete GCM operation, a tag will be generated. The tag will stored in this register. In addition, because GCM can be done in segments, tag can be used as input when GCM is started again. The tag order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, tag = {tag_3[7:0], tag_3[15:8], tag_3[23:16], tag_3[31:24], tag_2[7:0], tag_2[15:8], tag_2[23:16], tag_2[31:24], tag_1[7:0], tag_1[15:8], tag_1[23:16], tag_1[31:24], tag_0[7:0], tag_0[15:8], tag_0[23:16], tag_0[31:24]}
If byte_swap = 1, tag = {tag_3, tag_2, tag_1, tag_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>tag_1</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>Tag register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tag_1</name>
              <description>Tag register bit[32*1+31:32*1]
After a complete GCM operation, a tag will be generated. The tag will stored in this register. In addition, because GCM can be done in segments, tag can be used as input when GCM is started again. The tag order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, tag = {tag_3[7:0], tag_3[15:8], tag_3[23:16], tag_3[31:24], tag_2[7:0], tag_2[15:8], tag_2[23:16], tag_2[31:24], tag_1[7:0], tag_1[15:8], tag_1[23:16], tag_1[31:24], tag_0[7:0], tag_0[15:8], tag_0[23:16], tag_0[31:24]}
If byte_swap = 1, tag = {tag_3, tag_2, tag_1, tag_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>tag_0</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>Tag register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tag_0</name>
              <description>Tag register bit[32*0+31:32*0]
After a complete GCM operation, a tag will be generated. The tag will stored in this register. In addition, because GCM can be done in segments, tag can be used as input when GCM is started again. The tag order depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, tag = {tag_3[7:0], tag_3[15:8], tag_3[23:16], tag_3[31:24], tag_2[7:0], tag_2[15:8], tag_2[23:16], tag_2[31:24], tag_1[7:0], tag_1[15:8], tag_1[23:16], tag_1[31:24], tag_0[7:0], tag_0[15:8], tag_0[23:16], tag_0[31:24]}
If byte_swap = 1, tag = {tag_3, tag_2, tag_1, tag_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ghash_key_3</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>GHASH key register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ghash_key_3</name>
              <description>GHASH key register bit[32*3+31:32*3]
If using GCM mode without AAD, need to first calculate the ghash key and write it to the register. To generate the ghash key, apply the AES block cipher to the "zero" block with actual key. The ghash_keyorder depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, ghash_key = {ghash_key_3[7:0], ghash_key_3[15:8], ghash_key_3[23:16], ghash_key_3[31:24], ghash_key_2[7:0], ghash_key_2[15:8], ghash_key_2[23:16], ghash_key_2[31:24], ghash_key_1[7:0], ghash_key_1[15:8], ghash_key_1[23:16], ghash_key_1[31:24], ghash_key_0[7:0], ghash_key_0[15:8], ghash_key_0[23:16], ghash_key_0[31:24]}
If byte_swap = 1, ghash_key = {ghash_key_3, ghash_key_2, ghash_key_1, ghash_key_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ghash_key_2</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>GHASH key register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ghash_key_2</name>
              <description>GHASH key register bit[32*2+31:32*2]
If using GCM mode without AAD, need to first calculate the ghash key and write it to the register. To generate the ghash key, apply the AES block cipher to the "zero" block with actual key. The ghash_keyorder depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, ghash_key = {ghash_key_3[7:0], ghash_key_3[15:8], ghash_key_3[23:16], ghash_key_3[31:24], ghash_key_2[7:0], ghash_key_2[15:8], ghash_key_2[23:16], ghash_key_2[31:24], ghash_key_1[7:0], ghash_key_1[15:8], ghash_key_1[23:16], ghash_key_1[31:24], ghash_key_0[7:0], ghash_key_0[15:8], ghash_key_0[23:16], ghash_key_0[31:24]}
If byte_swap = 1, ghash_key = {ghash_key_3, ghash_key_2, ghash_key_1, ghash_key_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ghash_key_1</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description>GHASH key register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ghash_key_1</name>
              <description>GHASH key register bit[32*1+31:32*1]
If using GCM mode without AAD, need to first calculate the ghash key and write it to the register. To generate the ghash key, apply the AES block cipher to the "zero" block with actual key. The ghash_keyorder depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, ghash_key = {ghash_key_3[7:0], ghash_key_3[15:8], ghash_key_3[23:16], ghash_key_3[31:24], ghash_key_2[7:0], ghash_key_2[15:8], ghash_key_2[23:16], ghash_key_2[31:24], ghash_key_1[7:0], ghash_key_1[15:8], ghash_key_1[23:16], ghash_key_1[31:24], ghash_key_0[7:0], ghash_key_0[15:8], ghash_key_0[23:16], ghash_key_0[31:24]}
If byte_swap = 1, ghash_key = {ghash_key_3, ghash_key_2, ghash_key_1, ghash_key_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ghash_key_0</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description>GHASH key register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ghash_key_0</name>
              <description>GHASH key register bit[32*0+31:32*0]
If using GCM mode without AAD, need to first calculate the ghash key and write it to the register. To generate the ghash key, apply the AES block cipher to the "zero" block with actual key. The ghash_keyorder depends on chnx_aes_reg.config.byte_swap bit.
If byte_swap = 0, ghash_key = {ghash_key_3[7:0], ghash_key_3[15:8], ghash_key_3[23:16], ghash_key_3[31:24], ghash_key_2[7:0], ghash_key_2[15:8], ghash_key_2[23:16], ghash_key_2[31:24], ghash_key_1[7:0], ghash_key_1[15:8], ghash_key_1[23:16], ghash_key_1[31:24], ghash_key_0[7:0], ghash_key_0[15:8], ghash_key_0[23:16], ghash_key_0[31:24]}
If byte_swap = 1, ghash_key = {ghash_key_3, ghash_key_2, ghash_key_1, ghash_key_0}</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>byte_swap_disable</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description>Byte swap control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ghash_key_swap_disable</name>
              <description>1: disable swap ghash_key_x</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tag_swap_disable</name>
              <description>1: disable swap tag_x</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>iv_swap_disable</name>
              <description>1: disable swap iv_x</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu_data_swap_disable</name>
              <description>1: disable swap cpu_datain_x and cpu_dataout_x</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>key_swap_disable</name>
              <description>1: disable swap key_x or key_management input key</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>payload_swap_disable</name>
              <description>1: disable swap the data from mem</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Mutex_status</name>
          <addressOffset>0x00000D00</addressOffset>
          <size>32</size>
          <description>Engine mutex status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Engine_mutex_status</name>
              <description>If read 0, lock mutex.
If not 0, the engine is being used.
2'b01: secure domain lock mutex
2'b10: non-secure domain lock mutex
Write 0 to unlock mutex</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Mutex_overwrite</name>
          <addressOffset>0x00000D04</addressOffset>
          <size>32</size>
          <description>Engine mutex overwrite register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Engine_mutex_overwrite</name>
              <description>Secure only.
Allows secure domain overwrite mutex.
1: enable
0: disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn0_sca_mask_0</name>
          <addressOffset>0x00000E00</addressOffset>
          <size>32</size>
          <description>SCA mask reigster 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>chn0_sca_mask_0</name>
              <description>Set a SCA mask seed when system initialization.
SW should set a random number generated by TRNG to this register every boot.</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
