Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>chn0_sca_mask_1</name>
          <addressOffset>0x00000E04</addressOffset>
          <size>32</size>
          <description>SCA mask reigster 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>chn0_sca_mask_1</name>
              <description>Set a SCA mask seed when system initialization.
SW should set a random number generated by TRNG to this register every boot.</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn0_sca_mask_2</name>
          <addressOffset>0x00000E08</addressOffset>
          <size>32</size>
          <description>SCA mask reigster 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>chn0_sca_mask_2</name>
              <description>Set a SCA mask seed when system initialization.
SW should set a random number generated by TRNG to this register every boot.</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn0_sca_mask_3</name>
          <addressOffset>0x00000E0C</addressOffset>
          <size>32</size>
          <description>SCA mask reigster 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>chn0_sca_mask_3</name>
              <description>Set a SCA mask seed when system initialization.
SW should set a random number generated by TRNG to this register every boot.</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_Intr_status</name>
          <addressOffset>0x00000EE0</addressOffset>
          <size>32</size>
          <description>Interrupt status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>chn15_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 15.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn14_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 14.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn13_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 13.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn12_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 12.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn11_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 11.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn10_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 10.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn9_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 9.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn8_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 8.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn7_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 7.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn6_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 6.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn5_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 5.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn4_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 4.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn3_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 3.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn2_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 2.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn1_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 1.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>chn0_aes_int_status</name>
              <description>Set to 1 when any AES interrupt occurs on channel 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn0_aes_int_raw</name>
          <addressOffset>0x00000EF0</addressOffset>
          <size>32</size>
          <description>Raw interrupt register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>error_cpu_fifo_raw</name>
              <description>Set to 1 when the user uses slave mode and writes data when input data fifo is full or reads data when output data fifo is empty.
(error condition is related to ctrl.block_pready)
*available after version 2024/08/19</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>error_ende_circuit_raw</name>
              <description>Set to 1 when the user uses the corresponding operation when closing the encryption or decryption circuit.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>error_decode_cipher_raw</name>
              <description>Set to 1 when the user sets a non-existent cipher mode.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>error_block_size_raw</name>
              <description>Set to 1 when the input size is not a multiple of 128 when using ECB or CBC mode.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>aes_slave_done_raw</name>
              <description>Set to 1 when aes has output data waiting for user to read  (*after version 2024/08/19)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn0_aes_int_mask</name>
          <addressOffset>0x00000EF4</addressOffset>
          <size>32</size>
          <description>Enable interrupt register</description>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>error_cpu_fifo_mask</name>
              <description>Interrupt error_cpu_fifo enable.
*available after version 2024/08/19</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>error_ende_circuit_mask</name>
              <description>Interrupt error_ende_circuit enable.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>error_decode_cipher_mask</name>
              <description>Interrupt error_decode_cipher enable.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>error_block_size_mask</name>
              <description>Interrupt error_block_size enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>aes_slave_done_mask</name>
              <description>Interrupt aes_slave_done enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn0_aes_int_status</name>
          <addressOffset>0x00000EF8</addressOffset>
          <size>32</size>
          <description>Masked interrupt register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>error_cpu_fifo_status</name>
              <description>Masked error_cpu_fifo
*available after version 2024/08/19</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>error_ende_circuit_status</name>
              <description>Masked error_ende_circuit.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>error_decode_cipher_status</name>
              <description>Masked error_decode_cipher.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>error_block_size_status</name>
              <description>Masked error_block_size.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>aes_slave_done_status</name>
              <description>Masked aes_slave_done.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn0_aes_int_clear</name>
          <addressOffset>0x00000EFC</addressOffset>
          <size>32</size>
          <description>Clear interrupt register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>aes_int_clear</name>
              <description>Interrupt clear.
Writing 1'b1 to the register will trigger a 1-cycle pulse interrupt clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn_aes_mask_en_and_version</name>
          <addressOffset>0x00000FF0</addressOffset>
          <size>32</size>
          <description>Enable AES engine mask status register and version register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>version</name>
              <description>The lalu_aes version number.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>dma_en</name>
              <description>Indicate whether DMA is used (suppoty DMA mode or not)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>core_select_lock</name>
              <description>Indicate whether the core_select was locked by hardware pin.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>key_management_en</name>
              <description>Indicate whether to use key_management.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>trustzone_en</name>
              <description>Indicate whether to use TrustZone.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gf_mask_en</name>
              <description>Indicate whether to use SCA countermeasure.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn_aes_en_de_circuit</name>
          <addressOffset>0x00000FF4</addressOffset>
          <size>32</size>
          <description>Enable circuit status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>en_circuit</name>
              <description>Indicate which AES engine has the encryption circuit.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>de_circuit</name>
              <description>Indicate which AES engine has the decryption circuit.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>chn_aes_gcm_xts_circuit</name>
          <addressOffset>0x00000FF8</addressOffset>
          <size>32</size>
          <description>Enable GCM and XTS status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xts_circuit</name>
              <description>Indicate which AES engine has the XTS circuit.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gcm_circuit</name>
              <description>Indicate which AES engine has the GCM and GMAC circuit.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>date</name>
          <addressOffset>0x00000FFC</addressOffset>
          <size>32</size>
          <description>Date register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>date</name>
              <description>The date that design was generated.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
