Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SHA_REG</name>
      <baseAddress>0x400c1000</baseAddress>
      <size>0x00001000</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SHA_Control</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>HMAC engine control register</description>
          <resetValue>0x00007020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>soft_reset_trigger_busy</name>
              <description>Write 1 to trigger a soft reset.
All registers except the mutex register will be reset.
Read the bit until 0 to determine if the soft reset is complete.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[23:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO_full_suspend</name>
              <description>User writes data to SHA_FIFO_in but the FIFO space is full.
0x0: accept signal is always asserted
0x1: accept signal is not asserted until FIFO space is available
Note: This function is only available when Slave_mode = 0x1</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Key_byte_inversion_enable</name>
              <description>0x0: use native byte order in memory
0x1: inverse byte order of read data</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Payload_byte_inversion_enable</name>
              <description>0x0: use native byte order in memory
0x1: inverse byte order of read data</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tSHA512_use_256</name>
              <description>Only available when config SUPPORT_TRUNCATED_SHA512 and SHA512_truncate_en= 0x1 (truncated SHA-512)
0: SHA-512/224 mode
1: SHA-512/256 mode</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA512_truncate_en</name>
              <description>Only available when config SUPPORT_TRUNCATED_SHA512 and SHA_mode = 0x3 (SHA-512)
0: normal SHA-512
1: truncated SHA-512</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HMAC_Key_size</name>
              <description>Only available when config HMAC_MODE
0x0: 128 bits
0x1: 192 bits
0x2: 256 bits</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Slave_mode</name>
              <description>0: DMA mode.
1: slave mode. SW can push data by wrting FIFO Data Register in slave mode.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICG_enable</name>
              <description>Enable auto clock gating</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HMAC_mode</name>
              <description>Only available when config HMAC_MODE
0x0: use HASH mode.
0x1: use HMAC mode.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_mode</name>
              <description>0x0: read-only mode
0x1: copy mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA2_mode</name>
              <description>0x0: SHA-224
0x1: SHA-256
0x2: SHA-384
0x3: SHA-512</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Status</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>HMAC engine status register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Engine_busy</name>
              <description>1: engine busy</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[27:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO_space</name>
              <description>Number of available FIFO space in byte</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HMAC_Block_control</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>HMAC engine block control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>End_slave_input</name>
              <description>Avaliable when using slave mode
If all input data has been completed, set this bit to 1 to start padding.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>last_block</name>
              <description>Indicates this operation is the last block.
If set to SHA2 mode, the padding step will be executed at the end.
If set to HMAC mode, the o_pad step will be executed at the end.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>first_block</name>
              <description>Indicates this operation is the first block.
If set to SHA2 mode, the digest will be initialized automatically.
If set to HMAC mode, the i_pad step will be executed first.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest0</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xC1059ED8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest0</name>
              <description>Hash value 0. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest1</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xC1059ED8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest1</name>
              <description>Hash value 1. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest2</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x629A292A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest2</name>
              <description>Hash value 2. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest3</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x367CD507</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest3</name>
              <description>Hash value 3. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest4</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x9159015A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest4</name>
              <description>Hash value 4. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest5</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x3070DD17</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest5</name>
              <description>Hash value 5. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest6</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x152FECD8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest6</name>
              <description>Hash value 6. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest7</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xF70E5939</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest7</name>
              <description>Hash value 7. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest8</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x67332667</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest8</name>
              <description>Hash value 8. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest9</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xFFC00B31</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest9</name>
              <description>Hash value 9. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest10</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x8EB44A87</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest10</name>
              <description>Hash value 10. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest11</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x68581511</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest11</name>
              <description>Hash value 11. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest12</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xDB0C2E0D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest12</name>
              <description>Hash value 12. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest13</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x64F98FA7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest13</name>
              <description>Hash value 13. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest14</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x47B5481D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest14</name>
              <description>Hash value 14. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_Digest15</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xBEFA4FA4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_Digest15</name>
              <description>Hash value 15. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_FIFO_IN</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>FIFO input data register for slave mode</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA_FIFO_IN</name>
              <description>Input data register for slave mode.</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_input_len_0</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>Total input byte length register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_input_len0</name>
              <description>Hash length[32*(3-0)+31:32*(3-0)]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_input_len_1</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>Total input byte length register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_input_len1</name>
              <description>Hash length[32*(3-1)+31:32*(3-1)]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_input_len_2</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>Total input byte length register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_input_len2</name>
              <description>Hash length[32*(3-2)+31:32*(3-2)]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_input_len_3</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>Total input byte length register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_input_len3</name>
              <description>Hash length[32*(3-3)+31:32*(3-3)]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_configuration</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>LMOTS Configuration Register</description>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_const_little_endian</name>
              <description>Data structure of LMOTS constant registers (0x98~0xAC)
0x0 : Big-endian
0x1 : Little-endian</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LMOTS_j_iteration_end</name>
              <description>Maximum iteration index j in LMOTS process</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LMOTS_j_iteration_initial</name>
              <description>Initial iteration index j in LMOTS process</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[7:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LMOTS_mode</name>
              <description>The operation of LMOTS mode
0x0 : Generate public-key (KeyGen) or generate signature (SigGen)
0x1 : Verify signature
Note:
This register is valid only when LMOTS_enable = 0x1
This register is valid available when engine support LMOTS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_control</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>LMOTS Control Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LMOTS_enable</name>
              <description>0x1 : enable engine to start LMOTS process
Note: This register is clear automatically after LMOTS process complete.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_constant_0</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_constant_0</name>
              <description>Key identifier [32*0+31:32*0]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_constant_1</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_constant_1</name>
              <description>Key identifier [32*1+31:32*1]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
