Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>LMOTS_constant_2</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_constant_2</name>
              <description>Key identifier [32*2+31:32*2]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_constant_3</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_constant_3</name>
              <description>Key identifier [32*3+31:32*3]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_constant_4</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_q</name>
              <description>Leaf index of LMOTS tree</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_constant_5</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_i_byte_0</name>
              <description>Digest byte index of LMOTS tree
Note : The register is available only when LMOTS_const_little_endian = 0x0. Otherwise, it is always 0x0.</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LMOTS_i_byte_1</name>
              <description>Digest byte index of LMOTS tree
Note : The register is available only when LMOTS_const_little_endian = 0x0. Otherwise, it is always 0x0.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LMOTS_i_byte_2</name>
              <description>Digest byte index of LMOTS tree
Note : The register is available only when LMOTS_const_little_endian = 0x1. Otherwise, it is always 0x0.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LMOTS_i_byte_3</name>
              <description>Digest byte index of LMOTS tree
Note : The register is available only when LMOTS_const_little_endian = 0x1. Otherwise, it is always 0x0.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA256_digest_alias_0</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description>SHA256 Hash value register 0</description>
          <resetValue>0xC1059ED8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA256_Digest_alias_0</name>
              <description>SHA256 Hash value 0. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA256_digest_alias_1</name>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <description>SHA256 Hash value register 1</description>
          <resetValue>0x629A292A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA256_Digest_alias_1</name>
              <description>SHA256 Hash value 1. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA256_digest_alias_2</name>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <description>SHA256 Hash value register 2</description>
          <resetValue>0x9159015A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA256_Digest_alias_2</name>
              <description>SHA256 Hash value 2. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA256_digest_alias_3</name>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <description>SHA256 Hash value register 3</description>
          <resetValue>0x152FECD8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA256_Digest_alias_3</name>
              <description>SHA256 Hash value 3. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA256_digest_alias_4</name>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <description>SHA256 Hash value register 4</description>
          <resetValue>0x67332667</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA256_Digest_alias_4</name>
              <description>SHA256 Hash value 4. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA256_digest_alias_5</name>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <description>SHA256 Hash value register 5</description>
          <resetValue>0x8EB44A87</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA256_Digest_alias_5</name>
              <description>SHA256 Hash value 5. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA256_digest_alias_6</name>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <description>SHA256 Hash value register 6</description>
          <resetValue>0xDB0C2E0D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA256_Digest_alias_6</name>
              <description>SHA256 Hash value 6. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA256_digest_alias_7</name>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <description>SHA256 Hash value register 7</description>
          <resetValue>0x47B5481D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHA256_Digest_alias_7</name>
              <description>SHA256 Hash value 7. Reset value is SHA384 IV.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dma_hs_cfg</name>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <description>DMA hardware handshake configuration register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>dma_hs_msize</name>
              <description>The expected number of burst write transaction length.
Please set this field to 3'b000 to avoid data loss.</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_hs_tr_width</name>
              <description>The expected data width of each write transaction from DMA.
Since the engine uses the APB protocol, please set the field to 3'b010.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dma_hs_block_ts</name>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <description>DMA hardware handshake block transfer size register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dma_hs_block_ts</name>
              <description>Total number of data byte for requesting DMA</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dma_hs_buff_byte</name>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <description>DMA hardware handshake buffer data byte of engine register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>dma_hs_buff_byte</name>
              <description>The register indicates number of data byte which has been processed in engine.
This number will not larger than block size of engine.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dma_hs_en</name>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <description>DMA hardware handshake enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>dma_hs_en</name>
              <description>Once the register is enabled, the engine starts to send dma_req until received wdata reaches trans_data_request.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_sig_alias256_0</name>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <description>LMOTS signature register 0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_Signature_0</name>
              <description>Signature value 0 of LMOTS</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_sig_alias256_1</name>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <description>LMOTS signature register 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_Signature_1</name>
              <description>Signature value 1 of LMOTS</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_sig_alias256_2</name>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <description>LMOTS signature register 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_Signature_2</name>
              <description>Signature value 2 of LMOTS</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_sig_alias256_3</name>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <description>LMOTS signature register 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_Signature_3</name>
              <description>Signature value 3 of LMOTS</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_sig_alias256_4</name>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <description>LMOTS signature register 4</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_Signature_4</name>
              <description>Signature value 4 of LMOTS</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_sig_alias256_5</name>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <description>LMOTS signature register 5</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_Signature_5</name>
              <description>Signature value 5 of LMOTS</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_sig_alias256_6</name>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <description>LMOTS signature register 6</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_Signature_6</name>
              <description>Signature value 6 of LMOTS</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMOTS_sig_alias256_7</name>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <description>LMOTS signature register 7</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LMOTS_Signature_7</name>
              <description>Signature value 7 of LMOTS</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Mutex_status</name>
          <addressOffset>0x00000D00</addressOffset>
          <size>32</size>
          <description>Mutex status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Engine_mutex_status</name>
              <description>If read 0, lock mutex.
If not 0, the engine is being used.
2'b01: secure domain lock mutex
2'b10: non-secure domain lock mutex
Write 0 to unlock mutex</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Mutex_overwrite</name>
          <addressOffset>0x00000D04</addressOffset>
          <size>32</size>
          <description>Mutex overwrite register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Engine_mutex_overwrite</name>
              <description>Allows secure domain overwrite mutex
1: enable
0: disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Configuration</name>
          <addressOffset>0x00000FF0</addressOffset>
          <size>32</size>
          <description>Configuration information register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[31:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLE_CORE_SM3</name>
              <description>1: SM3 is disabled by hardware
0: SM3 is enabled</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLE_CORE_SHA1</name>
              <description>1: SHA1 is disabled by hardware
0: SHA1 is enabled</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLE_CORE_SHA2</name>
              <description>1: SHA2 is disabled by hardware
0: SHA2 is enabled</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>Reserved</description>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM3_CORE_EN</name>
              <description>1: SM3 is implmented
0: SM3 is not implmented</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA1_CORE_EN</name>
              <description>1: SHA1 is implmented
0: SHA1 is not implmented</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRUST_ZONE_EN</name>
              <description>0: disabled
1: enabled</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_MANAGER_EN</name>
              <description>0: disabled
1: enabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTERNAL_KEY_EN</name>
              <description>0: disabled
1: enabled</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SUPPORT_COPY_MODE</name>
              <description>0: disabled
1: enabled</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SUPPORT_HMAC_MODE</name>
              <description>0: disabled
1: enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SUPPORT_TRUNCATED_SHA512</name>
              <description>0: disabled
1: enabled</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SUPPORT_SHA512</name>
              <description>0: disabled
1: enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA2_CORE_EN</name>
              <description>1: SHA2 is implmented
0: SHA2 is not implmented</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Version</name>
          <addressOffset>0x00000FF8</addressOffset>
          <size>32</size>
          <description>Version number register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SVN_number</name>
              <description></description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Engine_Version</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Date</name>
          <addressOffset>0x00000FFC</addressOffset>
          <size>32</size>
          <description>Generated date register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Year</name>
              <description></description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Date</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
