Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SHA_KEY_REG</name>
      <baseAddress>0x400c4000</baseAddress>
      <size>0x00000050</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000050</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>Key_Sel_Number</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Key Selection Number Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Set_xts_en</name>
              <description>Only available when SUPPORT_XTS_MODE = 1.
When this bit is set to 1, the trigger will write the selected key to xts_key2.
Otherwise, the trigger will write the selected key to key/xts_key1.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Key_Sel_Number</name>
              <description>The key number determines which key to use in the key setting.
HW keys: 0~31, the number can be used is determined by the number of HW keys configured.
Hardwired key: 32, if enabled
Secure SW key: 33
Shared SW key: 34~ , the number can be used is determined by the number of SW keys configured.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Key_Setup_Trigger</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Key Setup Process Trigger Register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Allow_Nsec_Use_Sec_key</name>
              <description>When setting this field to 1, allow non-secure domain to trigger the secure key.
Only secure domain can write this bit.
The corresponding bits will be numbered from smallest to largest.
For example, the number of the secure domain key is 0, 1, 33.
Bits 0, 1, 2 control key0, key1, key33 respectively.</description>
              <bitRange>[5:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Key_Setup_Trigger_Key_Manager_Idle</name>
              <description>Write 1 to trigger key setup process
If the selected key is a hardware key, assert hw_key_req and wait for hw_key_ack.
The key setup process will not start until hw_key_ack is received.
The key managment unit uses the APB interface to pass the key into the engine according to the selected key.
The read data represents whether the engine is idle or not.
0: Key setup process ongoing
1: Key setup is completed
After triggering the key setup process, read this bit to confirm completion.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Secure_key0_7</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Secure key0 Register[255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Secure_Key0_7</name>
              <description>Secure key0 register[32*7+31:31*7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Secure_key0_6</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>Secure key0 Register[223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Secure_Key0_6</name>
              <description>Secure key0 register[32*6+31:31*6]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Secure_key0_5</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>Secure key0 Register[191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Secure_Key0_5</name>
              <description>Secure key0 register[32*5+31:31*5]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Secure_key0_4</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>Secure key0 Register[159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Secure_Key0_4</name>
              <description>Secure key0 register[32*4+31:31*4]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Secure_key0_3</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>Secure key0 Register[127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Secure_Key0_3</name>
              <description>Secure key0 register[32*3+31:31*3]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Secure_key0_2</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>Secure key0 Register[95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Secure_Key0_2</name>
              <description>Secure key0 register[32*2+31:31*2]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Secure_key0_1</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>Secure key0 Register[63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Secure_Key0_1</name>
              <description>Secure key0 register[32*1+31:31*1]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Secure_key0_0</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>Secure key0 Register[31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Secure_Key0_0</name>
              <description>Secure key0 register[32*0+31:31*0]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Shared_key0_7</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>Shared key0 Register[255:224]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Shared_Key0_7</name>
              <description>Shared key0 register[32*7+31:32*7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Shared_key0_6</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>Shared key0 Register[223:192]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Shared_Key0_6</name>
              <description>Shared key0 register[32*6+31:32*6]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Shared_key0_5</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>Shared key0 Register[191:160]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Shared_Key0_5</name>
              <description>Shared key0 register[32*5+31:32*5]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Shared_key0_4</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>Shared key0 Register[159:128]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Shared_Key0_4</name>
              <description>Shared key0 register[32*4+31:32*4]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Shared_key0_3</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Shared key0 Register[127:96]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Shared_Key0_3</name>
              <description>Shared key0 register[32*3+31:32*3]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Shared_key0_2</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Shared key0 Register[95:64]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Shared_Key0_2</name>
              <description>Shared key0 register[32*2+31:32*2]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Shared_key0_1</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Shared key0 Register[63:32]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Shared_Key0_1</name>
              <description>Shared key0 register[32*1+31:32*1]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Shared_key0_0</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>Shared key0 Register[31:0]</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Shared_Key0_0</name>
              <description>Shared key0 register[32*0+31:32*0]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
