Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CFG0_H</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Channel 0 high-32 bits Configuration Register</description>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG0_H_Extended_DEST_PER1</name>
              <description>The extened 4th bit of DEST_PER when hardware handshake interfaces number is configured to 32.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG0_H_Extended_SRC_PER1</name>
              <description>The extened 4th bit of SRC_PER when hardware handshake interfaces number is configured to 32.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG0_H_DEST_PER</name>
              <description>Assigns a hardware handshaking interface(0 - DMAC_NUM_HS_INT-1) to the destination of channel x if the FGx.HS_SEL_DST field is 0; otherwise, this field is ignored. The channel can then communicate with the destinationperipheral connected to that interface through the assignedhardware handshaking interface.
NOTE1: For correct DMA operation, only one peripheral (sourceor destination) should be assigned to the same handshaking interface
NOTE2: This field does not exist if the configuration parameterDMAC_NUM_HS_INT is set to 0.</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG0_H_SRC_PER</name>
              <description>Assigns a hardware handshaking interface(0 - DMAC_NUM_HS_INT-1) to the source of channel x if the CFGx.HS_SEL_SRC field is 0; otherwise, this field is ignored. The channel can then communicate with the source peripheral connected to that interface through the assigned hardware handshaking interface.
NOTE1: For correct RTK_DMAC operation, only one peripheral (source or destination) should be assigned to the same handshaking interface.
NOTE2: This field does not exist if the configuration parameter DMAC_NUM_HS_INT is set to 0.</description>
              <bitRange>[10:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG0_H_PROTCTL</name>
              <description>Protection Control.Set the bit 35 to 0 will enable the channel secure DMA transfer.
Set the bit 35 to 1 will enable the channel non-secure DMAC transfer.
Note: if user not define DMAC_SECURE_MODE, it only can be readed.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG0_H_FCMODE</name>
              <description>Flow Control Mode. Determines when source transaction requests are serviced when the Destination Peripheral is the flow controller.
0 = Source transaction requests are servied when they occur. Data pre-fetching is enabled.
1 = Source transaction requests are not serviced until a destination transaction request occurs. Data pre-fetching is disabled.
Note: Please keep this bit 0 when Transfer Type and Flow Control is not "destination peripheral is the flow controller and transfer type is peripheral to peripheral" (TT_FC!=7).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SGR0_L</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Channel 0 low-32 bits Source Gather Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SGR0_L_SGC</name>
              <description>Source gather count. Source contiguous transfer count between successive gather boundaries.
Note: if user not define DMAC_SRC_GAT_EN, it only can be readed.</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SGR0_L_SGI</name>
              <description>Source gather interval.
Note: if user not define DMAC_SRC_GAT_EN, it only can be readed.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SGR0_H</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>Channel 0 high-32 bits Source Gather Register</description>
          <resetValue>0x00020000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SGR0_H_BLOCK_TS_L</name>
              <description>Low 16-bits of Block Transfer Size.The number programmed into CTLX.BLOCK_TS, which indicates the total number of single transactions to perform for every block transfer, is separated into low 16 bits and high part. The low 16 bits is stored into SGRx.BLOCK_TS_L while the high part is stored into DSRx.BLOCK_TS_H
Width: The width of the single transaction is determined by CTLx.SRC_TR_WIDTH.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSR0_L</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>Channel 0 low-32 bits Destination Scatter Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSR0_L_DSC</name>
              <description>Destination scatter count. Destination contiguous transfer count between successive scatter boundaries.
Note: if user not define DMAC_DST_SCA_EN, it only can be readed.</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSR0_L_DSI</name>
              <description>Destination scatter interval.Note: if user not define DMAC_DST_SCA_EN, it only can be readed.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSR0_H</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>Channel 0 high-32 bits Destination Scatter Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSR0_H_BLOCK_TS_H</name>
              <description>High part of Block Transfer SizeThe number programmed into CTLx_H.BLOCK_TS, which indicates the total number of single transactions to perform for every block transfer, is separated into low 16 bits and high 16 bits. The low 16-bits is stored into SGRx_H.BLOCK_TS_LOW while the high 16-bits is stored into DSRx_H.BLOCK_TS_HIGH
Width: The width of the single transaction is determined by CTLx_L.SRC_TR_WIDTH.b = log2 (DMAC_CHx_MAX_BLK_SIZE).
Dependencies: The maximum value of DMAC_CHx_MAX_BLK_SIZE is 2 ^ (31-log2 (DMAC_DATA_WIDTH/8)) - 1.</description>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR1</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>Channel 1 Source Address Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAR1</name>
              <description>Source Address of DMA transfer.Updated after each source transfer. The SINC field in the CTLx register determines whether the address increments, or is left unchanged on every source transfer throughout the block transfer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CURR_SAR1</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>The read back value is channel 1 source reading address at present</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURR_SAR1</name>
              <description>The read back value is source reading address at present</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAR1</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>Channel 1 Destination Address Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAR1</name>
              <description>Destination address of DMA transfer.Updated after each destination transfer. The DINC field in the CTLx register determines whether the address increments, or is left unchanged on every destination transfer throughout the block transfer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CURR_DAR1</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>The read back value is channel 1 destination writing address at present</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURR_DAR1</name>
              <description>The read back value is destination writing address at present</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LLP1_L</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>Channel 1 low-32 bits Linked List Pointer Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LLP1_L_LOC</name>
              <description>Starting Address In Memory of next LLI if block chaining is enabled. Note that the two LSBs of the starting address are not stored because the address is assumed to be aligned to a 32-bit boundary.LLI accesses are always 32-bit accesses aligned to 32-bit boundaries and cannot be changed or programmed to anything other than 32-bit.</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1_L</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>Channel 1 low-32 bits Control Register</description>
          <resetValue>0x00004801</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTL1_L_LLP_SRC_EN</name>
              <description>Block chanining is enabled on the source side only if the LLP_SRC_EN field id high and LLPx_L.LOC is non-zero; for more information,see 7.4.1.1 "Block Chaining Using Linked Lists"
Dependencies:This field does not exist if the configuration parameterDMAC_CHx_MULTI_BLK_EN is not selected or if DMAC_CHx_HC_LLP is selected; in this case, the read-back value is always 0.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_LLP_DST_EN</name>
              <description>Block chanining is enabled on the destination side only if the LLP_DST_EN field id high and LLPx_L.LOC is non-zero; for more information,see 7.4.1.1 "Block Chaining Using Linked Lists"
Dependencies:This field does not exist if the configuration parameterDMAC_CHx_MULTI_BLK_EN is not selected or if DMAC_CHx_HC_LLP is selected; in this case, the read-back value is always 0.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_TT_FC</name>
              <description>Transfer Type and Flow Control.The following transfer types are supported.
• Memory to Memory
• Memory to Peripheral
• Peripheral to Memory
• Peripheral to Peripheral
Flow Control can be assigned to the RTK_DMAC, the source peripheral, or the destination peripheral. Table 6-4 lists the decoding for this field. For more information on transfer types and flow control, refer to "Setup/Operation of RTK_DMAC Transfers".
Reset Value: 3'h0
Dependencies: If hardware handshake isn't support, then TT_FC can only be set to 3'b0. TT_FC[2] can only be read.</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_DST_SCATTER_EN</name>
              <description>Destination scatter enable bit:0 = Scatter disabled1 = Scatter enabledScatter on the destination side is applicable only when the CTLx_L.DINC bit indicates an incrementing address control and DARx should be aligned with DST_TR_WIDTH.
Dependencies: This field does not exist if DMAC_CHx_DST_SCA_EN is not selected.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_SRC_GATHER_EN</name>
              <description>Source gather enable bit:
0 = Gather disabled
1 = Gather enabled
Gather on the source side is applicable only when the CTLx_L.SINC bit indicates an incrementing address control and SARx should be aligned with SRC_TR_WIDTH.
Dependencies: This field does not exist if DMAC_CHx_SRC_GAT_EN is not selected.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_SRC_MSIZE</name>
              <description>Source Burst Transaction Length.
Number of data items, each of width CTLx_L.SRC_TR_WIDTH if source is not memory, otherwise each of width DMAC_TR_WIDTH_DEFAULT, to be read from the source every time a source burst transaction request is made from either the corresponding hardware or software handshaking interface.
Read burst transaction length on bus (ARLen) will not exceed this value, but may be less than this value. If SINC is setted to "no change", this value should not be greater than 16 to conform to the AXI protocol.
If enabled 'DMAC_CHx_MSIZE_BIGGER_THAN_FIFO_DEPTH' feature, to improve performance, can set CTLx_L.SRC_MSIZE to a high value to make DMAC send longer burst length command. But to avoid deadlock, if Source slave and Destination slave is the same slave, should not set CTLx_L.SRC_MSIZE over than FIFO_depth; Table 6-2-0 lists the decoding for this field.</description>
              <bitRange>[16:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_DEST_MSIZE</name>
              <description>Destination Burst Transaction Length.
Number of data items, each of width DATA_WIDTH, to be written to the destination every time a destination burst transaction request is made from either the corresponding hardware or software handshaking interface.
Write burst transaction length on bus (AWLen) will not exceed this value, but may be less than this value. If DINC is setted to "no change", this value should not be greater than 16 to conform to the AXI protocol.
If enabled 'DMAC_CHx_MSIZE_BIGGER_THAN_FIFO_DEPTH' feature, to improve performance, can set CTLx_L.SRC_MSIZE to a high value to make DMAC send longer burst length command. But to avoid deadlock, if Source slave and Destination slave is the same slave, should not set CTLx_L.SRC_MSIZE over than FIFO_depth; Table 6-2-1 lists the decoding for this field.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_SINC</name>
              <description>Source Address Increment. Indicates whether to increment the source address on every source transfer. If the device is fetching data from a source peripheral FIFO with a fixed address, then set this field to "No change."If source is memory appointed by CTLx_L.TT_FC, and set SINC=No change, then SRC_TR_WIDTH must be set to BUS width. And DMAC will read data from the fixed memory address until block transfer finish, but It is not recommended to read memory like this, because some memory controller not support fixed burst transaction and may transform the fixed burst transaction to incremental burst transaction.
00 = Increment
01 =Not support
1x = No change
NOTE: Incrementing is done for alignment to the next CTLx_L.SRC_TR_WIDTH boundary.</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_DINC</name>
              <description>Destination Address Increment. Indicates whether to increment destination address on every destination transfer. If your device is writing data to a destination peripheral FIFO with a fixed address, then set this field to "No change."If destination is memory appointed by CTLx_L.TT_FC, and set DINC=No change, then DST_TR_WIDTH must be set to BUS width. And DMAC will write data to the fixed memory address until block transfer finish, but It is not recommended to write memory like this, because some memory controller not support fixed burst transaction and may transform the fixed burst transaction to incremental burst transaction.
00 = Increment
01=Not Support
1x = No change
NOTE: Incrementing is done for alignment to the next CTLx_L.DST_TR_WIDTH boundary.</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_SRC_TR_WIDTH</name>
              <description>Source Transfer Width.
Table 6-3 lists the decoding for this field.It can't be mapped to AXI bus data width directly. Since AXI bus data width is fixed (such as 32bit/64bit), AXI use byte enable signal for byte/half word transfer (still burst). So, the SRC_TR_WIDTH is only used for total block data size calculation and streaming mode byte/half word transfer (for FIFO transfer).
Note: SRC_TR_WIDTH must not be bigger than BUS width.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_DST_TR_WIDTH</name>
              <description>Destination Transfer Width.Table 6-3 lists the decoding for this field. It can't be mapped to AXI bus data width directly. For a non-memory peripheral, typically the peripheral (destination) FIFO width.Note: DST_TR_WIDTH must not be bigger than BUS width</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL1_L_INT_EN</name>
              <description>Interrupt Enable Bit. If set, then all interrupt-generating sources are enabled. Functions as a global mask bit for all interrupts for the channel; raw* interrupt registers still assert if CTLx_L.INT_EN = 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1_H</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>Channel 1 high-32 bits Control Register</description>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTL1_H_TRANS_DATA_CNT</name>
              <description>Data Transfered Count.Once the transfer starts, the read-back value is the total number of data bytes already write to destination memory or peripheral.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTL1_H_BLOCK_TS</name>
              <description>Block Transfer Size.When the RTK_DMAC is the flow controller, the user writes this field before the channel is enabled in order to indicate the block size. The number programmed into BLOCK_TS indicates the total number of single transactions to perform for every block transfer; a single transaction is mapped to a single AXI beat.
This field is write-only, number of block size programmed into CTLx_H.BLOCK_TS can be read from SGRx_H.BLOCK_TS_L and DSRx_H.BLOCK_TS_H.
Width: The width of the single transaction is determined by CTLX_L.SRC_TR_WIDTH.When the source or destination peripheral is assigned as the flow controller, then the maximum block size that can be read back saturates at DMAC_CHx_MAX_BLK_SIZE, but the actual block size can be greater.
b = log2(DMAC_CHx_MAX_BLK_SIZE + 1) -1</description>
              <bitRange>[20:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
