Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CFG7_L</name>
          <addressOffset>0x000002A8</addressOffset>
          <size>32</size>
          <description>Channel 7 low-32 bits Configuration Register</description>
          <resetValue>0x00000E07</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG7_L_RELOAD_DST</name>
              <description>Automatic Destination Reload. The DARx register can be automatically reloaded from its initial value at the end of every block for multi-block transfers. A new block transfer is then initiated.This register does not exist if the configuration parameter DMAC_CHx_MULTI_BLK_EN is not selected; in this case, the read-back value is always 0.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_L_RELOAD_SRC</name>
              <description>Automatic Source Reload. The SARx register can be automatically reloaded from its initial value at the end of every block for multi-block transfers. A new block transfer is then initiated.
This field does not exist if the configuration parameter DMAC_CHx_MULTI_BLK_EN is not selected; in this case, the read-back value is always 0.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_L_SRC_HS_POL</name>
              <description>Source Handshaking Interface Polarity.
0 = Active high
1 = Active low</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_L_DST_HS_POL</name>
              <description>Destination Handshaking Interface Polarity.
0 = Active high
1 = Active low
For information on this, refer to "Handshaking Interface" .</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_L_HS_SEL_SRC</name>
              <description>Source Software or Hardware Handshaking Select. This register selects which of the handshaking interfaces - hardware or software - is active for source requests on this channel.
0 = Hardware handshaking interface. Software-initiated transaction requests are ignored.
1 = Software handshaking interface. Hardware-initiated transaction requests are ignored. If the source peripheral is memory, then this bit is ignored.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_L_HS_SEL_DST</name>
              <description>Destination Software or Hardware Handshaking Select. This register selects which of the handshaking interfaces - hardware or software - is active for destination requests on this channel.
0 = Hardware handshaking interface. Software-initiated transaction requests are ignored.
1 = Software handshaking interface. Hardware- initiated transaction requests are ignored. If the destination peripheral is memory, then this bit is ignored.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_L_FIFO_EMPTY</name>
              <description>Indicates if there is data left in the channel FIFO.
1 = Channel FIFO empty
0 = Channel FIFO not empty</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG7_L_CH_SUSP</name>
              <description>Channel Suspend. Suspends all DMA data transfers from the source until this bit is cleared. There is no guarantee that the current transaction will complete. Can also be used in conjunction with CFGx_l.INACTIVE to cleanly disable a channel without losing any data.
0 = Not suspended
1 = Suspend DMA transfer from the source.
This field will be reset to 0 after "Disabling a Channel Prior to Transfer Completion" automatically by hardware.For more information, refer to "7.7 Disabling a Channel Prior to Transfer Completion" . 
Note: if user not define DMAC_CH*_SUPPORT_SUSPEND, it only can be readed.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_L_CH_PRIOR</name>
              <description>Channel priority.
RTK DMAC supports three kinds of channel priority now, fixed priority, round robin priority and programmable priority. The default way is fixed priority to reduce area, and channel0 has the highest priority, channel15 has the lowest priority. Changing the definition of parameter FIX_PRIORITY or Programmable_PRIORITY can change priority way.
If RTK DMAC is configured to support Programmable priority, this field will be used to set priority between channels. CH_PRIOR's legal value is 0 ~ (DMAC_NUM_CHANNELS-1), and 0 is the highest priority value, (DMAC_NUM_CHANNELS-1) is the lowest priroty value. If more than one channel are set with the same priroty value, the channel with small channel number index has higher priority.
If DMAC is configured to support fix priority or round-robin priority, this field is not exist.
Note: if user not define ProgrammablePriority, it only can be readed.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_L_DST_PCTL_OVER</name>
              <description>DMA destination bus protocol finish, indicating the current write command has finished.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG7_L_SRC_PCTL_OVER</name>
              <description>DMA Source bus protocol finish, indicating the current read command has finished.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG7_L_INACTIVE</name>
              <description>Indicates if the channel is inactive. Can be used in conjunction with CFGx_L.CH_SUSP to cleanly disable a channel when destination is peripheral. For more information, refer to "Disabling a Channel Prior to Transfer Completion" .
1 = Channel Inactive for axi interface
0 = Channel not Inactive for axi interface</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG7_H</name>
          <addressOffset>0x000002AC</addressOffset>
          <size>32</size>
          <description>Channel 7 high-32 bits Configuration Register</description>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG7_H_Extended_DEST_PER1</name>
              <description>The extened 4th bit of DEST_PER when hardware handshake interfaces number is configured to 32.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_H_Extended_SRC_PER1</name>
              <description>The extened 4th bit of SRC_PER when hardware handshake interfaces number is configured to 32.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_H_DEST_PER</name>
              <description>Assigns a hardware handshaking interface(0 - DMAC_NUM_HS_INT-1) to the destination of channel x if the FGx.HS_SEL_DST field is 0; otherwise, this field is ignored. The channel can then communicate with the destinationperipheral connected to that interface through the assignedhardware handshaking interface.
NOTE1: For correct DMA operation, only one peripheral (sourceor destination) should be assigned to the same handshaking interface
NOTE2: This field does not exist if the configuration parameterDMAC_NUM_HS_INT is set to 0.</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_H_SRC_PER</name>
              <description>Assigns a hardware handshaking interface(0 - DMAC_NUM_HS_INT-1) to the source of channel x if the CFGx.HS_SEL_SRC field is 0; otherwise, this field is ignored. The channel can then communicate with the source peripheral connected to that interface through the assigned hardware handshaking interface.
NOTE1: For correct RTK_DMAC operation, only one peripheral (source or destination) should be assigned to the same handshaking interface.
NOTE2: This field does not exist if the configuration parameter DMAC_NUM_HS_INT is set to 0.</description>
              <bitRange>[10:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_H_PROTCTL</name>
              <description>Protection Control.Set the bit 35 to 0 will enable the channel secure DMA transfer.
Set the bit 35 to 1 will enable the channel non-secure DMAC transfer.
Note: if user not define DMAC_SECURE_MODE, it only can be readed.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7_H_FCMODE</name>
              <description>Flow Control Mode. Determines when source transaction requests are serviced when the Destination Peripheral is the flow controller.
0 = Source transaction requests are servied when they occur. Data pre-fetching is enabled.
1 = Source transaction requests are not serviced until a destination transaction request occurs. Data pre-fetching is disabled.
Note: Please keep this bit 0 when Transfer Type and Flow Control is not "destination peripheral is the flow controller and transfer type is peripheral to peripheral" (TT_FC!=7).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SGR7_L</name>
          <addressOffset>0x000002B0</addressOffset>
          <size>32</size>
          <description>Channel 7 low-32 bits Source Gather Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SGR7_L_SGC</name>
              <description>Source gather count. Source contiguous transfer count between successive gather boundaries.
Note: if user not define DMAC_SRC_GAT_EN, it only can be readed.</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SGR7_L_SGI</name>
              <description>Source gather interval.
Note: if user not define DMAC_SRC_GAT_EN, it only can be readed.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SGR7_H</name>
          <addressOffset>0x000002B4</addressOffset>
          <size>32</size>
          <description>Channel 7 high-32 bits Source Gather Register</description>
          <resetValue>0x00020000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SGR7_H_BLOCK_TS_L</name>
              <description>Low 16-bits of Block Transfer Size.The number programmed into CTLX.BLOCK_TS, which indicates the total number of single transactions to perform for every block transfer, is separated into low 16 bits and high part. The low 16 bits is stored into SGRx.BLOCK_TS_L while the high part is stored into DSRx.BLOCK_TS_H
Width: The width of the single transaction is determined by CTLx.SRC_TR_WIDTH.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSR7_L</name>
          <addressOffset>0x000002B8</addressOffset>
          <size>32</size>
          <description>Channel 7 low-32 bits Destination Scatter Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSR7_L_DSC</name>
              <description>Destination scatter count. Destination contiguous transfer count between successive scatter boundaries.
Note: if user not define DMAC_DST_SCA_EN, it only can be readed.</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSR7_L_DSI</name>
              <description>Destination scatter interval.Note: if user not define DMAC_DST_SCA_EN, it only can be readed.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSR7_H</name>
          <addressOffset>0x000002BC</addressOffset>
          <size>32</size>
          <description>Channel 7 high-32 bits Destination Scatter Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSR7_H_BLOCK_TS_H</name>
              <description>High part of Block Transfer SizeThe number programmed into CTLx_H.BLOCK_TS, which indicates the total number of single transactions to perform for every block transfer, is separated into low 16 bits and high 16 bits. The low 16-bits is stored into SGRx_H.BLOCK_TS_LOW while the high 16-bits is stored into DSRx_H.BLOCK_TS_HIGH
Width: The width of the single transaction is determined by CTLx_L.SRC_TR_WIDTH.b = log2 (DMAC_CHx_MAX_BLK_SIZE).
Dependencies: The maximum value of DMAC_CHx_MAX_BLK_SIZE is 2 ^ (31-log2 (DMAC_DATA_WIDTH/8)) - 1.</description>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWTFR_L</name>
          <addressOffset>0x000002C0</addressOffset>
          <size>32</size>
          <description>Raw Status for IntTfr Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAWTFR_L_Raw_Tfr</name>
              <description>Raw interrupt status for chn0-chn15</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWBLOCK_L</name>
          <addressOffset>0x000002C8</addressOffset>
          <size>32</size>
          <description>Raw Status for IntBlock Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAWBLOCK_L_Raw_Block</name>
              <description>Raw interrupt status for chn0-chn15</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWERR_L</name>
          <addressOffset>0x000002E0</addressOffset>
          <size>32</size>
          <description>Raw Status for IntErr Interrupt(protocol error)</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAWERR_L_Raw_Err</name>
              <description>Raw interrupt status for chn0-chn15. (Protocol error)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWERR_H</name>
          <addressOffset>0x000002E4</addressOffset>
          <size>32</size>
          <description>Raw Status for non-secure access secure register error if defined</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAWERR_H_Raw_Err</name>
              <description>Raw interrupt status. (Non-secure access secure register error) if DMAC_SECURE_MODE has been defined; else it is reserved.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSTFR_L</name>
          <addressOffset>0x000002E8</addressOffset>
          <size>32</size>
          <description>Status for IntTfr Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUSTFR_L_Status_Tfr</name>
              <description>Interrupt status for chn0-chn15</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSBLOCK_L</name>
          <addressOffset>0x000002F0</addressOffset>
          <size>32</size>
          <description>Status for IntBlock Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUSBLOCK_L_Status_Block</name>
              <description>Interrupt status for chn0-chn15</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSERR_L</name>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <description>Status for IntErr Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUSERR_L_Status_Err</name>
              <description>Interrupt status for chn0-chn15. (Protocol error)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSERR_H</name>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <description>Status for non-secure access secure register error if defined</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUSERR_H_Status_Err</name>
              <description>Interrupt status. (Non-secure access secure register error, Sec Error) if DMAC_SECURE_MODE has been defined; else it is reserved.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKTFR_L</name>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <description>Mask for IntTfr Interrupt (chn0-7)</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASKTFR_L_INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable(chn0-chn7)
0 = write disabled
1 = write enabled</description>
              <bitRange>[15:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MASKTFR_L_INT_MASK</name>
              <description>Interrupt Mask(chn0-chn7)
0 = masked
1 = unmasked</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKBLOCK_L</name>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <description>Mask for IntBlock Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASKBLOCK_L_INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable(chn0-chn7)
0 = write disabled
1 = write enabled</description>
              <bitRange>[15:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MASKBLOCK_L_INT_MASK</name>
              <description>Interrupt Mask(chn0-chn7)
0 = masked
1 = unmasked</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKERR_L</name>
          <addressOffset>0x00000330</addressOffset>
          <size>32</size>
          <description>Mask for IntErr Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASKERR_L_INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable(chn0-chn7)
0 = write disabled
1 = write enabled</description>
              <bitRange>[15:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MASKERR_L_INT_MASK</name>
              <description>Interrupt Mask(chn0-chn7)
0 = masked
1 = unmasked</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKERR_H</name>
          <addressOffset>0x00000334</addressOffset>
          <size>32</size>
          <description>Mask for non-secure access secure register error if defined</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASKERR_H_INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable(chn0-chn7)
0 = write disabled
1 = write enabled
These bits only exist when DMAC_ SECURE_MODE has beed defined</description>
              <bitRange>[15:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>MASKERR_H_INT_MASK</name>
              <description>Interrupt Mask(chn0-chn7)
0 = masked
1 = unmasked
These bits only exist when DMAC_ SECURE_MODE has beed defined</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARTFR_L</name>
          <addressOffset>0x00000338</addressOffset>
          <size>32</size>
          <description>Clear for IntTfr Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLEARTFR_L_Clear_Tfr</name>
              <description>Interrupt clear for chn0-chn15
0 = no effect
1= clear interrupt</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
