Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>DMA_COMP_PARAMS_4_L</name>
          <addressOffset>0x000003D8</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x2003C81B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH4_FIFO_DEPTH</name>
              <description>The value of this register is derived from the DMAC_CH4_FIFO_DEPTH parameter. Default value is 0x0.
0x0 = 8 bytes
0x1 = 16
0x2 = 32
0x3 = 64
0x4 = 128
0x5 = Reserved
0x6 = Reserved
0x7 = Reserved</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_MAX_MULT_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH4_MULT_SIZE parameter. Maxium burst transaction size.
CH4_MAX_MULT_SIZE = log2(256/DMAC_DATA_WIDTH)
0x3 = 32 bits
0x2 = 64 bits
0x1 = 128 bits</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_FC</name>
              <description>The value of this register is derived from the DMAC_CH4_FC parameter.
0x0 = DMA
0x1 = SRC
0x2 = DST
0x3 = ANY</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_HC_LLP</name>
              <description>The value of this register is derived from the DMAC_CH4_HC_LLP parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_CTL_WB_EN</name>
              <description>The value of this register is derived from the DMAC_CH4_CTL_WB_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_MULTI_BLK_EN</name>
              <description>The value of this register is derived from the DMAC_CH4_MULTI_BLK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_LOCK_EN</name>
              <description>The value of this register is derived from the DMAC_CH4_LOCK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_SRC_GAT_EN</name>
              <description>The value of this register is derived from the DMAC_CH4_SRC_GAT_EN parameter. For a description of this parameter, refer to page 112.0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_DST_SCA_EN</name>
              <description>The value of this register is derived from the DMAC_CH4_DST_SCA_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_STAT_SRC</name>
              <description>The value of this register is derived from the DMAC_CH4_STAT_SRC parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_STAT_DST</name>
              <description>The value of this register is derived from the DMAC_CH4_STAT_DST parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_STW</name>
              <description>The value of this register is derived from the DMAC_CH4_STW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_DTW</name>
              <description>The value of this register is derived from the DMAC_CH4_DTW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_4_H</name>
          <addressOffset>0x000003DC</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x2003CB1B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH3_FIFO_DEPTH</name>
              <description>The value of this register is derived from the DMAC_CH3_FIFO_DEPTH parameter. Default value is 0x0.
0x0 = 8 bytes
0x1 = 16
0x2 = 32
0x3 = 64
0x4 = 128
0x5 = Reserved
0x6 = Reserved
0x7 = Reserved</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_MAX_MULT_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH3_MULT_SIZE parameter. Maxium burst transaction size.
CH3_MAX_MULT_SIZE = log2(256/DMAC_DATA_WIDTH)
0x3 = 32 bits
0x2 = 64 bits
0x1 = 128 bits</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_FC</name>
              <description>The value of this register is derived from the DMAC_CH3_FC parameter.
0x0 = DMA
0x1 = SRC
0x2 = DST
0x3 = ANY</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_HC_LLP</name>
              <description>The value of this register is derived from the DMAC_CH3_HC_LLP parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_CTL_WB_EN</name>
              <description>The value of this register is derived from the DMAC_CH3_CTL_WB_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_MULTI_BLK_EN</name>
              <description>The value of this register is derived from the DMAC_CH3_MULTI_BLK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_LOCK_EN</name>
              <description>The value of this register is derived from the DMAC_CH3_LOCK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SRC_GAT_EN</name>
              <description>The value of this register is derived from the DMAC_CH3_SRC_GAT_EN parameter.
 0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_DST_SCA_EN</name>
              <description>The value of this register is derived from the DMAC_CH3_DST_SCA_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_STAT_SRC</name>
              <description>The value of this register is derived from the DMAC_CH3_STAT_SRC parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_STAT_DST</name>
              <description>The value of this register is derived from the DMAC_CH3_STAT_DST parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_STW</name>
              <description>The value of this register is derived from the DMAC_CH3_STW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_DTW</name>
              <description>The value of this register is derived from the DMAC_CH3_DTW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_3_L</name>
          <addressOffset>0x000003E0</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x2003CB1B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH2_FIFO_DEPTH</name>
              <description>The value of this register is derived from the DMAC_CH2_FIFO_DEPTH parameter. Default value is 0x0.
0x0 = 8 bytes
0x1 = 16
0x2 = 32
0x3 = 64
0x4 = 128
0x5 = Reserved
0x6 = Reserved
0x7 = Reserved</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_MAX_MULT_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH2_MULT_SIZE parameter. Maxium burst transaction size.
CH2_MAX_MULT_SIZE = log2(256/DMAC_DATA_WIDTH)
0x3 = 32 bits
0x2 = 64 bits
0x1 = 128 bits</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_FC</name>
              <description>The value of this register is derived from the DMAC_CH2_FC parameter.
0x0 = DMA
0x1 = SRC
0x2 = DST
0x3 = ANY</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_HC_LLP</name>
              <description>The value of this register is derived from the DMAC_CH2_HC_LLP parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_CTL_WB_EN</name>
              <description>The value of this register is derived from the DMAC_CH2_CTL_WB_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_MULTI_BLK_EN</name>
              <description>The value of this register is derived from the DMAC_CH2_MULTI_BLK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_LOCK_EN</name>
              <description>The value of this register is derived from the DMAC_CH2_LOCK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_SRC_GAT_EN</name>
              <description>The value of this register is derived from the DMAC_CH2_SRC_GAT_EN parameter. For a description of this parameter, refer to page 112.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_DST_SCA_EN</name>
              <description>The value of this register is derived from the DMAC_CH2_DST_SCA_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_STAT_SRC</name>
              <description>The value of this register is derived from the DMAC_CH2_STAT_SRC parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_STAT_DST</name>
              <description>The value of this register is derived from the DMAC_CH2_STAT_DST parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_STW</name>
              <description>The value of this register is derived from the DMAC_CH2_STW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_DTW</name>
              <description>The value of this register is derived from the DMAC_CH2_DTW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_3_H</name>
          <addressOffset>0x000003E4</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x4003CB1B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH1_FIFO_DEPTH</name>
              <description>The value of this register is derived from the DMAC_CH1_FIFO_DEPTH parameter. Default value is 0x0.
0x0 = 8 bytes
0x1 = 16
0x2 = 32
0x3 = 64
0x4 = 128
0x5 = Reserved
0x6 = Reserved
0x7 = Reserved</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_MAX_MULT_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH1_MULT_SIZE parameter. Maxium burst transaction size.
CH1_MAX_MULT_SIZE = log2(256/DMAC_DATA_WIDTH)
0x3 = 32 bits
0x2 = 64 bits
0x1 = 128 bits</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_FC</name>
              <description>The value of this register is derived from the DMAC_CH1_FC parameter.
0x0 = DMA
0x1 = SRC
0x2 = DST
0x3 = ANY</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_HC_LLP</name>
              <description>The value of this register is derived from the DMAC_CH1_HC_LLP parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_CTL_WB_EN</name>
              <description>The value of this register is derived from the DMAC_CH1_CTL_WB_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_MULTI_BLK_EN</name>
              <description>The value of this register is derived from the DMAC_CH1_MULTI_BLK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_LOCK_EN</name>
              <description>The value of this register is derived from the DMAC_CH1_LOCK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_SRC_GAT_EN</name>
              <description>The value of this register is derived from the DMAC_CH1_SRC_GAT_EN parameter.
 0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_DST_SCA_EN</name>
              <description>The value of this register is derived from the DMAC_CH1_DST_SCA_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_STAT_SRC</name>
              <description>The value of this register is derived from the DMAC_CH1_STAT_SRC parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_STAT_DST</name>
              <description>The value of this register is derived from the DMAC_CH1_STAT_DST parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_STW</name>
              <description>The value of this register is derived from the DMAC_CH1_STW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_DTW</name>
              <description>The value of this register is derived from the DMAC_CH1_DTW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_2_L</name>
          <addressOffset>0x000003E8</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x4003CB1B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0_FIFO_DEPTH</name>
              <description>The value of this register is derived from the DMAC_CH0_FIFO_DEPTH parameter. Default value is 0x0.
0x0 = 8 bytes
0x1 = 16
0x2 = 32
0x3 = 64
0x4 = 128
0x5 = Reserved
0x6 = Reserved
0x7 = Reserved</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_MAX_MULT_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH0_MULT_SIZE parameter. Maxium burst transaction size.
CH0_MAX_MULT_SIZE = log2(256/DMAC_DATA_WIDTH)
0x3 = 32 bits
0x2 = 64 bits
0x1 = 128 bits</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_FC</name>
              <description>The value of this register is derived from the DMAC_CH0_FC parameter.
0x0 = DMA
0x1 = SRC
0x2 = DST
0x3 = ANY</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_HC_LLP</name>
              <description>The value of this register is derived from the DMAC_CH0_HC_LLP parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_CTL_WB_EN</name>
              <description>The value of this register is derived from the DMAC_CH0_CTL_WB_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_MULTI_BLK_EN</name>
              <description>The value of this register is derived from the DMAC_CH0_MULTI_BLK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_LOCK_EN</name>
              <description>The value of this register is derived from the DMAC_CH0_LOCK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_SRC_GAT_EN</name>
              <description>The value of this register is derived from the DMAC_CH0_SRC_GAT_EN parameter. For a description of this parameter, refer to page 112.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_DST_SCA_EN</name>
              <description>The value of this register is derived from the DMAC_CH0_DST_SCA_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_STAT_SRC</name>
              <description>The value of this register is derived from the DMAC_CH0_STAT_SRC parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_STAT_DST</name>
              <description>The value of this register is derived from the DMAC_CH0_STAT_DST parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_STW</name>
              <description>The value of this register is derived from the DMAC_CH0_STW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_DTW</name>
              <description>The value of this register is derived from the DMAC_CH0_DTW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
