Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>DMA_COMP_PARAMS_2_H</name>
          <addressOffset>0x000003EC</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH7_MULTI_BLK_TYPE</name>
              <description>The values of these bit fields are derived from the DMAC_CHx_MULTI_BLK_TYPE parameter.
0x0 = NO_HARDCODE
0x1 = CONT_RELOAD
0x2 = RELOAD_CONT
0x3 = RELOAD_RELOAD
0x4 = CONT_LLP
0x5 = RELOAD_LLP
0x6 = LLP_CONT
0x7 = LLP_RELOAD
0x8 = LLP_LLP</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_MULTI_BLK_TYPE</name>
              <description>The values of these bit fields are derived from the DMAC_CHx_MULTI_BLK_TYPE parameter.
0x0 = NO_HARDCODE
0x1 = CONT_RELOAD
0x2 = RELOAD_CONT
0x3 = RELOAD_RELOAD
0x4 = CONT_LLP
0x5 = RELOAD_LLP
0x6 = LLP_CONT
0x7 = LLP_RELOAD
0x8 = LLP_LLP</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_MULTI_BLK_TYPE</name>
              <description>The values of these bit fields are derived from the DMAC_CHx_MULTI_BLK_TYPE parameter.
0x0 = NO_HARDCODE
0x1 = CONT_RELOAD
0x2 = RELOAD_CONT
0x3 = RELOAD_RELOAD
0x4 = CONT_LLP
0x5 = RELOAD_LLP
0x6 = LLP_CONT
0x7 = LLP_RELOAD
0x8 = LLP_LLP</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_MULTI_BLK_TYPE</name>
              <description>The values of these bit fields are derived from the DMAC_CHx_MULTI_BLK_TYPE parameter.
0x0 = NO_HARDCODE
0x1 = CONT_RELOAD
0x2 = RELOAD_CONT
0x3 = RELOAD_RELOAD
0x4 = CONT_LLP
0x5 = RELOAD_LLP
0x6 = LLP_CONT
0x7 = LLP_RELOAD
0x8 = LLP_LLP</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_MULTI_BLK_TYPE</name>
              <description>The values of these bit fields are derived from the DMAC_CHx_MULTI_BLK_TYPE parameter.
0x0 = NO_HARDCODE
0x1 = CONT_RELOAD
0x2 = RELOAD_CONT
0x3 = RELOAD_RELOAD
0x4 = CONT_LLP
0x5 = RELOAD_LLP
0x6 = LLP_CONT
0x7 = LLP_RELOAD
0x8 = LLP_LLP</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_MULTI_BLK_TYPE</name>
              <description>The values of these bit fields are derived from the DMAC_CHx_MULTI_BLK_TYPE parameter.
0x0 = NO_HARDCODE
0x1 = CONT_RELOAD
0x2 = RELOAD_CONT
0x3 = RELOAD_RELOAD
0x4 = CONT_LLP
0x5 = RELOAD_LLP
0x6 = LLP_CONT
0x7 = LLP_RELOAD
0x8 = LLP_LLP</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_MULTI_BLK_TYPE</name>
              <description>The values of these bit fields are derived from the DMAC_CHx_MULTI_BLK_TYPE parameter.
0x0 = NO_HARDCODE
0x1 = CONT_RELOAD
0x2 = RELOAD_CONT
0x3 = RELOAD_RELOAD
0x4 = CONT_LLP
0x5 = RELOAD_LLP
0x6 = LLP_CONT
0x7 = LLP_RELOAD
0x8 = LLP_LLP</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_MULTI_BLK_TYPE</name>
              <description>The values of these bit fields are derived from the DMAC_CHx_MULTI_BLK_TYPE parameter.
0x0 = NO_HARDCODE
0x1 = CONT_RELOAD
0x2 = RELOAD_CONT
0x3 = RELOAD_RELOAD
0x4 = CONT_LLP
0x5 = RELOAD_LLP
0x6 = LLP_CONT
0x7 = LLP_RELOAD
0x8 = LLP_LLP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_1_L</name>
          <addressOffset>0x000003F0</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x15151515</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH3_MAX_BLK_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH3_MAX_BLK_SIZE from config_form.vh
CH3_MAX_BLK_SIZE = log2(DMAC_CH3_MAX_BLK_SIZE) + 1</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_MAX_BLK_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH2_MAX_BLK_SIZE from config_form.vh
CH2_MAX_BLK_SIZE = log2(DMAC_CH2_MAX_BLK_SIZE) + 1</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_MAX_BLK_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH1_MAX_BLK_SIZE from config_form.vh
CH1_MAX_BLK_SIZE = log2(DMAC_CH1_MAX_BLK_SIZE) + 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_MAX_BLK_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH0_MAX_BLK_SIZE from config_form.vh
CH0_MAX_BLK_SIZE = log2(DMAC_CH0_MAX_BLK_SIZE) + 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_1_H</name>
          <addressOffset>0x000003F4</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x0F8005C0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIGH_BIT_NUM_HS_INT3</name>
              <description>Number of hardware handshake interfaces. If it is 128, this bit read value is 1.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIGH_BIT_NUM_HS_INT2</name>
              <description>Number of hardware handshake interfaces. If it is greater than 63 and less than 128, this bit read value is 1.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HIGH_BIT_NUM_HS_INT1</name>
              <description>Number of hardware handshake interfaces. If it is greater than 31 and less than 64, this bit read value is 1.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATIC_ENDIAN_SELECT</name>
              <description>The value of this register is derived from the DMAC_STATIC_ENDIAN_SELECT parameter.
0 = FALSE (dynamic endian fixed)
1 = TRUE (not supported)</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADD_ENCODED_PARAMS</name>
              <description>The value of this register is derived from the DMAC_ADD_ENCODED_PARAMS parameter.
0 = FALSE
1 = TRUE</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_HS_INT</name>
              <description>Number of hardware handshake interfaces. The value of this register is derived from the DMAC_NUM_HS_INT parameter.
NUM_HAS_INT = DMAC_NUM_HS_INT[4:0]
0x00 = 0
... 
0x10 = 16</description>
              <bitRange>[26:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>M2_DATA_WIDTH</name>
              <description>AXI Master2 data width. The value of this register is derived from the DMAC_M2_DATA_WIDTH parameter. Master2 data width should be equal to that of Master 1.
M2_DATA_WIDTH = log2(DMAC_DATA_WIDTH/32)
0x0 = 32 bits
0x1 = 64 bits 
0x2 = 128 bits
0x3 = Reserved</description>
              <bitRange>[17:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>M1_DATA_WIDTH</name>
              <description>AXI Master1 data width. The value of this register is derived from the DMAC_M1_DATA_WIDTH parameter. Master1 data width should be equal to that of Master 2.
M1_DATA_WIDTH = log2(DMAC_DATA_WIDTH/32)
0x0 = 32 bits
0x1 = 64 bits
0x2 = 128 bits
0x3 = Reserved</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>S_DATA_WIDTH</name>
              <description>APB slave interface data width.The value of this register is derived from the DMAC_S_DATA_WIDTH parameter. The width is fixed to 32 bits for now.
S_DATA_WIDTH = log2(DMAC_DATA_WIDTH/32)
0x0 = 32 bits
0x1 = Reserved
0x2 = Reserved
0x3 = Reserved</description>
              <bitRange>[13:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_MASTER_INT</name>
              <description>Number of master interface. The value of this register is derived from the DMAC_NUM_MASTER_INT parameter. This value is fixed to 1 (only 2 AXI masters supported now.)
0x0 = Reserved
0x1 = 2
0x2 = Reserved
0x3 = Reserved</description>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_CHANNELS</name>
              <description>Number of channels. The value of this register is derived from the DMAC_NUM_CHASNNELS parameter.
NUM_CHANNELS = DMAC_NUM_CHASNNELS -1
0x0 = 1
... 
0xf = 16</description>
              <bitRange>[9:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_IO</name>
              <description>Interrupt output format.The value of this register is derived from the DMAC_INTR_IO parameter.
0x0 = ALL
0x1 = TYPE
0x2 = COMBINED
0x3 = reserved</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMPONENT_ID_REGS_L</name>
          <addressOffset>0x000003F8</addressOffset>
          <size>32</size>
          <description>DMAC ID</description>
          <resetValue>0x20240513</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_COMPONENT_ID</name>
              <description>DMAC ID (release_date_. Configure it in config form.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMPONENT_ID_REGS_H</name>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
          <description>It is obtained from the high 32 bits from git logs in git server.</description>
          <resetValue>0x482F5D83</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTL_GIT_VER</name>
              <description>It is obtained from the high 32 bits from git logs in git server.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
