Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CLEARBLOCK_L</name>
          <addressOffset>0x00000340</addressOffset>
          <size>32</size>
          <description>Clear for IntBlock Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLEARBLOCK_L_Clear_Block</name>
              <description>Interrupt clear for chn0-chn15</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARERR_L</name>
          <addressOffset>0x00000358</addressOffset>
          <size>32</size>
          <description>Clear for IntErr Interrupt</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLEARERR_L_Clear_Protocol_Error</name>
              <description>Interrupt clear for chn0-chn15. (Protocol error)</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARERR_H</name>
          <addressOffset>0x0000035C</addressOffset>
          <size>32</size>
          <description>Clear for non-secure access secure register error if defined</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLEARERR_H_Clear_Sec_Error</name>
              <description>Interrupt clear for chn0-chn15 (Non-secure access secure register error, Sec Error) when DMAC_SECURE_MODE has beed defined, else it is reserved;</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSINT_L</name>
          <addressOffset>0x00000360</addressOffset>
          <size>32</size>
          <description>Combined Interrupt Sataus Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUSINT_L_Error</name>
              <description>OR of the contents of StatusErr register.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUSINT_L_Block</name>
              <description>OR of the contents of StatusBlock register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUSINT_L_Tfr</name>
              <description>OR of the contents of StatusTfr register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACFGREG_L</name>
          <addressOffset>0x00000398</addressOffset>
          <size>32</size>
          <description>DMA low-32 bits Configuration Register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMACFGREG_L_DMA_EN</name>
              <description>RTK_DMAC Enable bit.
0 = RTK_DMAC Disabled
1 = RTK_DMAC Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHENREG_L_1</name>
          <addressOffset>0x000003A0</addressOffset>
          <size>32</size>
          <description>DMA low-32 bits Channel Enable Register if configed chn number is less than or equal to 8</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHENREG_L_1_CH_EN_WE</name>
              <description>Channel enable write enable.</description>
              <bitRange>[15:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHENREG_L_1_CH_EN</name>
              <description>Enables/Disables the channel. Setting this bit enables a channel; clearing this bit disables the channel.
0 = Disable the Channel
1 = Enable the Channel
The CHENREG_L.CH_EN bit is automatically cleared by hardware to disable the channel after the last AXI transfer of the DMA transfer to the destination has completed. Software can therefore poll this bit to determine when this channel is free for a new DMA transfer.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAIDREG_L</name>
          <addressOffset>0x000003A8</addressOffset>
          <size>32</size>
          <description>DMA low-32 bits ID Register</description>
          <resetValue>0x20240513</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAIDREG_L_DMA_ID</name>
              <description>Hardcoded RTK_DMAC Peripheral ID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAOSNUM_L</name>
          <addressOffset>0x000003B8</addressOffset>
          <size>32</size>
          <description>DMA low-32 bits Outstanding Number Register</description>
          <resetValue>0x00000408</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAOSNUM_L_OSW</name>
              <description>If the OSW number of DMAC is programmable, this register is writable. And DMAC will not issue new write command until OSW of DMAC is less than this value. If the OSW number is not programmable, this value is read as "4". And DMAC's OSW is fixed to 4.
If user defines OSW_CNT, b = log2(OSW_CNT +1) +7; otherwise, b = log2(4+1) +7.
bits 15: b+1 do not exist and read back as 0.
Note: If write 0 to this register, DMAC can not issue any new write commands.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAOSNUM_L_OSR</name>
              <description>If the OSR number of DMAC is programmable, this register is writable. And DMAC will not issue new read command until OSR of DMAC is less than this value. If the OSR number is not programmable, this value is read as "channel number". And DMAC does not limit the OSR number.
If user defines OSR_CNT, b = log2(OSR_CNT +1); otherwise, b = log2(DMAH_NUM_CHANNELS +1)
bits 7: b+1 do not exist and read back as 0.
Note: If write 0 to this register, DMAC can not issue any new read commands.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_6_L</name>
          <addressOffset>0x000003C8</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x15151515</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH7_MAX_BLK_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH7_MAX_BLK_SIZE from config_form.vh
CH7_MAX_BLK_SIZE = log2(DMAC_CH7_MAX_BLK_SIZE) + 1</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_MAX_BLK_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH6_MAX_BLK_SIZE from config_form.vh
CH6_MAX_BLK_SIZE = log2(DMAC_CH6_MAX_BLK_SIZE) + 1</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_MAX_BLK_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH5_MAX_BLK_SIZE from config_form.vh 
CH5_MAX_BLK_SIZE = log2(DMAC_CH5_MAX_BLK_SIZE) + 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_MAX_BLK_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH4_MAX_BLK_SIZE from config_form.vh 
CH4_MAX_BLK_SIZE = log2(DMAC_CH4_MAX_BLK_SIZE) + 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_6_H</name>
          <addressOffset>0x000003CC</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x2003C81B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH7_FIFO_DEPTH</name>
              <description>The value of this register is derived from the DMAC_CH7_FIFO_DEPTH parameter. Default value is 0x0.
CH7_FIFO_DEPTH = log2(DMAC_CH7_FIFO_DEPTH/8)
0x0 = 8 bytes
0x1 = 16
0x2 = 32
0x3 = 64
0x4 = 128
0x5 = Reserved
0x6 = Reserved
0x7 = Reserved</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_MAX_MULT_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH7_MULT_SIZE parameter. Maxium burst transaction size.
CH7_MAX_MULT_SIZE = log2(256/DMAC_DATA_WIDTH)
0x3 = 32 bits
0x2 = 64 bits
0x1 = 128 bits</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_FC</name>
              <description>The value of this register is derived from the DMAC_CH7_FC parameter.
0x0 = DMA
0x1 = SRC
0x2 = DST
0x3 = ANY</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_HC_LLP</name>
              <description>The value of this register is derived from the DMAC_CH7_HC_LLP parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_CTL_WB_EN</name>
              <description>The value of this register is derived from the DMAC_CH7_CTL_WB_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_MULTI_BLK_EN</name>
              <description>The value of this register is derived from the DMAC_CH7_CTL_WB_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_LOCK_EN</name>
              <description>The value of this register is derived from the DMAC_CH7_LOCK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_SRC_GAT_EN</name>
              <description>The value of this register is derived from the DMAC_CH7_SRC_GAT_EN parameter. For a description of this parameter, refer to page 112.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_DST_SCA_EN</name>
              <description>The value of this register is derived from the DMAC_CH7_DST_SCA_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_STAT_SRC</name>
              <description>The value of this register is derived from the DMAC_CH7_STAT_SRC parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_STAT_DST</name>
              <description>The value of this register is derived from the DMAC_CH7_STAT_DST parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_STW</name>
              <description>The value of this register is derived from the DMAC_CH7_STW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_DTW</name>
              <description>The value of this register is derived from the DMAC_CH7_DTW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_5_L</name>
          <addressOffset>0x000003D0</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x2003C81B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH6_FIFO_DEPTH</name>
              <description>The value of this register is derived from the DMAC_CH6_FIFO_DEPTH parameter. Default value is 0x0.
0x0 = 8 bytes
0x1 = 16
0x2 = 32
0x3 = 64
0x4 = 128
0x5 = Reserved
0x6 = Reserved
0x7 = Reserved</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_MAX_MULT_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH6_MULT_SIZE parameter. Maxium burst transaction size.
CH6_MAX_MULT_SIZE = log2(256/DMAC_DATA_WIDTH)
0x3 = 32 bits
0x2 = 64 bits
0x1 = 128 bits</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_FC</name>
              <description>The value of this register is derived from the DMAC_CH6_FC parameter.
0x0 = DMA
0x1 = SRC
0x2 = DST
0x3 = ANY</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_HC_LLP</name>
              <description>The value of this register is derived from the DMAC_CH6_HC_LLP parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_CTL_WB_EN</name>
              <description>The value of this register is derived from the DMAC_CH6_CTL_WB_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_MULTI_BLK_EN</name>
              <description>The value of this register is derived from the DMAC_CH6_MULTI_BLK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_LOCK_EN</name>
              <description>The value of this register is derived from the DMAC_CH6_LOCK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_SRC_GAT_EN</name>
              <description>The value of this register is derived from the DMAC_CH6_SRC_GAT_EN parameter.
 0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_DST_SCA_EN</name>
              <description>The value of this register is derived from the DMAC_CH6_DST_SCA_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_STAT_SRC</name>
              <description>The value of this register is derived from the DMAC_CH6_STAT_SRC parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_STAT_DST</name>
              <description>The value of this register is derived from the DMAC_CH6_STAT_DST parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_STW</name>
              <description>The value of this register is derived from the DMAC_CH6_STW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_DTW</name>
              <description>The value of this register is derived from the DMAC_CH6_DTW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_COMP_PARAMS_5_H</name>
          <addressOffset>0x000003D4</addressOffset>
          <size>32</size>
          <description>Refer to the bit table in the description for it</description>
          <resetValue>0x2003C81B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH5_FIFO_DEPTH</name>
              <description>The value of this register is derived from the DMAC_CH5_FIFO_DEPTH parameter. Default value is 0x0.
0x0 = 8 bytes
0x1 = 16
0x2 = 32
0x3 = 64
0x4 = 128
0x5 = Reserved
0x6 = Reserved
0x7 = Reserved</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_MAX_MULT_SIZE</name>
              <description>The value of this register is derived from the DMAC_CH5_MULT_SIZE parameter. Maxium burst transaction size.
CH5_MAX_MULT_SIZE = log2(256/DMAC_DATA_WIDTH)
0x3 = 32 bits
0x2 = 64 bits
0x1 = 128 bits</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_FC</name>
              <description>The value of this register is derived from the DMAC_CH5_FC parameter.
0x0 = DMA
0x1 = SRC
0x2 = DST
0x3 = ANY</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_HC_LLP</name>
              <description>The value of this register is derived from the DMAC_CH5_HC_LLP parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_CTL_WB_EN</name>
              <description>The value of this register is derived from the DMAC_CH5_CTL_WB_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_MULTI_BLK_EN</name>
              <description>The value of this register is derived from the DMAC_CH5_MULTI_BLK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_LOCK_EN</name>
              <description>The value of this register is derived from the DMAC_CH5_LOCK_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_SRC_GAT_EN</name>
              <description>The value of this register is derived from the DMAC_CH5_SRC_GAT_EN parameter. For a description of this parameter, refer to page 112.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_DST_SCA_EN</name>
              <description>The value of this register is derived from the DMAC_CH5_DST_SCA_EN parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_STAT_SRC</name>
              <description>The value of this register is derived from the DMAC_CH5_STAT_SRC parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_STAT_DST</name>
              <description>The value of this register is derived from the DMAC_CH5_STAT_DST parameter.
0x0 = FALSE
0x1 = TRUE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_STW</name>
              <description>The value of this register is derived from the DMAC_CH5_STW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_DTW</name>
              <description>The value of this register is derived from the DMAC_CH5_DTW parameter.
0x0 = NO_HARDCODE
0x1 = 8
0x2 = 16
0x3 = 32
0x4 = 64
0x5 = 128
0x6 = 256
0x7 = reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
