Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RMII_REG</name>
      <baseAddress>0x41800000</baseAddress>
      <size>0x00001440</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001440</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDR0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDR0</name>
              <description>The ID register0-5 are only permitted to write by 4-byte access. Read access can be byte, word, or double word access.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDR1</name>
              <description></description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDR2</name>
              <description></description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDR3</name>
              <description></description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR4</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDR4</name>
              <description></description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDR5</name>
              <description></description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAR0</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAR0</name>
              <description>Multicast Register 0, The MAR register0-7 are only permitted to write by 4-byte access. Read access can be byte, word, or double word access. Driver is responsible for initializing these registers. The MAR7-0 define 64 bits which is a bit wise index of the multicast function of multicast addresses. The hash function of multicast address is the upper 6 MSB's of the CRC32 of the address (destination). The index then is the numerical representation of those 6 bits in hex format.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAR1</name>
              <description>Multicast Register 1</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAR2</name>
              <description>Multicast Register 2</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAR3</name>
              <description>Multicast Register 3</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAR4</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAR4</name>
              <description>Multicast Register 4</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAR5</name>
              <description>Multicast Register 5</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAR6</name>
              <description></description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAR7</name>
              <description>Multicast Register 7</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxOKCNT</name>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxOK</name>
              <description>16-bit counter of  Tx Ok packets.  Rolls over automatically.  Write to clear.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxOKCNT</name>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxOk</name>
              <description>16-bit counter of Rx Ok packets.  Rolls over automatically.  Write to clear.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxErr</name>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxErr</name>
              <description>16-bit counter of TxErr packets.  Rolls over automatically.  Write  to clear. The source of TxErr are txunder, txabt(in half-duplex mode) or txlinkerr.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxErr</name>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxErr</name>
              <description>16-bit counter of RxErr packets. Rolls over automatically. Write to clear.  The source of RxErr are GMAC meets the following condition when rx fifo is not full.: 
1.  RCR.accept runt = 0, but the ingress pkt length &lt; 64B. 
2.  RCR.accepterr = 0, but the ingress pkt is a CRC error pkt.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MissPkt</name>
          <addressOffset>0x00000018</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MissPkt</name>
              <description>16-bit counter of Missed packets. 
Rolls over automatically. 
Write to clear.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAE</name>
          <addressOffset>0x0000001A</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAE</name>
              <description>16-bit counter of FAE (Frame Alignment Error) packets.  Rolls over automatically.  Write to clear. RCR.AER should be high. 
When FAE occurs in 10/100mode, the following thins happens: 
*Rx status des.CRC error does not assert if the ingress(exclude alignment error nibble) if correct. 
*RxErr_reg increased by 1. 
*FAE_reg increased by 1 
*Rx status des.RCDF does not asserts. 
data length does not include alignment error nibble.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx1Col</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Tx1Col</name>
              <description>16-bit counter of  TxCol packets.  Rolls over automatically.  Write to clear.  This only record which have entered just one collision before Tx OK</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxMCol</name>
          <addressOffset>0x0000001E</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxMCol</name>
              <description>16-bit counter of TxCol packets.  Rolls over automatically.  Write to clear.  This keeps track of those packets with less than 16 collisions (or the configured retry count) before Tx Ok</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxOkPhy</name>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxOkPhy</name>
              <description>16-bit counter of Rx Ok packets with physical address matching destination address.  Rolls over automatically.  Write to clear.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxOkBrd</name>
          <addressOffset>0x00000022</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxOkBrd</name>
              <description>16-bit counter of Rx Ok packets with broadcast destination address..  
Rolls over automatically.  
Write to clear.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxOkMu1</name>
          <addressOffset>0x00000024</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxOkMul</name>
              <description>16-bit counter of Rx Ok packets with multicast destination address.  
Rolls over automatically.  
Write to clear.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxAbt</name>
          <addressOffset>0x00000026</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxAbt</name>
              <description>16-bit counter of Tx aborted packets.  Rolls over automatically.  
Write to clear.  
This accounts for over collision, underrun, LNK failure conditions.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXUNDERC</name>
          <addressOffset>0x00000028</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXUNDERC</name>
              <description>16-bit counter of Tx Underrun packets. Rolls over automatically. 
Write to clear. 
gmac only.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Misspkt_rdu</name>
          <addressOffset>0x0000002A</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDU_MISSPKTC</name>
              <description>16-bit counter of miss packets due to rx descriptor is unavailable. Rolls over automatically. 
Write to clear. 
gmac only.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRSR</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOK</name>
              <description>Transmit OK: Set to 1 indicates that the transmission of a packet was completed successfully and no transmit underrun occurs.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXUNDER</name>
              <description>Transmit FIFO Underrun: Set to 1 if the Tx FIFO was exhausted during the transmission of a packet.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RxFIFOEmpty</name>
              <description>Rx Fifo is Empty.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RBU</name>
              <description>Rx buff is un-available, rx full</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Tdsc_debug</name>
              <description>Tx descriptor debug</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Dis_lso_err</name>
              <description>Disable LSO error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RxJumbo</name>
              <description>1: support jumbo packet receiving.    The maximum packet size is 16384B(0x4000). 
0: Does not support jumbo packet receiving.    
When rxjumbo sets to 1, the minium rx descriptor ring size is 16.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RxVLAN</name>
              <description>Receive VLAN de-tagging enable.1: Enable. 0: Disable. 
1: detag vlan and set rx status dsc.tava = 1 when ingress packet has vlantag. 
0: disable detag vlan and rx status dsc.tava = 0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RxChkSum</name>
              <description>Receive checksum offload enable. 1: Enable. 0: Disable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST</name>
              <description>Reset: Setting to 1 forces the Ethernet module to a software reset state which disables the transmitter and receiver, reinitializes the FIFOs, triggers interrupt Swint for RISC to reset the system buffer pointer to the initial value Tx/Rx FDP. The values of IDR0-5 and MAR0-7 will have no changes. This bit is 1 during the reset operation, and is cleared to 0 by the Ethernet Module when the reset operation is complete.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
