Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>ISR_and_IMR</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMR_RDU6</name>
              <description></description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_RDU5</name>
              <description></description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_RDU4</name>
              <description></description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_RDU3</name>
              <description></description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_RDU2</name>
              <description></description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_SWInt</name>
              <description></description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_TDU</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_LinkChg</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_TER</name>
              <description></description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_TOK_TI</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_RDU1</name>
              <description></description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_RER_OVF</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_RER_RUNT</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_CNT_WRAP</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR_ROK</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_RDU6</name>
              <description>Rx Descriptor Unavailable for RING6: 
When set, indicates Rx descriptor is unavailable. 
Write 1 to clear.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_RDU5</name>
              <description>Rx Descriptor Unavailable for RING5: 
When set, indicates Rx descriptor is unavailable. 
Write 1 to clear.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_RDU4</name>
              <description>Rx Descriptor Unavailable for RING4: 
When set, indicates Rx descriptor is unavailable. 
Write 1 to clear.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_RDU3</name>
              <description>Rx Descriptor Unavailable for RING3: 
When set, indicates Rx descriptor is unavailable. 
Write 1 to clear.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_RDU2</name>
              <description>Rx Descriptor Unavailable for RING2: 
When set, indicates Rx descriptor is unavailable. 
Write 1 to clear.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_SWInt</name>
              <description>Software Interrupt pending: 
When set to 1 indicates a software interrupt was forced.  
Write 1 to clear.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_TDU</name>
              <description>Tx Descriptor Unavailable: 
When set, indicates Tx descriptor is unavailable. 
Write 1 to clear.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_LinkChg</name>
              <description>Link Change:  
Write 1 to clear.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_TER</name>
              <description>Transmit (Tx) Error: 
Indicates that a packet transmission was aborted, due to excessive collisions, according to the TXRR's setting.  
Write 1 to clear.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_TOK_TI</name>
              <description>Transmit Interrupt:  
Indicates that the DMA of the last descriptor of TxIntMitigation number of Tx packet has completed and the last descriptor has been closed. 
Write 1 to clear.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_RDU1</name>
              <description>Rx Descriptor Unavailable for RING1: 
When set, indicates Rx descriptor is unavailable. 
Write 1 to clear.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_RER_OVF</name>
              <description>Rx FIFO Overflow, caused by RBO/RDU, poor system bus (Lexra bus) performance, or overloaded Lexra bus traffic. 
Write 1 to clear.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_RER_RUNT</name>
              <description>Rx error caused by runt error characterized by the frame length in bytes being less than 64 bytes.
Write 1 to clear.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_CNT_WRAP</name>
              <description>Tx/rx counter wrap interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_ROK</name>
              <description>Receive (Rx) OK:  This interrupt is set either when RxIntMitigation packet is met or RxPktTimer expires.
Write 1 to clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IFG2_0</name>
              <description>InterFrameGap Time: This field allows the user to adjust the interframe gap time longer than the standard: 9.6 us for 10Mbps, 960 ns for 100Mbps. The time can be programmed from 9.6 us to 14.4 us (10Mbps) and 960ns to 1440ns (100Mbps).  The formula for the inter frame gap is:
 IFG[2:0]    IFG@1000MHz (nS)   IFG@100MHz (nS)  IFG@10MHz (uS)
 0  1  1        96                           960                         9.6
 1  0  0        96 +8 * 1                 960 +8 * 10              9.6 +8 * 0.1
 1  0  1        96 + 16 * 1               960 + 16 * 10           9.6 + 16 * 0.1
 1  1  0        96 + 24 * 1               960 + 24 * 10           9.6 + 24 * 0.1
 1  1  1        96 + 32 * 1               960 + 32 * 10           9.6 + 32 * 0.1
 0  0  0        96 + 40 * 1               960 + 40 * 10           9.6 + 40 * 0.1
 0  0  1        96 + 48 * 1               960 + 48 * 10           9.6 + 48 * 0.1
 0  1  0        96 + 96 * 1               960 + 96 * 01           9.6 + 96 * 0.1</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LBK</name>
              <description>The loopback function must be independent of the link state. 
2'b00 : normal operation 
2'b01 : Loopback mode_R2T(lbkmode_r2t) :
     Lbk methld: no SW requirement.
               1. receive ingress data.
               2. assign rxd to txd (txd).
               3. egress pkt. b10 : Reserved 
2'b11 : Loopback mode(lbk_mode).
       Lbk method: 1. rx fet descriptor. 
                          2. tx fet descriptor and data
                          3. put data in txfifo
                          4. assign txd to rxd.(lbk)
                          5. gmac mv data to lxb. 
In this mode(lbk_mode), the recommended value of RC_REG(0x44) is 0xf.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCR</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HomePNA</name>
              <description>Home PNA mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AFlow</name>
              <description>Accept flow control : 
When set to 1, flow control packet will also be received &amp; DMA to rx buffer for debug. Default is 0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AER</name>
              <description>Accept Error Packet:  
When set to 1, all packets with CRC error, alignment error, and/or collided fragments will be accepted.
      Rxerrc keeps,
      Rxokc +1,
      Rx status dsc.CRC =1,
      Rx status dsc.RCDF =0. 
When set to 0, all packets with CRC error, alignment error, and/or collided fragments will be rejected.
      Rxerrc +1,
      Rxokc keeps,
      Rx status dsc.CRC =0,
      Rx status dsc.RCDF =1.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR</name>
              <description>Accept Runt: This bit allows the receiver to accept packets that are smaller than 64 bytes. The packet must be at least 8 bytes long to be accepted as a runt. Set to 1 to accept runt packets.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AB</name>
              <description>Set to 1 to accept broadcast packets, 0 to reject.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AM</name>
              <description>Set to 1 to accept multicast packets, 0 to reject. RC_REG.AB and AM should be enabled simulatanously.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APM</name>
              <description>Set to 1 to accept physical match packets, 0 to reject.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AAP</name>
              <description>Set to 1 to accept all packets with physical destination address, 0 to reject.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUTAG</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x01400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTEN_RX</name>
              <description>Enable parsing ingress packet with cputag format.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CT_TSIZE</name>
              <description>Cputag size in egress pkt. 
CTT_size: 4'h0: 0 Byte
               4'h1: 4 Byte
               4'h2: 8Byte
               4'h3: 12 Byte</description>
              <bitRange>[30:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CT_RSIZE_3_2</name>
              <description>After rl8681 (including), this field is only for ingress pkt. 
CTR_size:  4'h0: 0 Byte
                 4'h1: 4 Byte
                 4'h2: 8Byte F
or Apollo cputag with PTP timestamp, set CT_RSIZE to h2.</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CT_DSLRN</name>
              <description>In rtl8370s, Setting of Disable Learning field in tx cputag. 
Setting of Disable Learning field in RTL8368 or DSLRN field in RTL8307h tx cputag when short_dsc_format = 0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CT_NORMK</name>
              <description>Setting of NORMK field in RTL8307h tx cputag when short_dsc_format = 0.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CT_ASPRI</name>
              <description>In RTL8307h, setting ASPRI field in tx cputag when short_dsc_format = 0. 
In RTL8370S, setting priority select field in tx cputag when short_dsc_format =0..</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CT_SWITCH</name>
              <description>Support cputag format of switch 
0: no cputag support 
1: 8368 
2: 8306 
3: 8307 
4: 8370 
5: gmac in 8681. 
6: gmac in Apollo,  rle0371, rl6266 and   rtl9601(rle0639)</description>
              <bitRange>[21:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CT_RSIZE_1_0</name>
              <description></description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTPM</name>
              <description>CPU tag protocol mask. 
8306:0xf0 
8368:0xe0 
8370:0xff 
8307h:0xff</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTPV</name>
              <description>CPU tag protocol value. 
8306:0x90 
8368:0xa0 or 0xb0 
8370:0x04 
8307h:0x04</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Rff_size_sel</name>
              <description>Set gmac_rxfifo size. 
2'b00: 1KB 
2'b01: 1664B 
2'b10: 2KB</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>r_tso_id_sel</name>
              <description>0: each ID of IP header is same as original ID. 
1: increment 1 from original ID. Default value is 0.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>r_mdslv_outedge</name>
              <description>this bit works only  in phy_mode
0: change mdio output data in falling edge 
1: change mdio output data in rising edge</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>En_int_route</name>
              <description>0: disable interrupt routing, IMR0_reg, IMR1_reg. 
1: enable interrupt routing, IMR0_reg, IMR1_reg.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>En_int_split</name>
              <description>When, en_int_route = 0,
0: only int.tdu, tok and rok present. 
1: IMR0_reg, IMR1_reg and ISR1_reg present.   
When en_int_route = 1, this field is 1.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUTAG1</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Spa_dsl</name>
              <description></description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Spa_pon</name>
              <description>The ingress cputag.SPA=PON field. Used in Apollo cputag.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
