Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>MSR</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x000380C1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Force_TRXFCE</name>
              <description>Force Tx/RX Flow Control:  
1 = enabled Flow control in the absence of NWAY. 
0 = disables Flow control in the absence of NWAY. 
Version effect: rl6166(ECO) and after.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFCE</name>
              <description>RX Flow control Enable: The flow control is enabled in full-duplex mode only. 
Packets are dropped if buffer is exhausted.  Default is 0.   
1 = Rx Flow Control Enabled. 
0 = Rx Flow Control Disabled.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFCE</name>
              <description>Tx Flow Control Enable: 
1 = tx flow control enabled. 
0 = tx flow control disabled. 
ACCEPT ERROR MUST NOT BE ENABLED</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPEED</name>
              <description>{SPEED_1000, SPEED_10} 
00: 100Mbps,   
01: 10Mbps
10: 1000Mbps,  
11: not allowed</description>
              <bitRange>[28:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LINKB</name>
              <description>Inverse of Link status. 
0 = Link OK. 
1 = Link Fail.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXPF</name>
              <description>Tx Pause frame:  
1 = Ethernet module has sent a pause packet.  
0 = the Ethernet module has sent a timer done packet.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXPF</name>
              <description>Pause Flag:  
1 =  Ethernet module is in backoff state because a pause packet received.  
0 = pause state is clear.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL_RGMII</name>
              <description>gmac_sel_rgmii</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FULLDUPREG</name>
              <description>Indicates Full duplex mode from mdio results.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NWCOMPLETE</name>
              <description>Nway complete</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL_MII</name>
              <description>indicates in mii mode.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCEDFULLDUP</name>
              <description>force gmac operates at full duplex mode.  
This bit is Write only in RLE0315. 
This bit is R/W in RLE0390 (原RL6166). 
1'b1: force gmac in full duplex mode. 
1'b0: duplex status is from MDIO auto-polling. 
Not means gmac is in half duplex mode.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCELINK</name>
              <description>force gmac in link ok mode.  
This bit is Write only in RLE0315. 
This bit is R/W in RLE0390 (RL6166). 
1'b1: force gmac in linkok. 
1'b0: link status is from MDIO auto-polling.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_SPD</name>
              <description>Force gmac in 10/100/GIGA mode. 
2'b00: 100M  
2'b01: 10M 
2'b10: GIGA 
2'b11: not force mode. 
These bits are Write only in RLE0390 (RL6166). The current speed status of gmac can be checked in MSR_reg.{speed1000, speed_10}.  
In force mode, SW can set gmac operates in , FD and Link ok(for example) and SW can not set gmac operates in , HD and Link ok. When FORCEDFULLDUP is b0, the duplex status is from MDIO auto-polling, therefore, it is not controlled by SW.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gmac_sel_phyif_0</name>
              <description>1: phy interface 0.works. 
0: phy interface 1 works.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gmac_phy_mode</name>
              <description>1: in phy mode. (bit[6] will be read as '0') 
0: not in phy mode. (bit[6] will be read as '1')</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rgmii_rx_decode_sts</name>
              <description>0: Does not support rgmii in band status(link status, speed and duplex mode of the PHY) by decoding rxd. 
1: Supports rgmii in band status(link status, speed and duplex mode of the PHY) by decoding rxd.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rgmii_tx_encode_sts</name>
              <description>This field is valid only in phy mode.  
0: Does not support rgmii in band status(link status, speed and duplex mode of the PHY) by encoding txd. 
1: Supports rgmii in band status(link status, speed and duplex mode of the PHY) by encoding txd.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>force_spd_mode</name>
              <description>1: gmac is in force speed mode. The real speed in force mode is set in MS_REG.FORCE_SPD. 
0: gmac speed status is from md operation.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Eee_aby</name>
              <description>Indicates eee ability of PCS. 
Eee_aby[0]: eee ability in 100M 
Eee_aby[1]: eee ability in giga mode.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>reg_rmii2mii_en</name>
              <description>1: transfer MII signals to RMII signals 
This function is only valid in MII mode.
 (default 0: for AmebaI//AmebaPro/AmebaPro2)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gmac_md_mst</name>
              <description>1: GMAC is used to be MDIO master. (When bit[13] is setting as '0') 
0: GMAC is used to be MDIO slave. (When bit[13] is setting as '1')</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>refclk_phase</name>
              <description>1: for Tx transaction, TXEN &amp; TXD signals are changed on the falling edge of REF_CLK; for Rx transaction, RXD signals are sampled on the falling edge of REF_CLK
0: for Tx transaction, TXEN &amp; TXD signals are changed on the rising edge of REF_CLK; for Rx transaction, RXD signals are sampled on the rising edge of REF_CLK</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>refclk_on</name>
              <description>1: REF_CLK on 
0: REF_CLK off</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIIAR</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x04000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Flag</name>
              <description>Flag bit, used to identify access to MII register: 
1:  Write data to MII register.  Turns to 0 automatically upon completion of MAC writing to the specified MII register. 
0:  Read data from MII register.  Turns to 1 automatically upon completion of MAC reading the specified MII register.   
Read write turn around time I s about 64 us.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYAddress</name>
              <description>Defines the Phy address for the MII.</description>
              <bitRange>[30:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mdio_busy</name>
              <description>MDIO is busy</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>En_eeep_auto_write</name>
              <description>HW auto writes PCS.page4.reg20 and reg27 to adjust analog parameters based on eeep_lpi state.  
SW should change page to page4 then set MIIA_REG.en_eeep_auto_write.  HW will write eeep_abig_on/off and eeep_ldvbias_on/off (in EEEP_CR6_REG and EEEP_CR7_REG) to PCS.page4.reg20 and reg27, respectively, based on eeep_lpi state.    
If SW wants to access another page of PCS, SW should disable MIIA_REG.en_eeep_auto_write.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Disable_auto_polling</name>
              <description>Disable auto polling feature of mdio operation. 
0: HW auto polling PCS status.  
1: HW does not auto polling PCS status.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>polling_eee_reg</name>
              <description>polling PCS EEE advertisement register (7.60). In rl6166(原rle0315) and before: this bit is not supported. 
In rle0390: In in-direct method, gmac had to access PCS register by multiples R/W of reg13 and 14. It is OK for PCS to be aborted in the middle of indirect method. 
In rle0371: HW will complete current indirect access to PCS then stop in-direct method.  Please refer to EEE_CR1_reg.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RegAddr4_0</name>
              <description>Defines 5-bit MII register address.</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Data15_0</name>
              <description>Defines 16 bit MII resgister data.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWINT</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWINT</name>
              <description>Write 1 will force ISR register bit 10 set to 1</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VLAN_REG</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x88A80000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STAG_PID</name>
              <description>Set the s-tag protocol identifier. This field is valid only when COM_REG.TDSC_VLAN_TYPE is high.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDSC_VLAN_TYPE</name>
              <description>1: tx command descriptor.tx_vlan_action is for s-tag. 
0: tx command descriptor.tx_vlan_action is for c-tag.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LED_CTRL</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eee_en_led</name>
              <description>Enable/disable lpi led.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Custom_led</name>
              <description>Custom led mode. 1: using custom led matrix table. 0: using Non-custom led table.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ledsel</name>
              <description>Non custom led select.  Following EEE spec, combine the Link signal and LPI signal in the same LED pin. While entering LPI state, LED will blink with  2784ms cycle, of which the first  2349ms LED light is turned off, after  435ms is turned on.  
NO EEE in RL6166.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ledsel3</name>
              <description>Custom led3 select.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ledsel2</name>
              <description>Custom led2 select.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ledsel1</name>
              <description>Custom led1 select.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ledsel0</name>
              <description>Custom led0 select.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BIST</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>csr_rff_tmck</name>
              <description>Set TMCK for RXFIFO</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>csr_rff_nap</name>
              <description>Set NAP for RXFIFO</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>csr_rff_dvse</name>
              <description>Set DVSE for RXFIFO</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>csr_rff_dvs</name>
              <description>Set DVS for RXFIFO</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>csr_tff_tmck</name>
              <description>Set TMCK for TXFIFO</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>csr_tff_nap</name>
              <description>Set NAP for TXFIFO</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>csr_tff_dvse</name>
              <description>Set DVSE for TXFIFO</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>csr_tff_dvs</name>
              <description>Set DVS for TXFIFO</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PGLBK</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>en_pglbk</name>
              <description>Enable packet generator mode</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pglbk_data_pat_sel</name>
              <description>1: fixed pattern, 0: pseudo random</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pglbk_done</name>
              <description>packet generator in wire lbk mode status. 1: done</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pglbk_fail</name>
              <description>packet generator in wire lbk mode status. 1: fail</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pblbk_pkt_length_sel</name>
              <description>0: random (range: 64-1504B), 1: 64B</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pglbk_pkt_num_sel</name>
              <description>2'b00: 100 pkts,  
2'b10: 5 pkts. 
2'b01: 1 pkt 
2'b11: reserved.</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>R_disable_txcrc</name>
              <description>1: not append CRC for egress packet. 
0: append CRC for egress packet.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pglbk_data_pat</name>
              <description>Pattern inside tx packet when pglbk_data_pat_sel is high. For RLE0516, only pglbk_data_pat[3:0] are used.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
