Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>EEE_CR1</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_FRC_EEE</name>
              <description>Enable EEE force mode 
0: Disable EEE FORCE Mode 
1: Enable EEE FORCE Mode If EN_FRC_EEE=1, both FRC_EEE_Giga and FRC_EEE_100 are used to force MAC operation ability.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRC_EEE_Giga</name>
              <description>If EN_FRC_EEE=1, FRC_EEE_Giga:  
0: Disable MAC EEE ability for 1000BASE-T. 
1: Enable MAC EEE ability for 1000BASE-T. If EN_FRC_EEE=0, FRC_EEE_Giga means EEE advertisement register 7.60 bit[2]</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRC_EEE</name>
              <description>If EN_FRC_EEE=1, FRC_EEE_100 
0: Disable MAC EEE ability for 100BASE-TX. 
1: Enable MAC EEE ability for 100BASE-TX. If EN_FRC_EEE=0, FRC_EEE_100 means EEE advertisement register 7.60 bit[1]</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_EEE</name>
              <description>Set same as PHY setting, for LED.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_EEE_TX</name>
              <description>Enable MAC TX EEE ability 
0: Disable EEE ability for TX. 
1: Enable EEE ability for TX.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_EEE_RX</name>
              <description>Enable MAC RX EEE ability 
0: Disable EEE ability for RX.  
1: Enable EEE ability for RX. Application note : The following methods could be used to disable EEE function.    a) n[1:0] = 00 -&gt; completely disable EEE function, or    b) n[3:2] = 00 -&gt; disable /1000Mbps EEE  capability (excludes 10Mbps ).</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Eee_outq_lowq_over</name>
              <description>SW has many packets to be tranmitted, then set this bit to tell HW leave lpi state in condition2.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_STS</name>
              <description>Indicate EEE status, both TX and RX. 
1: Both TX and RX in LPI mode simultaneously. 
0: not both TX and RX in LPI mode simultaneously</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EEE_TX_STS</name>
              <description>Indicate EEE TX status 
1: TX is in LPI mode.  
0: TX is in normal mode.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EEE_RX_STS</name>
              <description>Indicate Port 0 EEE RX status  
1: RX is in LPI mode.  
0: RX is in normal mode.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EEE_PauseFlag</name>
              <description>Set indication for LPI request due to RX pause on frame. 
1: indicate RX pause on frame;
0: no indicate.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EEE_Wake_Set1</name>
              <description>Enable LPI TX high priority pkt Wakeup decision maker for EEE. 
1: enable;
0: disable. Gmac will leave lpi mode when EEE_CR1_reg.txq_th is met or one of the egress is larger than 512B.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Wake_Set0</name>
              <description>Enable LPI TX transmit wakeup decision maker for EEE. 
1: enable;
0: disable.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Req_Set2</name>
              <description>Enable LPI TX request RX pause on frame decision maker for EEE. 
1: enable;
0: disable.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Req_Set1</name>
              <description>Enable LPI TX request queue empty decision maker for EEE. 
1: enable;
0: disable. For RLE0390(原RL6166), only for tx is single descriptor operation. For next version, this bit can support multi-descriptor operation.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Req_Set0</name>
              <description>Enable LPI TX request Rate decision maker for EEE. 
1: enable;
0: disable.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_RXTimer_EN</name>
              <description>Enable RX meter to count RX LPI status time</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_TXTimer_EN</name>
              <description>Enable TX meter to count TX LPI status time</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Unit_Giga_1</name>
              <description>Set the unit for timer T_wakeup, T_tx_rate, and T_pause in EEE function. 
00: 1uS; 
01: 16 uS; 
10: 128 uS; 
11: 1024uS.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Unit_Giga_2</name>
              <description>Set the unit for timer T_tx_delay in EEE function. 
00: 8uS; 
01: 64uS; 
10: 256uS; 
11: 1024uS.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Unit_100_1</name>
              <description>Set the unit for timer T_wakeup, T_tx_rate, and T_pause in EEE function. 
00: 1uS; 
01: 16uS; 
10: 128uS; 
11: 1024uS.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Unit_100_2</name>
              <description>Set the unit for timer T_tx_delay in EEE function. 
00: 8uS; 
01: 64uS; 
10: 512uS; 
11: 1024uS.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEE_CR2</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x100AC40A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EEE_Timer_Tw_Giga</name>
              <description>Timer value in EEE function for T_wakeup. Value from 0~256.
Unit: EEE_Timer_Unit_Giga_1.
Default value is 16 us.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Tr_Giga</name>
              <description>Timer value in EEE function for T_tx_rate.
Unit: EEE_Timer_Unit_Giga_1.
Default value is 10 us.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Td_Giga</name>
              <description>Timer value in EEE function for QoS based LPI decision maker T_tx_delay.
Unit: EEE_Timer_Unit_Giga_2*4.
Default value is 200  ms.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Tp_Giga</name>
              <description>Timer value in EEE function for TX decision maker T_pause.
Unit: EEE_Timer_Unit_Giga_1.
Default value is 10 us.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEE_CR3</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x1E0AF40A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EEE_Timer_Tw_100</name>
              <description>Timer value in EEE function for T_wakeup. Value from 0~256.
Unit: EEE_Timer_Unit_100_1
Default value is 30 us.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Tr_100</name>
              <description>Timer value in EEE function for T_tx_rate.
Unit: EEE_Timer_Unit_100_1.
Default value is 10 us.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Td_100</name>
              <description>Timer value in EEE function for QoS based LPI decision maker T_tx_delay.
Unit: EEE_Timer_Unit_100_2*4.
Default value is 1s.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_Timer_Tp_100</name>
              <description>Timer value in EEE function for TX decision maker T_pause.
Unit: EEE_Timer_Unit_100_1.
Default value is 10 us.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEE_CR4</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0271003E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EEE_TX_THR_Giga</name>
              <description>Set the TX threshold in EEE function. Unit is Byte. EEE_TX_THR=Round [(T_tx_rate*Rate) / 8 ]. If you set T_tx_rate=10us, Rate=1000Mbps, so set EEE_TX_THR =  0x4E2 (1250bytes).
Default value is 0x271(~half rate).</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_TX_THR_100</name>
              <description>Set the TX threshold in EEE function. Unit is Byte. EEE_TX_THR=Round [(T_tx_rate*Rate) / 8 ]. If you set T_tx_rate=10us, Rate=100Mbps, so set EEE_TX_THR = 0x7D (125bytes).
Default value is 0x3E (~half rate).</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEE_LPI_TMO_REG</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EEE_RXLPI_Time</name>
              <description>RX in LPI time. (unit: 1us) (accumulation)Valid as (PORT_MASK[0]==1&amp;&amp;RXTimer_EN==1)</description>
              <bitRange>[21:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEE_LPI_TM1_REG</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eee_stop_txc</name>
              <description>This bit works in rgmii_1000 and rgmii_100 modes only. 
1: gmac halts gmac_rgmii_txc_out when gmac enters lpi. 
0: gmac does not halt gmac_rgmii_txc_out when gmac enters lpi. This bit should always be b0 for RLE0390(原RL6166). Gmac can halt gmac_rgmii_txc_out in the next version.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>eee_trxctl_level</name>
              <description>The gmac_rgmii_txe and gmac_rgmii_rxdv level when gmac is in lpi.  
1: tx_ctl and rx_ctl is high when in lpi. 
0: reserved.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEE_TXLPI_Time</name>
              <description>TX in LPI time. (unit: 1us ) (accumulation)Valid as (PORT_MASK[0]==1&amp;&amp;TXTimer_EN==1)</description>
              <bitRange>[21:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEEP_CR1</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>En_EEEP</name>
              <description>Enable EEEP function 0b0: Disable EEEP function.  0b1: Enable EEEP function.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_EN_EEEP_RX</name>
              <description>1: Enable EEEP RX.
0: Disable EEEP RX.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_EN_EEEP_TX</name>
              <description>1: Enable EEEP TX.
0: Disable EEEP TX.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_EN_EEEP_GIGA</name>
              <description>1: Enable EEEP in giga mode.
0: Disable EEEP in giga mode.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_EN_EEEP</name>
              <description>1: Enable EEEP in  mode.
0: Disable EEEP in  mode.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_EEEP_DEFER_TXLPI</name>
              <description>???</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_MST_MODE</name>
              <description>When PMA is in master clock role, the EEEP_RX can work. SW needs to configure PCS reg9.bit12(Master-slave manual config enable) and reg9.bit11(Master-slave config value). Then setting EEEP_CR1_REG.PHY_MST_MODE.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Eeep_dbgo_sel</name>
              <description>eeep module debug signals selection.</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEEP_CR2</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EEEP_Sleep_Step</name>
              <description>Value from 1 to 255, indicate the rx sleep step in EEEP function. Value 0 is the same as 1. EEPROM and register configurable.//???</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEEP_CR3</name>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00F000F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EEEP_TX_THR</name>
              <description>Set the TX threshold in EEEP function. Unit: Byte; EEEP_TX_THR=Round [(T_rx_rate*Rate) / 8 ].  
If you set T_rx_rate=192us,Rate=10Mbps, so set EEEP_TX_THR= 0xF0 (240 bytes). EEPROM and register configurable.//HYH???</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEEP_RX_THR</name>
              <description>Set the RX threshold in EEEP function. Unit: Byte; EEEP_RX_THR=Round [(T_rx_rate*Rate) / 8 ].  
If you set T_rx_rate=192us,Rate=10Mbps, so set EEEP_TX_THR= 0xF0 (240 bytes). EEPROM and register configurable. //HYH???</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEEP_CR4</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0C020101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EEEP_Timer_RX_RATE</name>
              <description>Timer value in EEEP function for T_rx_rate.
Unit: microsecond.
Default value is 192 us.
EEPROM and register configurable.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEEP_Timer_RX_WAKE</name>
              <description>Timer value in EEEP function for T_rx_wake.
Unit: microsecond.
Default value is 32 us.
EEPROM and register configurable.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEEP_Timer_TX_WAIT</name>
              <description>Timer value in EEEP function for T_tx_wait.
Unit: microsecond.
Default value is 16 us.
EEPROM and register configurable.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEEP_Timer_PAUSE</name>
              <description>Timer value in EEEP function for T_pause_on.
Unit:refer to EEEP_Timer_Unit.
Default value is 16 us.
EEPROM and register configurable.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEEP_CR5</name>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000010C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EEEP_TX_RATE</name>
              <description></description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEEP_Timer_Unit</name>
              <description>Set the unit for timer in EEEP function.
00: 1us; 
01: 16us; 
10: 128us; 
11: 1024us.
EEPROM and register configurable.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEEP_Timer_RX_SLEEP</name>
              <description>value of Timer in EEEP function for T_rx_sleep.
Unit: microsecond.
Default value is 192 us.
EEPROM and register configurable.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEEP_CR6</name>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xB80A800A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eeep_abig_on</name>
              <description></description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>eeep_abig_off</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEEP_CR7</name>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x75500550</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eeep_ldvbias_on</name>
              <description></description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>eeep_ldvbias_off</name>
              <description></description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
