Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>IMR0_REG</name>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMR0_TDU5</name>
              <description></description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_TDU4</name>
              <description></description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_TDU3</name>
              <description></description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_TDU2</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_TDU1</name>
              <description>This bit is IMR.tdu</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IMR0_TOK5</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_TOK4</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_TOK3</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_TOK2</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_TOK1</name>
              <description>This bit is IMR.tok</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IMR0_ROK6</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_ROK5</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_ROK4</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_ROK3</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_ROK2</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR0_ROK1</name>
              <description>This bit is IMR.rok</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR1_REG</name>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMR1_TDU5</name>
              <description></description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_TDU4</name>
              <description></description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_TDU3</name>
              <description></description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_TDU2</name>
              <description></description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_TDU1</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_TOK5</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_TOK4</name>
              <description></description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_TOK3</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_TOK2</name>
              <description></description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_TOK1</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_RDU6</name>
              <description></description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_RDU5</name>
              <description></description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_RDU4</name>
              <description></description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_RDU3</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_RDU2</name>
              <description></description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_RDU1</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_ROK6</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_ROK5</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_ROK4</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_ROK3</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_ROK2</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMR1_ROK1</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR1_REG</name>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISR_TDU5</name>
              <description>Tx Descriptor Ring5 Unavailable: When set, indicates Tx descriptor Ring5 is unavailable. 
Write 1 to clear.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_TDU4</name>
              <description>Tx Descriptor Ring4 Unavailable: When set, indicates Tx descriptor Ring5 is unavailable. 
Write 1 to clear.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_TDU3</name>
              <description>Tx Descriptor Ring3 Unavailable: When set, indicates Tx descriptor Ring5 is unavailable. 
Write 1 to clear.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_TDU2</name>
              <description>Tx Descriptor Ring2 Unavailable: When set, indicates Tx descriptor Ring5 is unavailable. 
Write 1 to clear.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_TDU1</name>
              <description>This bit is ISR.tdu</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_TOK5</name>
              <description>Transmit Interrupt:   Indicates that the DMA of the last Ring5 descriptor of TxIntMitigation number of Tx packet has completed and the last descriptor has been closed.  
Write 1 to clear.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_TOK4</name>
              <description>Transmit Interrupt:   Indicates that the DMA of the last Ring4 descriptor of TxIntMitigation number of Tx packet has completed and the last descriptor has been closed.  
Write 1 to clear.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_TOK3</name>
              <description>Transmit Interrupt:   Indicates that the DMA of the last Ring3 descriptor of TxIntMitigation number of Tx packet has completed and the last descriptor has been closed.  
Write 1 to clear.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_TOK2</name>
              <description>Transmit Interrupt:   Indicates that the DMA of the last Ring2 descriptor of TxIntMitigation number of Tx packet has completed and the last descriptor has been closed.  
Write 1 to clear.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_TOK1</name>
              <description>This bit is ISR.tok</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISR_ROK6</name>
              <description>Receive (Rx) OK:   This interrupt is set either when RxIntMitigation packet is met or RxPktTimer expires in Ring6.  
Write 1 to clear.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_ROK5</name>
              <description>Receive (Rx) OK:   This interrupt is set either when RxIntMitigation packet is met or RxPktTimer expires in Ring5.  
Write 1 to clear.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_ROK4</name>
              <description>Receive (Rx) OK:   This interrupt is set either when RxIntMitigation packet is met or RxPktTimer expires in Ring4.  
Write 1 to clear.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_ROK3</name>
              <description>Receive (Rx) OK:   This interrupt is set either when RxIntMitigation packet is met or RxPktTimer expires in Ring3.  
Write 1 to clear.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_ROK2</name>
              <description>Receive (Rx) OK:   This interrupt is set either when RxIntMitigation packet is met or RxPktTimer expires in Ring2.  
Write 1 to clear.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_ROK1</name>
              <description>This bit is ISR.rok</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_R_REG</name>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tr5_int_routing</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tr4_int_routing</name>
              <description></description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tr3_int_routing</name>
              <description></description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tr2_int_routing</name>
              <description></description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tr1_int_routing</name>
              <description></description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rr6_int_routing</name>
              <description></description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rr5_int_routing</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rr4_int_routing</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rr3_int_routing</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rr2_int_routing</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rr1_int_routing</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rst_Pwr_Down_Operation_Ctrl_REG</name>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUTORXCLKDIS</name>
              <description>1: Auto Disable Rx Clock when AUTOISOU=1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOTXCLKDIS</name>
              <description>1: Auto Disable Tx Clock when AUTOISOU=1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOISOU</name>
              <description>Auto Isolate Update</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOLSU</name>
              <description>Auto Link Status Update</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Clk_Ctrl_REG</name>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Rev_00e4_7</name>
              <description>Reserved bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rev_00e4_6</name>
              <description>Reserved bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rev_00e4_5</name>
              <description>Reserved bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rev_00e4_4</name>
              <description>Reserved bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rev_00e4_3</name>
              <description>Reserved bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_data_swap</name>
              <description>1: Swap data order for dma_mst</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCLK_EN</name>
              <description>0: Rx Clock Gated (txc_out)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCLK_EN</name>
              <description>0: Tx Clock Gated (rxc_out)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Interupt_Mask_REG</name>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lx_mst_to_inten</name>
              <description>Interrupt enable of lexra master timeout</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lx_slv_to_inten</name>
              <description>Interrupt enable of lexra slave timeout</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISON</name>
              <description>Isolate Notify</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRDWNN</name>
              <description>Power Down Notify</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPBKN</name>
              <description>Loopback Notify</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTN</name>
              <description>Reset Notify</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Interupt_Status_REG</name>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lx_mst_to_int</name>
              <description>Interrupt status of lexra master timeout</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lx_slv_to_int</name>
              <description>Interrupt status of lexra slave timeout</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISONS</name>
              <description>Isolate Notify When set, indicate Isolate is detected. 
Write 1 to clear.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRDWNNS</name>
              <description>Power Down Notify When set, indicate Isolate is detected. 
Write 1 to clear.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBKNS</name>
              <description>Loopback Notify When set, indicate Isolate is detected. 
Write 1 to clear.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTNS</name>
              <description>Reset Notify When set, indicate Isolate is detected. 
Write 1 to clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
