Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>TxFDP1</name>
          <addressOffset>0x00001300</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxFDP1</name>
              <description>Tx 1st priority Descriptor Pointer to the Tx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxCDO1</name>
          <addressOffset>0x00001304</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxCDO1</name>
              <description>Tx 1st priority Current Descriptor Offset: FDP+CDO = current descriptor pointer.  CDO increments by 16 bytes each time.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxFDP2</name>
          <addressOffset>0x00001310</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxFDP2</name>
              <description>Tx 2st priority Descriptor Pointer to the Tx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxCDO2</name>
          <addressOffset>0x00001314</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxCDO2</name>
              <description>Tx 2st priority Current Descriptor Offset: FDP+CDO = current descriptor pointer.  CDO increments by 16 bytes each time.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxFDP3</name>
          <addressOffset>0x00001320</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxFDP3</name>
              <description>Tx 3st priority Descriptor Pointer to the Tx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxCDO3</name>
          <addressOffset>0x00001324</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxCDO3</name>
              <description>Tx 3st priority Current Descriptor Offset: FDP+CDO = current descriptor pointer.  CDO increments by 16 bytes each time.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxFDP4</name>
          <addressOffset>0x00001330</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxFDP4</name>
              <description>Tx 4st priority Descriptor Pointer to the Tx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxCDO4</name>
          <addressOffset>0x00001334</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxCDO4</name>
              <description>Tx 4st priority Current Descriptor Offset: FDP+CDO = current descriptor pointer.  CDO increments by 16 bytes each time.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxFDP5</name>
          <addressOffset>0x00001340</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxFDP5</name>
              <description>Tx 5st priority Descriptor Pointer to the Tx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TxCDO5</name>
          <addressOffset>0x00001344</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxCDO5</name>
              <description>Tx 5st priority Current Descriptor Offset: FDP+CDO = current descriptor pointer.  CDO increments by 16 bytes each time.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRING_MAP1</name>
          <addressOffset>0x00001370</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Ext1_Pri7_route</name>
              <description>Cputag.priority = 7 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext1_Pri6_route</name>
              <description>Cputag.priority = 6 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext1_Pri5_route</name>
              <description>Cputag.priority = 5 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext1_Pri4_route</name>
              <description>Cputag.priority = 4 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext1_Pri3_route</name>
              <description>Cputag.priority = 3 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext1_Pri2_route</name>
              <description>Cputag.priority = 2 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext1_Pri1_route</name>
              <description>Cputag.priority = 1 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext1_Pri0_route</name>
              <description>Cputag.priority = 0 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRING_MAP2</name>
          <addressOffset>0x00001374</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Ext2_Pri7_route</name>
              <description>Cputag.priority = 7 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext2_Pri6_route</name>
              <description>Cputag.priority = 6 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext2_Pri5_route</name>
              <description>Cputag.priority = 5 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext2_Pri4_route</name>
              <description>Cputag.priority = 4 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext2_Pri3_route</name>
              <description>Cputag.priority = 3 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext2_Pri2_route</name>
              <description>Cputag.priority = 2 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext2_Pri1_route</name>
              <description>Cputag.priority = 1 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext2_Pri0_route</name>
              <description>Cputag.priority = 0 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRING_MAP3</name>
          <addressOffset>0x00001378</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Ext3_Pri7_route</name>
              <description>Cputag.priority = 7 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext3_Pri6_route</name>
              <description>Cputag.priority = 6 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext3_Pri5_route</name>
              <description>Cputag.priority = 5 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext3_Pri4_route</name>
              <description>Cputag.priority = 4 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext3_Pri3_route</name>
              <description>Cputag.priority = 3 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext3_Pri2_route</name>
              <description>Cputag.priority = 2 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext3_Pri1_route</name>
              <description>Cputag.priority = 1 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext3_Pri0_route</name>
              <description>Cputag.priority = 0 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRING_MAP4</name>
          <addressOffset>0x0000137C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Ext4_Pri7_route</name>
              <description>Cputag.priority = 7 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext4_Pri6_route</name>
              <description>Cputag.priority = 6 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext4_Pri5_route</name>
              <description>Cputag.priority = 5 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext4_Pri4_route</name>
              <description>Cputag.priority = 4 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext4_Pri3_route</name>
              <description>Cputag.priority = 3 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext4_Pri2_route</name>
              <description>Cputag.priority = 2 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext4_Pri1_route</name>
              <description>Cputag.priority = 1 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext4_Pri0_route</name>
              <description>Cputag.priority = 0 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRING_MAP5</name>
          <addressOffset>0x00001380</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Ext5_Pri7_route</name>
              <description>Cputag.priority = 7 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext5_Pri6_route</name>
              <description>Cputag.priority = 6 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext5_Pri5_route</name>
              <description>Cputag.priority = 5 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext5_Pri4_route</name>
              <description>Cputag.priority = 4 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext5_Pri3_route</name>
              <description>Cputag.priority = 3 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext5_Pri2_route</name>
              <description>Cputag.priority = 2 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext5_Pri1_route</name>
              <description>Cputag.priority = 1 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext5_Pri0_route</name>
              <description>Cputag.priority = 0 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRING_MAP6</name>
          <addressOffset>0x00001384</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Ext6_Pri7_route</name>
              <description>Cputag.priority = 7 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext6_Pri6_route</name>
              <description>Cputag.priority = 6 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext6_Pri5_route</name>
              <description>Cputag.priority = 5 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext6_Pri4_route</name>
              <description>Cputag.priority = 4 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext6_Pri3_route</name>
              <description>Cputag.priority = 3 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext6_Pri2_route</name>
              <description>Cputag.priority = 2 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext6_Pri1_route</name>
              <description>Cputag.priority = 1 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Ext6_Pri0_route</name>
              <description>Cputag.priority = 0 route select. {0,1,7} ring1, {2} ring2, {3} ring3,...</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxFDP2</name>
          <addressOffset>0x00001390</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxFDP2</name>
              <description>Rx  queue Descriptor Pointer to the Rx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxRingSize2</name>
          <addressOffset>0x00001394</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxRingSize2</name>
              <description>The total number of descriptors in the Rx descriptor rings of  queue. 
Act as bit mask, eg. RxRingSize [11:0]: 
0000_0000_1111:  16 descriptors 
0000_0001_1111:  32 descriptors 
0000_0011_1111:  64 descriptors 
0000_0111_1111:  128 descriptors 
0000_1111_1111:  256 descriptors 
0001_1111_1111:  512 descriptors 
0011_1111_1111:  1024 descriptors 
0111_1111_1111:  2048 descriptors 
1111_1111_1111:  4096 descriptors 
Any other value in this register yields undefined results.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxCDO2</name>
          <addressOffset>0x00001396</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxCDO2</name>
              <description>Rx Current Descriptor Offset of  queue: RxFDP+RxCDO = current descriptor pointer.  CDO increments by 16 each time (each increment is one byte)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
