Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>RX_CPU_DESN2</name>
          <addressOffset>0x00001398</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EthrntRxCPU_Des_Num2</name>
              <description>Indicate the number of descriptor of  queue, which has been finished Rx process and returned to IO by CPU. After ending Rx process, CPU needs to update this field.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DES_THRES2</name>
          <addressOffset>0x0000139C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Pse_Des_Thres_on2</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be assert.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Pse_Des_Thres_off2</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be de-assert.  Rx_Pse_Des_Thress_off_ should be less than (EthrntRxCPU_DES_NUM_ - X). X is the maximum rx descriptors will be used for single ingress packet.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxFDP3</name>
          <addressOffset>0x000013A0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxFDP3</name>
              <description>Rx  queue Descriptor Pointer to the Rx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxRingSize3</name>
          <addressOffset>0x000013A4</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxRingSize3</name>
              <description>The total number of descriptors in the Rx descriptor rings of  queue. 
Act as bit mask, eg. RxRingSize [11:0]: 
0000_0000_1111:  16 descriptors 
0000_0001_1111:  32 descriptors 
0000_0011_1111:  64 descriptors 
0000_0111_1111:  128 descriptors 
0000_1111_1111:  256 descriptors 
0001_1111_1111:  512 descriptors 
0011_1111_1111:  1024 descriptors 
0111_1111_1111:  2048 descriptors 
1111_1111_1111:  4096 descriptors 
Any other value in this register yields undefined results.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxCDO3</name>
          <addressOffset>0x000013A6</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxCDO3</name>
              <description>Rx Current Descriptor Offset of  queue: RxFDP+RxCDO = current descriptor pointer.  CDO increments by 16 each time (each increment is one byte)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CPU_DESN3</name>
          <addressOffset>0x000013A8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EthrntRxCPU_Des_Num3</name>
              <description>Indicate the number of descriptor of  queue, which has been finished Rx process and returned to IO by CPU. After ending Rx process, CPU needs to update this field.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DES_THRES3</name>
          <addressOffset>0x000013AC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Pse_Des_Thres_on3</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be assert.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Pse_Des_Thres_off3</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be de-assert.  Rx_Pse_Des_Thress_off_ should be less than (EthrntRxCPU_DES_NUM_ - X). X is the maximum rx descriptors will be used for single ingress packet.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxFDP4</name>
          <addressOffset>0x000013B0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxFDP4</name>
              <description>Rx  queue Descriptor Pointer to the Rx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxRingSize4</name>
          <addressOffset>0x000013B4</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxRingSize4</name>
              <description>The total number of descriptors in the Rx descriptor rings of  queue. 
Act as bit mask, eg. RxRingSize [11:0]: 
0000_0000_1111:  16 descriptors 
0000_0001_1111:  32 descriptors 
0000_0011_1111:  64 descriptors 
0000_0111_1111:  128 descriptors 
0000_1111_1111:  256 descriptors 
0001_1111_1111:  512 descriptors 
0011_1111_1111:  1024 descriptors 
0111_1111_1111:  2048 descriptors 
1111_1111_1111:  4096 descriptors 
Any other value in this register yields undefined results.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxCDO4</name>
          <addressOffset>0x000013B6</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxCDO4</name>
              <description>Rx Current Descriptor Offset of  queue: RxFDP+RxCDO = current descriptor pointer.  CDO increments by 16 each time (each increment is one byte)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CPU_DESN4</name>
          <addressOffset>0x000013B8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EthrntRxCPU_Des_Num4</name>
              <description>Indicate the number of descriptor of  queue, which has been finished Rx process and returned to IO by CPU. After ending Rx process, CPU needs to update this field.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DES_THRES4</name>
          <addressOffset>0x000013BC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Pse_Des_Thres_on4</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be assert.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Pse_Des_Thres_off4</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be de-assert.  Rx_Pse_Des_Thress_off_ should be less than (EthrntRxCPU_DES_NUM_ - X). X is the maximum rx descriptors will be used for single ingress packet.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxFDP5</name>
          <addressOffset>0x000013C0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxFDP5</name>
              <description>Rx  queue Descriptor Pointer to the Rx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxRingSize5</name>
          <addressOffset>0x000013C4</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxRingSize5</name>
              <description>The total number of descriptors in the Rx descriptor rings of  queue. 
Act as bit mask, eg. RxRingSize [11:0]: 
0000_0000_1111:  16 descriptors 
0000_0001_1111:  32 descriptors 
0000_0011_1111:  64 descriptors 
0000_0111_1111:  128 descriptors 
0000_1111_1111:  256 descriptors 
0001_1111_1111:  512 descriptors 
0011_1111_1111:  1024 descriptors 
0111_1111_1111:  2048 descriptors 
1111_1111_1111:  4096 descriptors 
Any other value in this register yields undefined results.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxCDO5</name>
          <addressOffset>0x000013C6</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxCDO5</name>
              <description>Rx Current Descriptor Offset of  queue: RxFDP+RxCDO = current descriptor pointer.  CDO increments by 16 each time (each increment is one byte)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CPU_DESN5</name>
          <addressOffset>0x000013C8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EthrntRxCPU_Des_Num5</name>
              <description>Indicate the number of descriptor of  queue, which has been finished Rx process and returned to IO by CPU. After ending Rx process, CPU needs to update this field.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DES_THRES5</name>
          <addressOffset>0x000013CC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Pse_Des_Thres_on5</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be assert.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Pse_Des_Thres_off5</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be de-assert.  Rx_Pse_Des_Thress_off_ should be less than (EthrntRxCPU_DES_NUM_ - X). X is the maximum rx descriptors will be used for single ingress packet.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxFDP6</name>
          <addressOffset>0x000013D0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxFDP6</name>
              <description>Rx  queue Descriptor Pointer to the Rx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxRingSize6</name>
          <addressOffset>0x000013D4</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxRingSize6</name>
              <description>The total number of descriptors in the Rx descriptor rings of  queue. 
Act as bit mask, eg. RxRingSize [11:0]: 
0000_0000_1111:  16 descriptors 
0000_0001_1111:  32 descriptors 
0000_0011_1111:  64 descriptors 
0000_0111_1111:  128 descriptors 
0000_1111_1111:  256 descriptors 
0001_1111_1111:  512 descriptors 
0011_1111_1111:  1024 descriptors 
0111_1111_1111:  2048 descriptors 
1111_1111_1111:  4096 descriptors 
Any other value in this register yields undefined results.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RxCDO6</name>
          <addressOffset>0x000013D6</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxCDO6</name>
              <description>Rx Current Descriptor Offset of  queue: RxFDP+RxCDO = current descriptor pointer.  CDO increments by 16 each time (each increment is one byte)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CPU_DESN6</name>
          <addressOffset>0x000013D8</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EthrntRxCPU_Des_Num6</name>
              <description>Indicate the number of descriptor of  queue, which has been finished Rx process and returned to IO by CPU. After ending Rx process, CPU needs to update this field.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DES_THRES6</name>
          <addressOffset>0x000013DC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Pse_Des_Thres_on6</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be assert.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Pse_Des_Thres_off6</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num2 and the descriptor   of  queue currently in use by Ethernet Module in which flow control will be de-assert.  Rx_Pse_Des_Thress_off_ should be less than (EthrntRxCPU_DES_NUM_ - X). X is the maximum rx descriptors will be used for single ingress packet.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_FDP1</name>
          <addressOffset>0x000013F0</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxFDP1</name>
              <description>Rx 1st queue Descriptor Pointer to the Rx Ring</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_RingSize1</name>
          <addressOffset>0x000013F4</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxRingSize_1_low</name>
              <description>This is the total number of descriptors in the Rx descriptor rings of 1st queue. 
Act as bit mask, eg. RxRingSize [11:0]:
0000_0000_1111:  16 descriptors
0000_0001_1111:  32 descriptors
0000_0011_1111:  64 descriptors
0000_0111_1111:  128 descriptors
0000_1111_1111:  256 descriptors
0001_1111_1111:  512 descriptors
0011_1111_1111:  1024 descriptors
0111_1111_1111:  2048 descriptors 
1111_1111_1111:  4096 descriptors  
Any other value in this register yields undefined results.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RxRingSize_1_high</name>
              <description>This is the bits11-8 of RxRingSize1.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_CDO1</name>
          <addressOffset>0x000013F6</addressOffset>
          <size>16</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxCDO1</name>
              <description>Rx Current Descriptor Offset of 1st queue: RxFDP+RxCDO = current descriptor pointer.  CDO increments by 16 each time (each increment is one byte).</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMSA</name>
          <addressOffset>0x000013FC</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMSA</name>
              <description>SRAM mapping start address for header mapping to sram</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Probe_selexct</name>
          <addressOffset>0x00001400</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Probe_signal_select</name>
              <description>For debug port signals use Value = 4: Tx/Rx related signals</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIAG1</name>
          <addressOffset>0x00001404</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Rxmring_state</name>
              <description></description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>lso_stats</name>
              <description>Reserved(3bits)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
