Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>CONFIG_CLK_and_Rx_Pse_Des_Thres_h</name>
          <addressOffset>0x0000142C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Pse_Des_Thres_off_1</name>
              <description>This is the Rx_Pse_Des_Thres_off1[11:8].</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Set_d_txc</name>
              <description>Add delay to gmii_txc_out. Used in clk. 
Rgmii_1000: add 2nS delay. 
Rgmii_100:  add 4nS delay. 
Rgmii_10:   add 4nS delay.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rxc_dly_sel</name>
              <description>32-tap delay chain for rxc. This field is valid when CONFIG_CLK_REG.dis_dly_mode is 0.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EthrntRxCPU_Des_Num1</name>
          <addressOffset>0x00001430</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EthrntRxCPU_Des_Num_1_7_0</name>
              <description>Indicate the number of descriptor of 1st queue, which has been finished Rx process and returned to IO by CPU. After ending Rx process, CPU needs to update this field.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Pse_Des_Thres_on_1_7_0</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num1 and the descriptor   of 1st queue currently in use by Ethernet Module in which flow control will be assert.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Pse_Des_Thres_off_1_7_0</name>
              <description>Specifies the difference between EthrnetRxCPU_Des_Num1 and the descriptor   of 1st queue currently in use by Ethernet Module in which flow control will be de-assert.   Rx_Pse_Des_Thress_off_1 should be less than (EthrntRxCPU_DES_NUM_1 - X). X is the maximum rx descriptors will be used for single ingress packet.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EthrntRxCPU_Des_Num_1_11_8</name>
              <description>This is the EthrntRxCPU_Des_Num1[11:8].</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Pse_Des_Thres_on_1_11_8</name>
              <description>This is the Rx_Pse_Des_Thres_on1[11:8].</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHER_IO_CMD</name>
          <addressOffset>0x00001434</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>max_dma_sel_0</name>
              <description>Select the dma burst size on bus(memory controller should assert continuous btrdy). 
00:16 DW(1DW=4B) 
01:32 DW 10:64 DW 11:128DW. 
AmebaI/AmebaPro/AmebaPro2 only support DMA burst length = 16DW</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ShortDesFormat</name>
              <description>Short descriptor format. Set 1 tx/rx descriptor will use old format  - 4x32bit each item, set 0 use new format to support sram mapping AmebaI/AmebaPro/AmebaPro2 only support old format (1b'1)</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>max_dma_sel_1</name>
              <description>see Ethernet_IO_CMD.bit31 AmebaI/AmebaPro/AmebaPro2 only support DMA burst length = 16DW</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_early_tx</name>
              <description>default 0, 
0: disable, 
1: enable.  
Disable early tx by GAMC while tx command descriptor.IPCS, UDPCS or TCPCS are set to high. For multiple tx descriptor application, this field should be 0. For low lxbus throughput environment, this field should be 0. For slow clk_gmac application, this field should be 0.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPktTimer</name>
              <description>Timer to trigger TxOK interrupt before receipt of TxIntMitigation pkts. 0000 - no timer set 0001 ~ 1111 : the timer interval defining a multiple of TU  ex:  0011 = timer interval set to 3 x4 =12TU  Once TxOK is asserted the timer  mechanism is reinitialized.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TxIntMitigation_3</name>
              <description>see Ethernet_IO_CMD.bit18-16</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPktTimer_3</name>
              <description>see Ethernet_IO_CMD.bit15-13</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RxIntMitigation_3</name>
              <description>see Ethernet_IO_CMD.bit10-8</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tsh</name>
              <description>Tx Threshold: Specifies the threshold level in the Tx FIFO to begin the transmission. When the byte count of the data in the Tx FIFO reaches this level, (or the FIFO contains at least one complete packet or the end of a packet) the Ethernet module will transmit this packet. 
00:128B. 
01:256B. 
10:512B. 
11:1024B.    
For poor lxbus bandwidth, tsh should be set b11.      
In rle0516, this field should be setted 0 or 1 (128B).</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TxIntMitigation_2_0</name>
              <description>This sets the number of packets received before TxOK interrupt is triggered. 
0000- 1  pkt 
0001- 4  pkts 
0010- 8  pkts 
0011- 12 pkts 
0100- 16 pkts 
0101- 20 pkts 
0110- 24 pkts 
0111- 28 pkts ...</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPktTimer_2_0</name>
              <description>Timer to trigger RxOK interrupt before receipt of RxIntMitigation pkts. 
0000 - no timer set 
0001 ~ 1111 : the timer interval defining a multiple of TU  ex:  011 = timer interval set to 3 x4 =12TU  This only applies to packets of size larger than 128 bytes.  
Once RxOK is asserted the timer  mechanism is reinitialized.  For ingress pkt which is short than 128B, RxOK interrupt asserts after DMA completes.</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFTH</name>
              <description>Rx Threshold: Specifies the threshold level in the Rx FIFO to begin the transmission. When the byte count of the data in the Rx FIFO reaches this level, (or the FIFO contains at least one complete packet or the end of a packet) the Ethernet module will transmit this packet. 
00: 1024B 
01: 128B 
10: 256B 
11: 512B 
The rx threshold should be larger than maximum dma burst size. The combination of max_dma_sel and rxfth are listed as followed:
max_dma_sel            rxfth                                                                                       
b00(64B)               b00(1024B), b01 (128B), b10(256B), b11(512B).                                               
b01(128B)              b00(1024B), b10(256B), b11(512B).                                                           
b10(256B)              b00(1024B), b11(512B),
                                                                   
In rle0516:  SW should not set rxfth to 0b00 due to the rx fifo size is only 512B. The recommend value of rle0516 is 0b11 for performance concerns.  00 = no rx threshold. The Ethernet Module begins the transfer of data after having received a whole packet in the FIFO. 
01 = 32 bytes 
10 = 64 bytes 
11 = 128 bytes  
max_dma_sel            rxfth                                     
b0(64B)                b10(64B), b11(128B).                      
b1(128B)               b11(128B).</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RxIntMitigation_2_0</name>
              <description>This sets the number of packets received before RxOK interrupt is triggered. 
0000- 1 pkt 
0001- 4 pkts 
0010- 8 pkts 
0011- 12pkts 
0100- 16 pkts 
0101- 20 pkts 
0110- 24 pkts 
0111- 28 pkts ...</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_int_timer_sel</name>
              <description>RXPktTimer, TXPktTimer Unit. (TU)  
       speed      TU              
00:      10M      25.6uS
00:      100M      2.56uS
00:      1000M      256nS
01:      10M      102.4uS
01:      100M      10.24uS
01:      1000M      1.024uS
10:      10M      409.6uS
10:      100M      40.96uS
10:      1000M      4.096uS
11:      10M      1.6mS
11:      100M      0.16mS
11:      1000M      16uS</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RE</name>
              <description>MII Rx Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TE</name>
              <description>MII Tx Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TxFN4th</name>
              <description>4th Priority DMA-Ethernet Transmit enable. 1: Enable.  0: Disable.</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TxFN3rd</name>
              <description>3rd Priority DMA-Ethernet Transmit enable. 1: Enable. 0: Disable.</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TxFN2nd</name>
              <description>2nd Priority DMA-Ethernet Transmit enable. 1: Enable. 0: Disable.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TxFN1st</name>
              <description>1st Priority DMA-Ethernet Transmit enable. 1: Enable. 0: Disable.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_CMD1</name>
          <addressOffset>0x00001438</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0xB5000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cf_orgcol_sel</name>
              <description>0: using GMAC internal generated collision signal 
1: using MII interface collision signal( (default 1: AmebaPro2)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Dsc_format_extra</name>
              <description>Extra descriptor format. In rle0437, bit28 is is write only. SW should set this field before set IO_CMD.TE or RE to 1. AmebaI/AmebaPro/AmebaPro
2 only support the fixed value 3b'011</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_precise_dma</name>
              <description>0: disable precise DMA transfer. 
1: enable precise DMA transfer. 
AmebaI/AmebaPro/AmebaPro2 only support 1b'0 (disable precise DMA transfer)</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Rxokint_msk_128B</name>
              <description>1: For ingress pkt which is short than 128B, RxOK interrupt asserts after DMA completes    (compatible issue). 0: For ingress pkt which is short than 128B, RxOK interrupt does not assert after DMA completes.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_RX_MRING</name>
              <description>Enable rx multiple rings. 
1: rx using multiple rings.    max: 6rings (ring1 to ring6). 
0 rx using single ring (ring1 only).  
SW should set this field before set IO_CMD.TE or RE to 1 AmebaI/AmebaPro/AmebaPro2 only support single rx ring</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_4GB</name>
              <description>1: support 4GB addressing in lx master bus.    For gmac used in rl0371 and after. 
0: no support. For project used in rle0390 and before.  
SW should set this field before set IO_CMD.TE or RE to 1 AmebaPro2 support 4GB addressing AmebaI/AmebaPro only support 1GB addressing</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRING6</name>
              <description>Ethernet-DMA Receive Ring6 enable. 
1: Enable.  
0: Disable. 
If RXRING6 is not used, SW should put one dummy rx command descriptor (own = 0) at RXFDP6_reg.</description>
              <bitRange>[21:21]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRING5</name>
              <description>Ethernet-DMA Receive Ring5 enable. 
1: Enable.  
0: Disable. 
If RXRING5 is not used, SW should put one dummy rx command descriptor (own = 0) at RXFDP5_reg.</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRING4</name>
              <description>Ethernet-DMA Receive Ring4 enable. 
1: Enable.  
0: Disable. 
If RXRING4 is not used, SW should put one dummy rx command descriptor (own = 0) at RXFDP4_reg.</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRING3</name>
              <description>Ethernet-DMA Receive Ring3 enable. 
1: Enable.  
0: Disable. 
If RXRING3 is not used, SW should put one dummy rx command descriptor (own = 0) at RXFDP3_reg.</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRING2</name>
              <description>Ethernet-DMA Receive Ring2 enable. 
1: Enable.  
0: Disable. 
If RXRING2 is not used, SW should put one dummy rx command descriptor (own = 0) at RXFDP2_reg.</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRING1</name>
              <description>Ethernet-DMA Receive Ring1 enable. 
1: Enable. 
0: Disable. 
If RXRING1 is not used, SW should put one dummy rx command descriptor (own = 0) at RXFDP1_reg.</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>Tx_hl_pri_sel</name>
              <description>b00: TX ring uses strict priority. 
b01: TX ring uses high and low queue priority.    
Inside high queue, tx ring is round robin.    
Inside low queue, tx ring is round robin.   
Strict priority is used for high and low queue selection. b10 and b11: reserved.  In RL6266, when tx_hl_pri is 1, txq1_h and txq2_h are 1 and txq3_h, txq4_h and txq5_h are 0.  
SW should set this field before set IO_CMD.TE to 1. 
AmebaI/AmebaPro/AmebaPro2 only support the fixed value 2b'00</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TxFN5th</name>
              <description>5th Priority DMA-Ethernet Transmit enable. 
1: Enable.  
0: Disable. 
After IO_CMD.TE is set high, TxFN5th is writable.</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>txq5_h</name>
              <description>1: TxFN5th is a high queue. 
0: TxFN5th is a low queue. 
This field is only used in eee.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>txq4_h</name>
              <description>1: TxFN4th is a high queue. 
0: TxFN4th is a low queue. 
This field is only used in eee.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>txq3_h</name>
              <description>1: TxFN3rd is a high queue. 
0: TxFN3rd is a low queue. 
This field is only used in eee.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>txq2_h</name>
              <description>1: TxFN2nd is a high queue. 
0: TxFN2nd is a low queue. 
This field is only used in eee.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>txq1_h</name>
              <description>1: TxFN1st is a high queue. 
0: TxFN1st is a low queue. 
This field is only used in eee.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WOL</name>
          <addressOffset>0x0000143C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wol_imr</name>
              <description>Interrupt mask of wol_pme.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Wol_pme</name>
              <description>HW asserts pme when  
a.HW entered wol idle state and  
b.received magic ingress pkt. 
HW asserts pme to wake up system.  
Wol_pme indicates: 
0: No magic pkt receives. 
1: HW had received one magic pkt and system should wake up.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Wol_sts</name>
              <description>HW enters wol idle state when  
a. SW issues wol_cmd state and  
b. HW tx/rx function enter idle state.  
Wol_sts indicates: 
0: HW is not in wol idle state. 
1: HW is in wol idle state.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Wol_cmd</name>
              <description>Issue wol command by SW</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
