Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DVP_REG</name>
      <baseAddress>0x41805000</baseAddress>
      <size>0x00000084</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000084</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DVP_TRANSFER</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dvp_state</name>
              <description>1: dvp enable
0: dvp disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>dvp_start</name>
              <description>Start The transfer is launch if set this bit. When clear this bit, hardware will stop transfer after current image frame finish transfer.
Dvp_start置1表示开流
停流方式可以选择配置immediate_stop或者是frame_stop来实现立即停流或者帧后停流.配置完immediate_stop或者是frame_stop后,dvp_state会自动拉低,拉低时间参考immediate_stop或者是frame_stop寄存器描述</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_CONFIG</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pclk_stop_mode</name>
              <description>PCLK Stop mode. 
Used when sensor uses HSYNC/VSYNC to perform gating on pclk, or pclk_stop_en open
0: normal
1: sensor pixclk stop mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pixclk_edge_sel</name>
              <description>Pixel clock sample edge. 0: falling edge, 1: rising edge.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vsync_polarity</name>
              <description>Vsync polarity 0: active low, 1: active high.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hsync_polarity</name>
              <description>Hsync polarity 0: active low, 1: active high.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_CROP_START_X</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dmy_pix_num</name>
              <description>YUV path Unit: Bytes.
This field indicates the number of dummy data before the valid data output. Hardware must bypass these dummy data and not sample the dummy data.
yuv422 format config value is a multiple of 4

Eg: For YUV422 format, each pixel is represented by 2 bytes. Therefore, setting this field to 8 means skipping 4 pixels

In formats like YUYV, YVYU, UYVY, and VYUY, data streams from the sensor to the DVP with each two pixels sharing the same UV components. Since each pair requires 2 pixels of 16bpp, it amounts to a total of 4 bytes. Therefore, operations involving this data should be done in multiples of 4 bytes.
用于crop丢掉数据</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_CROP_START_Y</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dmy_line_num</name>
              <description>YUV path
This field indicates the number of dummy line before the valid line output. Hardware must bypass these dummy lines and not sample the dummy line data.
用于crop丢掉数据</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_WIDTH</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pix_num_pre</name>
              <description>YUV path Unit:bytes
HORIZON_NUM10:0. This field indicates the number of valid data per line.
yuv422 format config value is a multiple of 4

Eg: For YUV422 format, each pixel is represented by 2 bytes. Therefore, setting this field to 8 means reserved 4 pixels
用于crop选取有效数据,选取后的数据送往sub sample</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_HEIGHT</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>line_num_pre</name>
              <description>YUV path
VERTICAL_NUM10:0. This field indicates the number of valid line per frame.
用于crop选取有效数据,选取后的数据送往sub sample</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_FRAME_CNT</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_num</name>
              <description>Frame_cnt 7:0. This field is used to count the number of active Vsync from RealTimeImage transfer start. If the RealTimeImage transfer stop, the value of this register do not change. As soon as trigger RealTimeImage transfer, reset the value of thi register and restart to count.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_SUBSAMPLE_CTL</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>l_sub_sample_en</name>
              <description>YUV path
Vertical (Line) Sub Sample control. 
0: not sub sample, 1: sub sample.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>p_sub_sample_en</name>
              <description>YUV path
Horizontal (Pixel) Sub sample control.
0: not sub sample, 1: sub sample.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_SUBSAMPLE_CFG</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>l_sub_vld_num</name>
              <description>YUV path
Vertical Sub sample valid line number. 
1-15:有效的line num是1-15
0:有效的line num是16</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>l_sub_drop_num</name>
              <description>YUV path
Vertical Sub sample invalid line number. 
1-15:丢掉的line num是1-15
0:丢掉的line num是16</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>p_sub_vld_num</name>
              <description>YUV path
Horizontal (Pixel) Sub sample valid pixel number.
yuv422 format config value: 
4: vld 4 byte
8: vld 8 byte
12: vld 12 byte
0: vld 16 byte</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>p_sub_drop_num</name>
              <description>YUV path
Horizontal (Line) Sub sample invalid pixel number. 
yuv422 format config value: 
4: drop 4 byte
8: drop 8 byte
12: drop 12 byte
0: drop 16 byte</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_FRMAE_VLD_CTL</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_vld_num</name>
              <description>FRAME_VALID_NUM
4'b0: all frame are valid
otherwise: one frame valid in every (FRAME_VALID_NUM + 1 ) frames</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_YUV_TRANSFER</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>image_format</name>
              <description>yuv422 sensor in format
2'b00: YUYV YUYV
2'b01: YVYU YVYU
2'b10: UYVY UYVY
2'b11: VYUY VYUY</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_JPEG_TRANSFER</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>jpg_en</name>
              <description>DVP JPEG MODE EN
1: Enable DVP JPEG 
0: Disable DVP JPEG</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>jpg_mode</name>
              <description>DVP JPEG Mode
3'b000:Valid mode
Use VSYNC as the frame synchronization signal and HSYNC as the horizontal synchronization signal. There is no dummy data in the frame. Support VSYNC pulse or level timing
3'b001:Frame mode
Use VSYNC as the frame synchronization signal and HSYNC as the horizontal synchronization signal. There is dummy data in the frame. The frame contains valid data length , and valid data length is at the beginning of each line.
3'b010:Frame mode
Use VSYNC as the frame synchronization signal and HSYNC as the horizontal synchronization signal. There is dummy data in the frame. The frame contains valid data length , and valid data length is at the end of each line.
3'b011:Frame mode
Use VSYNC as the frame synchronization signal and HSYNC as the horizontal synchronization signal. There is dummy data in the frame. The frame does not contains valid data length.
3'b100:Use HSYNC as the frame synchronization signal,no dummy data</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_PCLK_GATING_CTL</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pclk_gating_en</name>
              <description>PCLK_GATING_EN
用于PCLK被VSYNC/HSYNC gating的情况,配合pclk_stop_mode使用,当pclk_gating_en置1时,pclk_stop_mode也要置1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_PAD_CTL</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pix_bit_swp</name>
              <description>pixel bit switch
2'b01:
pad[9:0]={bit7,bit6,bit5,bit4,bit3,bit2,bit1,bit0,2'd0}
2'b10:
pad[9:0]={2'd0,bit0,bit1,bit2,bit3,bit4,bit5,bit6,bit7}
2'b00&amp;2'b11:
pad[9:0]={2'd0,bit7,bit6,bit5,bit4,bit3,bit2,bit1,bit0}
YUV422 &amp; JPG stream only 1 byte data valid in one PCLK cycle</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_STOP</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_stop</name>
              <description>The stop will not be triggered untill the current frame ends
当前帧结束以后停流(帧已经发送到psram中),下一帧不接收,当前帧结束以后会拉低dvp_state</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>immediate_stop</name>
              <description>If set this bit, hardware will stop transfer and return idle state immediately. Hardware will auto clear this bit.
立即停流,同时拉低dvp_state.dma里存储的outstanding data依旧会发送出来,防止卡死platform</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_JPG_FRAME_LENGTH</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>jpg_frame_length</name>
              <description>jpg frame size</description>
              <bitRange>[21:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_INT_ST</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_cnt_int</name>
              <description>all frame buffer are fulled frames , and DVP will not to receive frames in time.then gen overflow int, need to check and clear frame status done register</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ddr_overflow_int</name>
              <description>ddr_overflow_int
Only for frame buffer mode
The allocated psram/ddr capacith is less than one frame</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>buf_overflow_int</name>
              <description>dma buffer overflow int
DMA needs to cache a certain amount of data before sending data to psram/ddr. The cached data is placed in buffer(memory), If there is too much cache and it is not sent, it means overflow</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>frame_break_int</name>
              <description>frame_break_int
yuv422 mode, The pixel count is internally compared with the configured frame size(ddr_len)
pixel count是经过sub sample后的数据进行计算,这时的数据会送入缓存的buffer,等待传入psram.
pixel count会与ddr_len进行比对,当pixel count小于ddr_len时会触发中断.
情况1:ddr len等于frame size, 当前帧破图,需要丢掉
情况2:ddr_len大于frame size,该中断没有参考意义
情况3: ddr_len小于frame size,可以通过ddr_overflow_int得知信息,需要及时调整ddr_len,使其满足frame_size
jpg mode, The pixel will be counted internally, and for jpg timing with valid data length, it will be compared with the data length</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>frame_start_int</name>
              <description>frame_start_int
indicating that DVP is receiving a frame of image from sensor
both yuv fb and jpeg
帧开始中断,这时dma已经准备发送图片</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>frame_end_int</name>
              <description>frame_end_int
both yuv fb and jpeg
indicating that DVP has transfered one frame of image to memory</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>line_end_int</name>
              <description>line_end_int
Only for YUV path
indicates that the image has been transferred to the configured number of lines(interrupt_line_num).
计算的是dma向psram中传输的line num</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_INT_RAW</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_cnt_raw_int</name>
              <description>frame buffer cnt overflow raw int, need to clear frame status done</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ddr_overflow_raw_int</name>
              <description>ddr_overflow_raw_int
ddr/psram中断,通过所配置的ddr_len进行判断,模块内部会对传输的burst_length进行计数,当计数大于ddr_len时会触发中断</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>buf_overflow_raw_int</name>
              <description>buf_overflow_raw_int
dma缓存buffer中断,dma会缓存发往ddr/psram的数据,当满足一笔burst时dma会发起请求.当请求一直得不到回应同时缓存buffer溢出时会触发中断.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>frame_break_raw_int</name>
              <description>frame_break_raw_int</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>frame_start_raw_int</name>
              <description>frame_start_raw_int</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>frame_end_raw_int</name>
              <description>frame_end_raw_int</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>line_end_raw_int</name>
              <description>line_end_raw_int</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_INT_EN</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_cnt_int_en</name>
              <description>frame_cnt_int_en</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ddr_overflow_int_en</name>
              <description>ddr_overflow_int_en</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>buf_overflow_int_en</name>
              <description>buf_overflow_int_en</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>frame_break_int_en</name>
              <description>frame_break_int_en</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>frame_start_int_en</name>
              <description>frame_start_int_en</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>frame_end_int_en</name>
              <description>frame_end_int_en</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>line_end_int_en</name>
              <description>line_end_int_en</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
