Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>DVP_INT_CLR</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_cnt_int_clr</name>
              <description>frame_cnt_int_clr</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ddr_overflow_int_clr</name>
              <description>ddr_overflow_int_clr</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>buf_overflow_int_clr</name>
              <description>buf_overflow_int_clr</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>frame_break_int_clr</name>
              <description>frame_break_int_clr</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>frame_start_int_clr</name>
              <description>frame_start_int_clr</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>frame_end_int_clr</name>
              <description>frame_end_int_clr</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>line_end_int_clr</name>
              <description>line_end_int_clr</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_DMA_CTRL</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>interrupt_line_num</name>
              <description>interrupt line num, for gen specific line end int</description>
              <bitRange>[18:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>frame_buf_num</name>
              <description>number of used frame buffer 
used number = frame_buf_num + 1</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ring_buffer_en</name>
              <description>ring buffer mode enable
ring buffer mode只在yuv mode下使用,因为jpg数据流没有行的概念,DVP与MJPEG无法进行交互.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_FRAME_ADDR0</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_addr0</name>
              <description>frame buffer 0 start addr, 4 byte align
ring buffer start addr,4 byte align</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_FRAME_ADDR1</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_addr1</name>
              <description>frame buffer 1 start addr, 4 byte align</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_FRAME_ADDR2</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_addr2</name>
              <description>frame buffer 2 start addr, 4 byte align</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_FRAME_ADDR3</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_addr3</name>
              <description>frame buffer 3 start addr, 4 byte align</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_DDR_LEN</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ddr_len</name>
              <description>ddr length, 4 byte align
frame_buffer mode is frame size
ring buffer mode is ring buffer szie
The size of the slave space written by dma, here refers to the size of the psram allocated
YUV MODE
ddr_len配置大小应为frame size
JPG MODE
jpg数据流大小不固定,这里需要保险期间配置大一些,配置大小需要计算jpg的压缩比例和压缩前的图片大小,建议值是压缩比*sensor分辨率
RING BUFFER,FRAME BUFFE共用寄存器
切换方式通过ring_buffer_en进行切换.
ring_buffer_en为1时,ddr_len表示ring buffer length
ring_buffer_en为0时,ddr_len表示frame buffer length</description>
              <bitRange>[23:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_DMA_DEBUG_REG0</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>burst_req</name>
              <description></description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>idle_state_clr</name>
              <description></description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>trans_state</name>
              <description></description>
              <bitRange>[22:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>data_state</name>
              <description></description>
              <bitRange>[17:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cmd_raddr</name>
              <description></description>
              <bitRange>[14:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cmd_waddr</name>
              <description></description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>resp_raddr</name>
              <description></description>
              <bitRange>[6:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>resp_waddr</name>
              <description></description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_DMA_DEBUG_REG1</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bufin_cnt</name>
              <description></description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bufout_cnt</name>
              <description></description>
              <bitRange>[13:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>burst_cnt</name>
              <description></description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_FUNC_DEBUG_REG0</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>p_sts_ccs</name>
              <description></description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ccs_f_sts</name>
              <description></description>
              <bitRange>[13:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ccs_l_sts</name>
              <description></description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>p_sub_sts</name>
              <description></description>
              <bitRange>[5:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>l_sub_sts</name>
              <description></description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DVP_DMA_STATUS</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>frame_status_done3</name>
              <description>frame buffer 3 done
1: frame buffer full
0: frame buffer empty or receiving frame
当frame_end_int中断拉高时,需要读取该寄存器地址,通过bit位置1的位置来得知哪一块frame buffer经过接收完一帧数据.然后software及时去相应的frame buffer取数据,取完数据以后将该bit位写1置0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>frame_status_done2</name>
              <description>frame buffer 2 done
1: frame buffer full
0: frame buffer empty or receiving frame
当frame_end_int中断拉高时,需要读取该寄存器地址,通过bit位置1的位置来得知哪一块frame buffer经过接收完一帧数据.然后software及时去相应的frame buffer取数据,取完数据以后将该bit位写1置0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>frame_status_done1</name>
              <description>frame buffer 1 done
1: frame buffer full
0: frame buffer empty or receiving frame
当frame_end_int中断拉高时,需要读取该寄存器地址,通过bit位置1的位置来得知哪一块frame buffer经过接收完一帧数据.然后software及时去相应的frame buffer取数据,取完数据以后将该bit位写1置0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>frame_status_done0</name>
              <description>frame buffer 0 done
1: frame buffer full
0: frame buffer empty or receiving frame
当frame_end_int中断拉高时,需要读取该寄存器地址,通过bit位置1的位置来得知哪一块frame buffer经过接收完一帧数据.然后software及时去相应的frame buffer取数据,取完数据以后将该bit位写1置0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
