Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PPE_REG</name>
      <baseAddress>0x41900000</baseAddress>
      <size>0x000001D0</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000001D0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GLB_STATUS</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Global status Register</description>
          <resetValue>0x00000007</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHN_INACT</name>
              <description>Indicates whether the internal DMA channels are inactive (protocol over).
Bit 15:
0x0: There are currently outstanding transactions for AWID=0
0x1: There are currently no outstanding transactions for AWID=0
Bit i (16 &lt;= i &lt;= 31):
0x0: There are currently outstanding transactions for ARID=i-16
0x1: There are currently no outstanding transactions for ARID=i-16</description>
              <bitRange>[31:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RUN_STATUS</name>
              <description>Run status
0x0: Disabled
0x1: Runing
0x2: Inactive (w/o outstanding)
0x3: Suspend (w/ outstanding)
Others: reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LAY_EN</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Layer enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAY_EN</name>
              <description>Input layers enable field.
Bit i (1 &lt;= i &lt;=3 )
0x0: Input layer i is disabled.
0x1: Input layer i is enabled.</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RELOAD_CFG</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>Reload configuration Register</description>
          <resetValue>0x00020000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUTO_CLR</name>
              <description>Auto clear "SET_VALID" after loading layer settings</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SET_VALID</name>
              <description>Setting is valid
Will be auto set to 1 when writing 1 to GLB_EN</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LYR_RELOAD_EN</name>
              <description>Layers setting reload enable
Bit0~15: Layer0~15</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LL_CFG</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>Linked List configuration Register</description>
          <resetValue>0x072A0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LL_PRIOR</name>
              <description>Priority (ARQos) (Reserved)</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LL_MAX_ARLEN_LOG</name>
              <description>Limit of ARLen (Reserved)</description>
              <bitRange>[26:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LL_ARCACHE</name>
              <description>ARCache (Reserved). Refer to AXI4 protocol.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LL_INCR</name>
              <description>INCR or FIXED burst for reading linked list item (Reserved)</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LL_ARSIZE</name>
              <description>ARSize for reading linked list item (Reserved)</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>Layer_LL_EN</name>
              <description>Update layers registers by linked list enable
Bit0~15: Layer0~15</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LLP</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Linked List Pointer Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LLP</name>
              <description>Linked List Pointer
Note: Must align to 4 Bytes. Bits[1:0] is read only and return 0 on a read.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>Secure enable register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECURE</name>
              <description>Secure enable
This field can only be modified by secure APB transaction.
0x0: PPE in non-secure mode
0x1: PPE in secure mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LINE_INDEX</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>Line index register</description>
          <resetValue>0x000007FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINE_INDEX</name>
              <description>Line index for line over interrupt
LINE_OVER interrupt is raised when the transaction of last pixel of this index marked line has been completed.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RELEASE_DATE</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>Release Date Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RELEASE_DATE</name>
              <description>Release Date</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTL_VERSION</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>RTL version Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTL_VERSION</name>
              <description>RTL version</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_ST</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Interrupt status (raw &amp; mask) register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTR_ST_DIV0_ERR</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ST_BUS_ERR</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ST_SET_ERR</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ST_SECURE_ERR</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ST_SUSP_INAC</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ST_LINE_OVER</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ST_LOAD_OVER</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ST_FR_OVER</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_ST_ALL_OVER</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_RAW</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Interrupt raw status register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTR_RAW_DIV0_ERR</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_RAW_BUS_ERR</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_RAW_SET_ERR</name>
              <description>Setting error (Reserved)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_RAW_SECURE_ERR</name>
              <description>Secure error
Raised after non-secure APB request access secure PPE.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_RAW_SUSP_INAC</name>
              <description>Master port inactive after being suspended
Raised after the master port is inactive and PPE is suspended.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_RAW_LINE_OVER</name>
              <description>Line index over
Raised after the transaction of last pixel of LINE_INDEX marked line has been completed.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_RAW_LOAD_OVER</name>
              <description>Register load over
Raised after layers registers load to internal DMA.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_RAW_FR_OVER</name>
              <description>Frame over
Raised after every frame completion.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTR_RAW_ALL_OVER</name>
              <description>All frames over
Raised after all frames completion.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CLR</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Interrupt clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTR_CLR_DIV0_ERR</name>
              <description>Wirte 1 to clear the corresponding interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INTR_CLR_BUS_ERR</name>
              <description>Wirte 1 to clear the corresponding interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INTR_CLR_SET_ERR</name>
              <description>Wirte 1 to clear the corresponding interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INTR_CLR_SECURE_ERR</name>
              <description>Wirte 1 to clear the corresponding interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INTR_CLR_SUSP_INAC</name>
              <description>Wirte 1 to clear the corresponding interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INTR_CLR_LINE_OVER</name>
              <description>Wirte 1 to clear the corresponding interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INTR_CLR_LOAD_OVER</name>
              <description>Wirte 1 to clear the corresponding interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INTR_CLR_FR_OVER</name>
              <description>Wirte 1 to clear the corresponding interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INTR_CLR_ALL_OVER</name>
              <description>Wirte 1 to clear the corresponding interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASK</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>Interrupt mask register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTR_MASK_DIV0_ERR</name>
              <description></description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_MASK_BUS_ERR</name>
              <description></description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_MASK_SET_ERR</name>
              <description></description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_MASK_SECURE_ERR</name>
              <description></description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_MASK_SUSP_INAC</name>
              <description></description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_MASK_LINE_OVER</name>
              <description></description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_MASK_LOAD_OVER</name>
              <description></description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_MASK_FR_OVER</name>
              <description></description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTR_MASK_ALL_OVER</name>
              <description></description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_ERR_DTL</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>BUS error detail register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WR_ERR</name>
              <description>The mark for write error response
Assert this bit when receiving error response from axi B cahnnel</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_ERR</name>
              <description>The mark for read error response
Assert bit N when receiving error response from axi_rid=N</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOR_CTRL</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>XOR control register</description>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XOR</name>
              <description>0x1: Enable XOR function
0x0: Disable XOR function</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT_LAYER_ADDR_L</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>Address of the first pixel register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_LAYER_ADDR_L</name>
              <description>Address of the first pixel (Physical address)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT_LAYER_PIC_SIZE</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>Canvas size register</description>
          <resetValue>0x00010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_LAYER_PIC_HEIGHT</name>
              <description>Canvas height (in pixels)
Must be greater than 0.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESULT_LAYER_PIC_WIDTH</name>
              <description>Canvas width (in pixels)
Must be greater than 0.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT_LAYER_PIC_CFG</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>Picture configuration register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_LAYER_LINE_LEN</name>
              <description>Indicates the bytes in memory between two vertically adjacent pixels.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESULT_LAYER_BG_SRC</name>
              <description>Background source
0x0: Use CONST_BG as background
0x1: Use lyr1 as background</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESULT_LAYER_FORMAT</name>
              <description>Pixel format</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT_LAYER_CONST_BG</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>Constant background color register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_LAYER_ABGR</name>
              <description>Background ABGR (in ABGR8888 format)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
