Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>RESULT_LAYER_BUS_CFG</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>Master port BUS configuration register</description>
          <resetValue>0x0000070A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_LAYER_PRIOR</name>
              <description>Priority (AWQos)</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESULT_LAYER_MAX_AXLEN_LOG</name>
              <description>Limit of AWLen</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESULT_LAYER_AXCACHE</name>
              <description>AWCache Refer to AXI4 protocol.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESULT_LAYER_INCR</name>
              <description>AWBurst
0x1: AWBurst = INCR
0x0: AWBurst = FIXED</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT_LAYER_AXSIZE</name>
              <description>AWSize
Refer to AXI4 protocol. (AXI cmd size must be less than or equal to BUS width)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT_LAYER_BLK_SIZE</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>Canvas size register</description>
          <resetValue>0x00010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_LAYER_BLK_HEIGHT</name>
              <description>Block height (in pixels)
Must be greater than 0 and less than or equal to canvas width.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESULT_LAYER_BLK_WIDTH</name>
              <description>Block width (in pixels)
Must be greater than 0 and less than or equal to canvas width.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_ADDR_L</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>Address of the first pixel register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_ADDR_L</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_PIC_SIZE</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>Canvas size register</description>
          <resetValue>0x00010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_PIC_HEIGHT</name>
              <description>Picture height (in pixels)
Must be greater than 0.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER1_PIC_WIDTH</name>
              <description>Picture width (in pixels)
Must be greater than 0.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_PIC_CFG</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>Picture configuration register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_LINE_LEN</name>
              <description>Indicates the bytes in memory between two vertically adjacent pixels.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER1_KEY_MODE</name>
              <description>Color keying match mode
0x0, 0x1: Disable
0x2: Inside ((Rmin&lt;=R&lt;=Rmax) &amp; (Gmin&lt;=G&lt;=Gmax) &amp; (Bmin&lt;=B&lt;=Bmax))
0x3: Outside ((R&lt;Rmin) | (R&gt;Rmax) | (G&lt;Gmin) | (G&gt;Gmax) | (B&lt;Bmin) | (B&gt;Bmax))</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER1_INTERP</name>
              <description>Interpolation
0x0: Nearest-neighbor
0x1: Bilinear</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER1_PIX_SRC</name>
              <description>Pixel source:
0x0: CONST_PIX
0x1: DMA (read from memory)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER1_FORMAT</name>
              <description>Format of pixels from memory</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_CONST_PIX</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>Constant pixel register</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_ABGR</name>
              <description>In ABGR8888 format</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_BUS_CFG</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>Master port BUS configuration register</description>
          <resetValue>0x0000070A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MAX_AXLEN_LOG</name>
              <description>Limit of ARLen</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER1_AXCACHE</name>
              <description>ARCache
Refer to AXI4 protocol.
Note: Set to 0x6 to enable read buffer for input layer</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER1_INCR</name>
              <description>ARBurst
0x1: ARBurst = INCR
0x0: ARBurst = FIXED</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT_LAYER1_AXSIZE</name>
              <description>ARSize
Refer to AXI4 protocol. 
· AXI cmd size must be less than or equal to BUS width.
· Must be 0x2 when AXCACHE=6.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_WIN_MIN</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description>Minimum coordinate of the input window register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_Y_MIN</name>
              <description>Y coordinate</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER1_X_MIN</name>
              <description>X coordinate</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_WIN_MAX</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description>Maximum coordinate of the input window register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_Y_MAX</name>
              <description>Y coordinate</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER1_X_MAX</name>
              <description>X coordinate</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_KEY_MIN</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description>Minimum of the color key match condition register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_BGR_MIN</name>
              <description>Minimum BGR of the color key match condition
In BGR888 format.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_KEY_MAX</name>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <description>Maximum of the color key match condition register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_BGR_MAX</name>
              <description>Maximum BGR of the color key match condition
In BGR888 format.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_MATRIX_E11</name>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <description>Matrix E11 register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MATRIX_E11</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_MATRIX_E12</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description>Matrix E12 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MATRIX_E12</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_MATRIX_E13</name>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <description>Matrix E13 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MATRIX_E13</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_MATRIX_E21</name>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <description>Matrix E21 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MATRIX_E21</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_MATRIX_E22</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description>Matrix E22 register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MATRIX_E22</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_MATRIX_E23</name>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <description>Matrix E23 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MATRIX_E23</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_MATRIX_E31</name>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <description>Matrix E31 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MATRIX_E31</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.
· Elements E31~E33 are RO if SUPPORT_PERSPECTIVE_i = 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_MATRIX_E32</name>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <description>Matrix E32 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MATRIX_E32</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.
· Elements E31~E33 are RO if SUPPORT_PERSPECTIVE_i = 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER1_MATRIX_E33</name>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <description>Matrix E33 register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER1_MATRIX_E33</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.
· Elements E31~E33 are RO if SUPPORT_PERSPECTIVE_i = 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_ADDR_L</name>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <description>Address of the first pixel register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_ADDR_L</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_PIC_SIZE</name>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <description>Canvas size register</description>
          <resetValue>0x00010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_PIC_HEIGHT</name>
              <description>Picture height (in pixels)
Must be greater than 0.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER2_PIC_WIDTH</name>
              <description>Picture width (in pixels)
Must be greater than 0.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_PIC_CFG</name>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <description>Picture configuration register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_LINE_LEN</name>
              <description>Indicates the bytes in memory between two vertically adjacent pixels.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER2_KEY_MODE</name>
              <description>Color keying match mode
0x0, 0x1: Disable
0x2: Inside ((Rmin&lt;=R&lt;=Rmax) &amp; (Gmin&lt;=G&lt;=Gmax) &amp; (Bmin&lt;=B&lt;=Bmax))
0x3: Outside ((R&lt;Rmin) | (R&gt;Rmax) | (G&lt;Gmin) | (G&gt;Gmax) | (B&lt;Bmin) | (B&gt;Bmax))</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER2_INTERP</name>
              <description>Interpolation
0x0: Nearest-neighbor
0x1: Bilinear</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER2_PIX_SRC</name>
              <description>Pixel source:
0x0: CONST_PIX
0x1: DMA (read from memory)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER2_FORMAT</name>
              <description>Format of pixels from memory</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_CONST_PIX</name>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <description>Constant pixel register</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_ABGR</name>
              <description>In ABGR8888 format</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_BUS_CFG</name>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <description>Master port BUS configuration register</description>
          <resetValue>0x0000070A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MAX_AXLEN_LOG</name>
              <description>Limit of ARLen</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER2_AXCACHE</name>
              <description>ARCache
Refer to AXI4 protocol.
Note: Set to 0x6 to enable read buffer for input layer</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER2_INCR</name>
              <description>ARBurst
0x1: ARBurst = INCR
0x0: ARBurst = FIXED</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT_LAYER2_AXSIZE</name>
              <description>ARSize
Refer to AXI4 protocol. 
· AXI cmd size must be less than or equal to BUS width.
· Must be 0x2 when AXCACHE=6.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_WIN_MIN</name>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <description>Minimum coordinate of the input window register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_Y_MIN</name>
              <description>Y coordinate</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER2_X_MIN</name>
              <description>X coordinate</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
