Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>INPUT_LAYER2_WIN_MAX</name>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <description>Maximum coordinate of the input window register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_Y_MAX</name>
              <description>Y coordinate</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER2_X_MAX</name>
              <description>X coordinate</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_KEY_MIN</name>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <description>Minimum of the color key match condition register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_BGR_MIN</name>
              <description>Minimum BGR of the color key match condition
In BGR888 format.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_KEY_MAX</name>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <description>Maximum of the color key match condition register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_BGR_MAX</name>
              <description>Maximum BGR of the color key match condition
In BGR888 format.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_MATRIX_E11</name>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <description>Matrix E11 register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MATRIX_E11</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_MATRIX_E12</name>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <description>Matrix E12 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MATRIX_E12</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_MATRIX_E13</name>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <description>Matrix E13 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MATRIX_E13</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_MATRIX_E21</name>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <description>Matrix E21 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MATRIX_E21</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_MATRIX_E22</name>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <description>Matrix E22 register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MATRIX_E22</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_MATRIX_E23</name>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <description>Matrix E23 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MATRIX_E23</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_MATRIX_E31</name>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <description>Matrix E31 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MATRIX_E31</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.
· Elements E31~E33 are RO if SUPPORT_PERSPECTIVE_i = 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_MATRIX_E32</name>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <description>Matrix E32 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MATRIX_E32</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.
· Elements E31~E33 are RO if SUPPORT_PERSPECTIVE_i = 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER2_MATRIX_E33</name>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <description>Matrix E33 register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER2_MATRIX_E33</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.
· Elements E31~E33 are RO if SUPPORT_PERSPECTIVE_i = 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_ADDR_L</name>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <description>Address of the first pixel register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_ADDR_L</name>
              <description></description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_PIC_SIZE</name>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <description>Canvas size register</description>
          <resetValue>0x00010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_PIC_HEIGHT</name>
              <description>Picture height (in pixels)
Must be greater than 0.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER3_PIC_WIDTH</name>
              <description>Picture width (in pixels)
Must be greater than 0.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_PIC_CFG</name>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <description>Picture configuration register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_LINE_LEN</name>
              <description>Indicates the bytes in memory between two vertically adjacent pixels.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER3_KEY_MODE</name>
              <description>Color keying match mode
0x0, 0x1: Disable
0x2: Inside ((Rmin&lt;=R&lt;=Rmax) &amp; (Gmin&lt;=G&lt;=Gmax) &amp; (Bmin&lt;=B&lt;=Bmax))
0x3: Outside ((R&lt;Rmin) | (R&gt;Rmax) | (G&lt;Gmin) | (G&gt;Gmax) | (B&lt;Bmin) | (B&gt;Bmax))</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER3_INTERP</name>
              <description>Interpolation
0x0: Nearest-neighbor
0x1: Bilinear</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER3_PIX_SRC</name>
              <description>Pixel source:
0x0: CONST_PIX
0x1: DMA (read from memory)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER3_FORMAT</name>
              <description>Format of pixels from memory</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_CONST_PIX</name>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <description>Constant pixel register</description>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_ABGR</name>
              <description>In ABGR8888 format</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_BUS_CFG</name>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <description>Master port BUS configuration register</description>
          <resetValue>0x0000070A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MAX_AXLEN_LOG</name>
              <description>Limit of ARLen</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER3_AXCACHE</name>
              <description>ARCache
Refer to AXI4 protocol.
Note: Set to 0x6 to enable read buffer for input layer</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER3_INCR</name>
              <description>ARBurst
0x1: ARBurst = INCR
0x0: ARBurst = FIXED</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT_LAYER3_AXSIZE</name>
              <description>ARSize
Refer to AXI4 protocol. 
· AXI cmd size must be less than or equal to BUS width.
· Must be 0x2 when AXCACHE=6.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_WIN_MIN</name>
          <addressOffset>0x0000019C</addressOffset>
          <size>32</size>
          <description>Minimum coordinate of the input window register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_Y_MIN</name>
              <description>Y coordinate</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER3_X_MIN</name>
              <description>X coordinate</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_WIN_MAX</name>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <description>Maximum coordinate of the input window register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_Y_MAX</name>
              <description>Y coordinate</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LAYER3_X_MAX</name>
              <description>X coordinate</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_KEY_MIN</name>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <description>Minimum of the color key match condition register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_BGR_MIN</name>
              <description>Minimum BGR of the color key match condition
In BGR888 format.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_KEY_MAX</name>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <description>Maximum of the color key match condition register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_BGR_MAX</name>
              <description>Maximum BGR of the color key match condition
In BGR888 format.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_MATRIX_E11</name>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <description>Matrix E11 register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MATRIX_E11</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_MATRIX_E12</name>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <description>Matrix E12 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MATRIX_E12</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_MATRIX_E13</name>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <description>Matrix E13 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MATRIX_E13</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_MATRIX_E21</name>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <description>Matrix E21 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MATRIX_E21</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_MATRIX_E22</name>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <description>Matrix E22 register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MATRIX_E22</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_MATRIX_E23</name>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <description>Matrix E23 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MATRIX_E23</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_MATRIX_E31</name>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <description>Matrix E31 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MATRIX_E31</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.
· Elements E31~E33 are RO if SUPPORT_PERSPECTIVE_i = 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_MATRIX_E32</name>
          <addressOffset>0x000001C8</addressOffset>
          <size>32</size>
          <description>Matrix E32 register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MATRIX_E32</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.
· Elements E31~E33 are RO if SUPPORT_PERSPECTIVE_i = 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_LAYER3_MATRIX_E33</name>
          <addressOffset>0x000001CC</addressOffset>
          <size>32</size>
          <description>Matrix E33 register</description>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT_LAYER3_MATRIX_E33</name>
              <description>Element E11 ~ E33 of coordinates transformation matrix
· Elements E12, E21, E31~E33 are RO if SUPPORT_ROTATION_i = 0.
· Elements E31~E33 are RO if SUPPORT_PERSPECTIVE_i = 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
