Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MJPEG_REG</name>
      <baseAddress>0x418c0000</baseAddress>
      <size>0x000000D4</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000000D4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>MJPEG control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>jpeg_idle</name>
              <description>jpeg idle status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>jpeg_frame_stop</name>
              <description>jpeg stop processing after current frame enc/dec done</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>jpeg_quick_stop</name>
              <description>jpeg stop processing after current axi cmd complete.</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>jpeg_start</name>
              <description>jpeg start processing</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>MJPEG config register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>y_size</name>
              <description>Number of lines in source image</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hdr_en</name>
              <description>Header Processing (generation/parsing) enabled when set</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>component_num_scan</name>
              <description>Number of Components for Scan Header Marker Segment, minus one.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>colspctype</name>
              <description>colspctype defines the number of quantization tables to insert in the output stream minus one. 0 = Grayscale, 1 = YUV, 2 = RGB, 3 = CMYK</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_or_de</name>
              <description>Selects encoding or decoding behavior. When this bit is set, the CODEC acts as a decoder; otherwise, it works as an encoder</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rst_marker_processing_en</name>
              <description>Enables restart marker processing when set. The ECS Encoder inserts restart markers every NRST +1 MCU</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>component_num_img</name>
              <description>Number of color components in the source image minus 1. For example, in a grayscale image its value is 0; for a RGB or YUV image its value is = 2</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUNUM</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>MJPEG MCU number register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcu_num</name>
              <description>Number of MCU units to encode minus 1</description>
              <bitRange>[25:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RST_INTERVAL</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>MJPEG reset interval control register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>x_size</name>
              <description>Number of pixels per line</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>nrst</name>
              <description>NRST value is the number of MCUs between two restart markers minus 1. The content of this register is ignored if the rst_marker_processing_en bit is not set.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENT0</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>MJPEG component register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>h_factor</name>
              <description>Horizontal Sampling factor for component i.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>v_factor</name>
              <description>Vertical Sampling factor for component i.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>block_num</name>
              <description>The value is the number of data units (8 x 8 blocks of data) of the color component i contained in the MCU minus 1.
The range is 0-15, because 4 bits are set aside for this field.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>qtable_index</name>
              <description>It indicates the quantization table to be used for the color component i. Since four quantization tables are possible, 2
bits are sufficient for this field (bits 3-2 in the register).</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>htable_index_ac</name>
              <description>It selects the Huffman table for the encoding of the AC coefficients in the data units belonging to the color
component i. Since only two AC tables are allowed in the baseline algorithm, one bit is sufficient (bit 1 in the register).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>htable_index_dc</name>
              <description>It bit selects the Huffman table for the encoding of the DC coefficient in the data units belonging to the color component i. Since only two DC tables are allowed in the baseline algorithm, one bit is sufficient (bit 0 in the register).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENT1</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description>MJPEG component register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>h_factor</name>
              <description>Horizontal Sampling factor for component i.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>v_factor</name>
              <description>Vertical Sampling factor for component i.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>block_num</name>
              <description>The value is the number of data units (8 x 8 blocks of data) of the color component i contained in the MCU minus 1.
The range is 0-15, because 4 bits are set aside for this field.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>qtable_index</name>
              <description>It indicates the quantization table to be used for the color component i. Since four quantization tables are possible, 2
bits are sufficient for this field (bits 3-2 in the register).</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>htable_index_ac</name>
              <description>It selects the Huffman table for the encoding of the AC coefficients in the data units belonging to the color
component i. Since only two AC tables are allowed in the baseline algorithm, one bit is sufficient (bit 1 in the register).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>htable_index_dc</name>
              <description>It bit selects the Huffman table for the encoding of the DC coefficient in the data units belonging to the color component i. Since only two DC tables are allowed in the baseline algorithm, one bit is sufficient (bit 0 in the register).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENT2</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description>MJPEG component register2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>h_factor</name>
              <description>Horizontal Sampling factor for component i.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>v_factor</name>
              <description>Vertical Sampling factor for component i.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>block_num</name>
              <description>The value is the number of data units (8 x 8 blocks of data) of the color component i contained in the MCU minus 1.
The range is 0-15, because 4 bits are set aside for this field.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>qtable_index</name>
              <description>It indicates the quantization table to be used for the color component i. Since four quantization tables are possible, 2
bits are sufficient for this field (bits 3-2 in the register).</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>htable_index_ac</name>
              <description>It selects the Huffman table for the encoding of the AC coefficients in the data units belonging to the color
component i. Since only two AC tables are allowed in the baseline algorithm, one bit is sufficient (bit 1 in the register).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>htable_index_dc</name>
              <description>It bit selects the Huffman table for the encoding of the DC coefficient in the data units belonging to the color component i. Since only two DC tables are allowed in the baseline algorithm, one bit is sufficient (bit 0 in the register).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENT3</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description>MJPEG component register3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>h_factor</name>
              <description>Horizontal Sampling factor for component i.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>v_factor</name>
              <description>Vertical Sampling factor for component i.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>block_num</name>
              <description>The value is the number of data units (8 x 8 blocks of data) of the color component i contained in the MCU minus 1.
The range is 0-15, because 4 bits are set aside for this field.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>qtable_index</name>
              <description>It indicates the quantization table to be used for the color component i. Since four quantization tables are possible, 2
bits are sufficient for this field (bits 3-2 in the register).</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>htable_index_ac</name>
              <description>It selects the Huffman table for the encoding of the AC coefficients in the data units belonging to the color
component i. Since only two AC tables are allowed in the baseline algorithm, one bit is sufficient (bit 1 in the register).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>htable_index_dc</name>
              <description>It bit selects the Huffman table for the encoding of the DC coefficient in the data units belonging to the color component i. Since only two DC tables are allowed in the baseline algorithm, one bit is sufficient (bit 0 in the register).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_QMEM</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description>MJPEG Qtable memory configuration</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_qmem_en</name>
              <description>Qtable configuration information, SRAM chip selection signal, write 1 when reading and writing</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_qmem_we</name>
              <description>Qtable configuration information, SRAM write enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_qmem_addr</name>
              <description>Qtable configuration information, selected address for SRAM</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_qmem_din</name>
              <description>Qtable configuration information, write SRAM value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_HUFFENC</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description>MJPEG huffman memory configuration</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_huffenc_en</name>
              <description>huffman table configuration information, SRAM chip selection signal, write 1 when reading and writing</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_huffenc_we</name>
              <description>huffman table configuration information, SRAM write enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_huffenc_addr</name>
              <description>huffman table configuration information, selected address for SRAM</description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_huffenc_din</name>
              <description>huffman table configuration information, write SRAM value</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_DHT</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description>MJPEG DQT memory configuration</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dht_en</name>
              <description>DHT configuration information, SRAM chip selection signal, write 1 when reading and writing</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dht_we</name>
              <description>DHT configuration information, SRAM write enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dht_addr</name>
              <description>DHT configuration information, selected address for SRAM</description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dht_din</name>
              <description>DHT configuration information, write SRAM value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DONE_INT_STS</name>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <description>MJPEG encoder/decoder done interrupt status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>jpeg_dec_done_int</name>
              <description>JPEG decoding done interrupt (JPEG clock domain)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>jpeg_enc_done_int</name>
              <description>JPEG encoding done interrupt (JPEG clock domain)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DONE_INT_EN</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>MJPEG encoder/decoder done interrupt enable signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>jpeg_dec_done_int_en</name>
              <description>JPEG decoding interrupt enable signal</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>jpeg_enc_done_int_en</name>
              <description>JPEG encoding interrupt enable signal</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DONE_INT_CLR</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>MJPEG encoder/decoder done interrupt clear signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>jpeg_dec_done_int_clr</name>
              <description>JPEG encoding interrupt clearing signal</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>jpeg_enc_done_int_clr</name>
              <description>JPEG encoding interrupt clearing signal</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DONE_INT_RAW</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>MJPEG encoder/decoder done interrupt raw status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>jpeg_dec_done_int_raw</name>
              <description>JPEG decoding done raw interrupt (JPEG clock domain)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>jpeg_enc_done_int_raw</name>
              <description>JPEG encoding done raw interrupt (JPEG clock domain)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
