Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>RD_START_ADDR</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>MJPEG encoder/decoder reading buffer address</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rd_start_addr</name>
              <description>The starting address of the read during encoding or decoding, aligned with 4 bytes</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_BUFFER_LEN</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>MJPEG encoder/decoder reading buffer length</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rd_len</name>
              <description>The length of the read during encoding or decoding</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RING_BUFFER_MODE</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer enable signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ring_buffer_en</name>
              <description>ring buffer enable signal</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RING_BUFFER_SIZE</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer size</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ring_buffer_size</name>
              <description>ring buffer size (unit: line). The ring buffer size  must be a multiple of 8, while the DDR len of DVP is in byte units. When in ring buffer mode, it is necessary to satisfy the condition of ring_fuffer_stize * width * 2=DDR len</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_START_ADDR</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>MJPEG encoder/decoder writeing buffer address</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wr_start_addr</name>
              <description>The starting address of the write during encoding or decoding, aligned with 4 bytes</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENC_WR_START_ADDR_1</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer address 1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>enc_wr_start_addr_1</name>
              <description>the encoder stream write address for buffer1 in the ring buffer mode, aligned with 4 bytes</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENC_WR_START_ADDR_2</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer address 2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>enc_wr_start_addr_2</name>
              <description>the encoder stream write address for buffer2 in the ring buffer mode, aligned with 4 bytes</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENC_WR_START_ADDR_3</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer address 3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>enc_wr_start_addr_3</name>
              <description>the encoder stream write address for buffer3 in the ring buffer mode, aligned with 4 bytes</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_BUFFER_LEN</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>MJPEG writing buffer size</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_length</name>
              <description>The size of the address space allocated to the encoder write stream, aligned with 4 bytes</description>
              <bitRange>[23:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENC_BUFFER_RECEIVED_LENGTH</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>MJPEG received length of buffer0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_received_length_0</name>
              <description>the received length of buffer0</description>
              <bitRange>[22:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENC_BUFFER_RECEIVED_LENGTH_1</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>MJPEG received length of buffer1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_received_length_1</name>
              <description>the received length of buffer1</description>
              <bitRange>[22:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENC_BUFFER_RECEIVED_LENGTH_2</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>MJPEG received length of buffer2</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_received_length_2</name>
              <description>the received length of buffer2</description>
              <bitRange>[22:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENC_BUFFER_RECEIVED_LENGTH_3</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>MJPEG received length of buffer3</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_received_length_3</name>
              <description>the received length of buffer3</description>
              <bitRange>[22:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_OVERFLOW_INT_STS</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description>MJPEG overflow interrupt status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ringbuffer_overflow_int</name>
              <description>ring buffer overflow interrupt flag,indicate ringbuffer overflow during encoding</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wr_overflow_int</name>
              <description>write overflow interrupt flag,indicate write buffer is overflowed during encoding and decoding</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_OVERFLOW_INT_EN</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description>MJPEG overflow interrupt enable signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ringbuffer_overflow_int_en</name>
              <description>ring buffer overflow interrupt enable signal</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wr_overflow_int_en</name>
              <description>write overflow interrupt enable signal</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_OVERFLOW_INT_CLR</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>MJPEG overflow interrupt clear signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ringbuffer_overflow_int_clr</name>
              <description>ring buffer overflow interrupt clear signal</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wr_overflow_int_clr</name>
              <description>write overflow interrupt clear signal</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_OVERFLOW_INT_RAW</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>MJPEG overflow interrupt raw status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ringbuffer_overflow_int_raw</name>
              <description>ring buffer overflow interrupt raw signal</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wr_overflow_int_raw</name>
              <description>write overflow interrupt raw signal</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_FRAME_NUM</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>MJPEG number of buffer in ringbufffer mode</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_frame_num</name>
              <description>Indicates the number of buffers configured for encoding the output stream when encoding in ring buffer mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_FRAME_STATUS</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>MJPEG buffer status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_frame_status</name>
              <description>bits [0] [1] [2] [3] respectively represent the status of the buffer ([x] bit 1 indicates which buffer already contains a frame of encoded data)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_FRAME_CNT</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>MJPEG using buffer index</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_frame_cnt</name>
              <description>indicates which buffer is currently being written to</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_CFG</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>MJPEG timeout configuration</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timeout_cfg</name>
              <description>timeout value (unit: clock cycle)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_CFG_EN</name>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <description>MJPEG timeout function enable</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timeout_cfg_en</name>
              <description>enable/disable timeout function</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_STS</name>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <description>MJPEG timeout interrupt status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timeout_int</name>
              <description>timeout interrupt status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_EN</name>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <description>MJPEG timeout interrupt enable signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timeout_int_en</name>
              <description>timeout interrupt enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_CLR</name>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <description>MJPEG timeout interrupt clear signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timeout_int_clr</name>
              <description>timeout interrupt clear</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_RAW</name>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <description>MJPEG timeout interrupt raw status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timeout_int_raw</name>
              <description>timeout interrupt raw status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_CNT_OVERFLOW_INT_STS</name>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer count overflow interrupt status</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_cnt_overflow_int</name>
              <description>ringbuffer count overflow interrupt status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_CNT_OVERFLOW_INT_EN</name>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer count overflow interrupt enable signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_cnt_overflow_int_en</name>
              <description>ringbuffer count overflow interrupt enable signal</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_CNT_OVERFLOW_INT_CLR</name>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer count overflow interrupt clear signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_cnt_overflow_int_clr</name>
              <description>ringbuffer count overflow interrupt clear signal</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_CNT_OVERFLOW_INT_RAW</name>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer count overflow interrupt raw signal</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>buffer_cnt_overflow_int_raw</name>
              <description>ringbuffer count overflow interrupt raw status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISS_FRAME_CNT</name>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <description>MJPEG ringbuffer miss frame count</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>miss_frame_cnt</name>
              <description>ringbuffer miss frame count</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
