Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP_REG</name>
      <baseAddress>0x4100a800</baseAddress>
      <size>0x00000084</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000084</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADC_CTRL0</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00001B05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_ASY_DELAY</name>
              <description>Asy SAR ADC compare time. Control the delay of the comparator. If the comparator fails to produce a result for a long time, it will force the output of the result.
00:Fast;
01:
10:
11:Slow:</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HV5VPWR_OSEL33_1SEL5</name>
              <description>This Reg is used to inform Analog HV5V's PAD whether it is a true 5V voltage. It is flexible for some applications where the 5V PAD is connected to 3.3V. HV5V PAD power is 3.3V or 5V signal to Aphy.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_LDO2P5_VOL</name>
              <description>00:2.125V
01:2.25V
10:2.375V
11:2.50V
AIF default 01:2.25V</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_LDOAV09_VOL</name>
              <description>AUX ADC 0.9V LDO voltage:
00:0.85V
01:0.9V
10:0.95V (default)
11:1.0V
AIF default 10:0.95V;</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_INSWING_0SEL33V_1SEL18V</name>
              <description>0:ADC Input Full swing is 3.3V;
1:ADC Input Full swing is 1.8V;
AIF default 0; Each CH is independent</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_INSWING_0SEL5V_1SEL1833V</name>
              <description>0 :ADC Input Full swing is 5V;
1: The input range depends on SEL_INSWING_0SEL33V_1SEL18V
AIF default 0: Each CH is independent</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_ADC_CKS</name>
              <description>EN_ADC_CKS = 0,ADC_CKS=0 or 1,ADC always Stop to Sample State;
EN_ADC_CKS = 1,ADC_CKS=1,ADC Sample State;
EN_ADC_CKS = 1,ADC_CKS=0,ADC Sample Finish,ADC compare start;
AIF default 1;</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_VREFP_LPF</name>
              <description>When 0.AUX ADC Reference LPF disable;
When 1,AUX ADC Reference LPF enable;
AIF default 1;</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_META</name>
              <description>EN_META = 1, When ADC compare not finish,force comparator to 0;
EN_META = 0, Do nothing;
AIF default 1;</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>META_DELAY</name>
              <description>EN_META=1,When ADC compare not finish,force comparator to 0;
META_DELAY select the delay to force comparator to 0;
AIF default 01;</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CTRL1</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL_VREFP_VOL</name>
              <description>AUX ADC Vrefp voltage:
0000:1.45V
0001:1.50V
0010:1.55V
0011:1.60V
0100:1.65V
0101:1.70V
0110:1.75V
0111:1.80V
1000:1.85V
1001:1.875V
1010:1.90V
1011:1.95V
1100:2.00V
1101:2.05V
1110:2.10V
1111:2.15V

Cs * VIN = 8C * Vrefp
3C * 5V = 8C * 1.875V
4C * 3.3V = 8C * 1.65V
8C * 1.8V = 8C * 1.8V
AIF default 0100: 1.65V;</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_CTRL</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL_LDO1P8_VOL</name>
              <description>00:1.65V
01:1.70V
10:1.75V
11:1.80V
AIF default 10:1.75V;</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_TOUCH_CUR_0V2I_1IBHN</name>
              <description>When 0 Touch compensate current can be VCVS current
When 1 Touch compensate current use constant current
AIF default 0: Use VCVS current</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TOUCHCUR_CALI</name>
              <description>1: Touch V2I Current Input Voltage use VDD_TOUCH 1.8V, not use Cm voltage, Can test Cm current for calibration;
0: Touch V2I Current Input Voltage use Cm voltage;
AIF default 0: Not in Calibration state;</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TOUCHCUR_2CM</name>
              <description>1: EN Touch Compensate Current to 2.2nF Cap CM;
0: Disable Touch Compensate Current to 2.2nF Cap CM;
AIF default 1;</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TOUCH_CKCM</name>
              <description>EN_TOUCH_CKCM=0,Or TOUCH_CKCM=0, Touch CM not reset to VLDO_1P8;
EN_TOUCH_CKCM=1,And TOUCH_CKCM=1,Touch CM reset to VLDO_1P8;
AIF default 1;</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CK_TOUCH_CM</name>
              <description>When 1,Touch Cm connect to VDD_Touch 1.8V;
When 0,Touch Cm dis-connect to VDD_Touch 1.8V;</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TOUCH_CHANNEL</name>
              <description>EN_TOUCH_CHANNEL =0,All Touch channel not work, Cs not to GND also not to CM;
EN_TOUCH_CHANNEL =1,TOUCH_LANE_SEL&lt;3:0&gt;select Touch Lane to Cs and CM;
AIF default 1;</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TOUCH_CKCS</name>
              <description>EN_TOUCH_CKCS=0,OR TOUCH_CKCS=0,Touch CS reset to GND;
EN_TOUCH_CKCS=1,And TOUCH_CKCS=1,Touch CS set to CM;
AIF default 1;</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CK_TOUCH_CS</name>
              <description>When 0,Touch Cs to GND;
When 1,Touch Cs to Cm;</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POW_CTRL</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POW_ADC</name>
              <description>POW_ADC =0.AUX ADC off;
POW_ADC =1,AUX ADC on;
AIF default 1;</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_AUXADC_MBIAS</name>
              <description>POW_ADC_MBIAS=0,AUX ADC and Touch bias current all off;
POW_ADC_MBIAS=1,AUX ADC and Touch bias current on;
AIF default 1;</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_LDO1P8</name>
              <description>1:Pow Touch LDO 1.8V VDD_TOUCH;
0:Off Touch LDO 1.8V VDD_TOUCH;
AIF default 1:Pow on Touch LDO 1.8V;</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_LDO2P5</name>
              <description>1:AUX_ADC 2.5V LDO on;
0:AUX_ADC 2.5V LDO off;
AIF default1;</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_LDOAV09</name>
              <description>1:AUX_ADC 0.9V LDO on;
0:AUX_ADC 0.9V LDO off;
AIF default 1;</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_REFPGEN</name>
              <description>1:AUX_ADC Reference on;
0:AUX_ADC Reference off;
AIF default1;</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_TOUCH_CMP</name>
              <description>1:Touch Comparator on;
0:Touch Comparator off;
AIF default0;</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POW_TOUCH_CUR</name>
              <description>1:Touch compensate Current on;
0:Touch compensate Current off;
AIF default0;</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCCKOFF33V_B</name>
              <description>When 0,Internal DVDD power off, All ADC and Touch off;</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCCKOFFB_DV</name>
              <description>When 0,Internal DVDD power off, All ADC and Touch off;</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_ONLY0</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOUCH_LANE_SEL</name>
              <description>Touch Lane selection:

