Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
0000: lane0;
......
1111: lane15;</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_ONLY1</name>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL_TOUCH_CUR</name>
              <description>Touch compensate current:
When Cm 1800mV example:
50uA+&lt;4:0&gt;*5uA:

Current = (50uA +&lt;4:0&gt;*5uA)*(Vcm/180K)/10uA;

AIF default 01000,current 80uA;</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTC_ONLY2</name>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL_TOUCHCMP_VREF</name>
              <description>Touch Comparator Vref:
000:0.5V
001:0.525V
010:0.55V
011:0.575v
100:0.60V
101:0.625V
110:0.65V
111:0.675V
AIF default 100:0.6V;</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DRV_CFG</name>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>force_ctc_clk_en</name>
              <description>In CTC decoupling mode, the CK_TOUCH_CS clock signal is continuously provided by the digital circuit.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>force_ctc_decouple_en</name>
              <description>Enable CTC decoupling mode, the CTC interface signal will be controlled by software</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>force_adc_pow_en</name>
              <description>Enable ADC decoupling mode, the ADC power signal will be controlled by software</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CTC_DECO</name>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ctc_cnt_timeout_clr</name>
              <description>intr crean signal</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_cnt_timeout_en</name>
              <description>intr enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctc_cnt_timeout_raw_intr</name>
              <description>raw intr</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ctc_cnt_timeout_intr</name>
              <description>An interrupt is triggered when the timer reaches the ch_Sc_times</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_POW_CNT0</name>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0018F18F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pwr_to_ckcm_cnt</name>
              <description>The delay time between  pow_ldo1p8 and ck_touch_cm</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_en_lpf_cnt</name>
              <description>The delay time between  pow_mbias and en_vrefp_lpf</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_POW_CNT1</name>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x0031F18F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pwr_adc_cnt</name>
              <description>The delay time between  pow_adc and ck_ad</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_to_enadc_cks</name>
              <description>The delay time between  pow_adc and en_adc_cks</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT0_DIV</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt0</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt0+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT1_DIV</name>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt1</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt1+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT2_DIV</name>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt2</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt2+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT3_DIV</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt3</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt3+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT4_DIV</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt4</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt4+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT5_DIV</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt5</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt5+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT6_DIV</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt6</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt6+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT7_DIV</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt7</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt7+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT8_DIV</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt8</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt8+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT9_DIV</name>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt9</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt9+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT10_DIV</name>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt10</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt10+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT11_DIV</name>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt11</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt11+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT12_DIV</name>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt12</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt12+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT13_DIV</name>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt13</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt13+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT14_DIV</name>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt14</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt14+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_HCNT15_DIV</name>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <description>ADC Channel Clock Divider Register</description>
          <resetValue>0x00000013</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bit_adc_clk_hcnt15</name>
              <description>This field defines clock driver high level of  chn in ADC module. 
high level =( bit_adc_clk_hcnt15+1) * ip_clk period .  hcnt11-13 is rsvd.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_CLK_COV</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000017</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>adc_cov_mode</name>
              <description>0: convert time is 500ns
1: convert time is 700ns</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_iso_cnt</name>
              <description>Control the time of iso ch. if adc_iso_cnt is 0, iso_ch will disable</description>
              <bitRange>[29:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_adc_clk_lcnt</name>
              <description>This field defines clock driver lower level of  chn in ADC module.when source clock is 4M, the duration of low level need &gt;=2 for timing req.(&gt;=0.5us)
lower level  =bit_adc_clk_lcnt* ip_clk period</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_VOL_LIST_0</name>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>adc_sel_vrefp_vol_7</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_6</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_5</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_4</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_3</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_2</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_1</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_0</name>
              <description>AUX ADC Vrefp voltage:
0000:1.45V
0001:1.50V
0010:1.55V
0011:1.60V
0100:1.65V
0101:1.70V
0110:1.75V
0111:1.80V
1000:1.85V
1001:1.875V
1010:1.90V
1011:1.95V
1100:2.00V
1101:2.05V
1110:2.10V
1111:2.15V

Cs * VIN = 8C * Vrefp
3C * 5V = 8C * 1.875V
4C * 3.3V = 8C * 1.65V
8C * 1.8V = 8C * 1.8V
AIF default 0100: 1.65V;</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_ADC_VOL_LIST_1</name>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>adc_sel_vrefp_vol_15</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_14</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_13</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_12</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_11</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_10</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_9</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_vrefp_vol_8</name>
              <description>Refer to adc_sel_vrefp_vol_0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
