Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>REG_ADC_INSWING_SEL</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description></description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>adc_sel_33vs18_v15</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v14</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v13</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v12</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v11</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v10</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v9</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v8</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v7</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v6</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v5</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v4</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v3</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v2</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v1</name>
              <description>Refer to adc_sel_33vs18_v0</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_33vs18_v0</name>
              <description>0:ADC Input Full swing is 3.3V;
1:ADC Input Full swing is 1.8V;
AIF default 0; Each CH is independent</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v15</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v14</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v13</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v12</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v11</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v10</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v9</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v8</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v7</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v6</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v5</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v4</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v3</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v2</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v1</name>
              <description>Refer to adc_sel_5vs18_v0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_sel_5vs18_v0</name>
              <description>0 :ADC Input Full swing is 5V;
1: The input range depends on adc_sel_33vs18_v0
AIF default 0: Each CH is independent</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DUMMY</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>Dummy Register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dummy</name>
              <description>dummy register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
