Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RXI300_REG_P1</name>
      <baseAddress>0x400c6000</baseAddress>
      <size>0x00001220</size>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001220</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ELR_0_PLD0_S</name>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <description>Error log payload register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_BSTINDEX_S</name>
              <description>Burst index of the error request.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTLEN_S</name>
              <description>Burst Length of the error request.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTTYPE_S</name>
              <description>BurstSeq of the error request.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CMD_S</name>
              <description>CMD of the error request.
0x1: Write command
0x2: Read command</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SRC_S</name>
              <description>Error source of the error request.
0x20: M0,M8,M10 access p1s0-0 secure default                                                                                                                                                                                             0x21: M0,M8,M10 access p1s0-1~p1s0-4 secure default                                                                                                                                                                                                0x22: M0,M8,M10 access p1s0-5~p1s0-6 secure default                                                                                                                                                                                        0x11: M0,M8,M10 access p1s0-7~p1s0-8 secure default                                                                                                                                                                                                0x10: M0,M8,M10 access p1s1-0~p1s1-6 secure default</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_PLD1_S</name>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <description>Error log payload register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_LOCK_S</name>
              <description>AxLock of the error request.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CACHE_S</name>
              <description>AxCache of the error request.</description>
              <bitRange>[29:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ElR_PROT_S</name>
              <description>AxProt of the error request.</description>
              <bitRange>[25:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SIZE_S</name>
              <description>Size of the error request.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_ID_S</name>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <description>Error log ID information register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ID_S</name>
              <description>Tagid of the error request.
8'b0000????: M0 KM4TZ security error
8'b1101????: M8 KM4NS security error
8'b1111????: M10 OTPC/SIC access error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_ADR0_S</name>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <description>Error log addrress register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR0_S</name>
              <description>Address[31:0] of the error request.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_ADR1_S</name>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <description>Error log addrress register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR1_S</name>
              <description>Address[63:32] of the error request.</description>
              <bitRange>[63:32]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_CODE_S</name>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <description>Error code register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_CODE_S</name>
              <description>The error code of error request, if it's 0, indicates that there is no error request. 
8'h00: No error
8'h02: Secure fault error</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_INTR_CLR_S</name>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <description>Error log clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_INTR_CLR_S</name>
              <description>Error log interrupt clear. Writing 1'b1 to the register will trigger a 1-cycle pulse interrupt clear. It has to write 1'b1 to this register every time when the error exception occurs.
Note that this register is write-only, the return value of reading this register is meaningless.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_PLD0_S</name>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <description>Error log payload register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_BSTINDEX_S</name>
              <description>Burst index of the error request.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTLEN_S</name>
              <description>Burst Length of the error request.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTTYPE_S</name>
              <description>BurstSeq of the error request.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CMD_S</name>
              <description>CMD of the error request.
0x1: Write command
0x2: Read command</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SRC_S</name>
              <description>Error source of the error request.
0x20: M0,M8,M10 access p1s0-0 secure default                                                                                                                                                                                             0x21: M0,M8,M10 access p1s0-1~p1s0-4 secure default                                                                                                                                                                                                0x22: M0,M8,M10 access p1s0-5~p1s0-6 secure default                                                                                                                                                                                        0x11: M0,M8,M10 access p1s0-7~p1s0-8 secure default                                                                                                                                                                                                0x10: M0,M8,M10 access p1s1-0~p1s1-6 secure default</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_PLD1_S</name>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <description>Error log payload register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_LOCK_S</name>
              <description>AxLock of the error request.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CACHE_S</name>
              <description>AxCache of the error request.</description>
              <bitRange>[29:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ElR_PROT_S</name>
              <description>AxProt of the error request.</description>
              <bitRange>[25:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SIZE_S</name>
              <description>Size of the error request.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_ID_S</name>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <description>Error log ID information register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ID_S</name>
              <description>Tagid of the error request.
8'b0000????: M0 KM4TZ security error
8'b1101????: M8 KM4NS security error
8'b1111????: M10 OTPC/SIC access error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_ADR0_S</name>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <description>Error log addrress register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR0_S</name>
              <description>Address[31:0] of the error request.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_ADR1_S</name>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <description>Error log addrress register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR1_S</name>
              <description>Address[63:32] of the error request.</description>
              <bitRange>[63:32]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_CODE_S</name>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <description>Error code register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_CODE_S</name>
              <description>The error code of error request, if it's 0, indicates that there is no error request. 
8'h00: No error
8'h02: Secure fault error</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_INTR_CLR_S</name>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <description>Error log clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_INTR_CLR_S</name>
              <description>Error log interrupt clear. Writing 1'b1 to the register will trigger a 1-cycle pulse interrupt clear. It has to write 1'b1 to this register every time when the error exception occurs.
Note that this register is write-only, the return value of reading this register is meaningless.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_2_PLD0_S</name>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <description>Error log payload register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_BSTINDEX_S</name>
              <description>Burst index of the error request.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTLEN_S</name>
              <description>Burst Length of the error request.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTTYPE_S</name>
              <description>BurstSeq of the error request.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CMD_S</name>
              <description>CMD of the error request.
0x1: Write command
0x2: Read command</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SRC_S</name>
              <description>Error source of the error request.
0x20: M0,M8,M10 access p1s0-0 secure default                                                                                                                                                                                             0x21: M0,M8,M10 access p1s0-1~p1s0-4 secure default                                                                                                                                                                                                0x22: M0,M8,M10 access p1s0-5~p1s0-6 secure default                                                                                                                                                                                        0x11: M0,M8,M10 access p1s0-7~p1s0-8 secure default                                                                                                                                                                                                0x10: M0,M8,M10 access p1s1-0~p1s1-6 secure default</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_2_PLD1_S</name>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <description>Error log payload register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_LOCK_S</name>
              <description>AxLock of the error request.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CACHE_S</name>
              <description>AxCache of the error request.</description>
              <bitRange>[29:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ElR_PROT_S</name>
              <description>AxProt of the error request.</description>
              <bitRange>[25:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SIZE_S</name>
              <description>Size of the error request.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_2_ID_S</name>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <description>Error log ID information register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ID_S</name>
              <description>Tagid of the error request.
8'b0000????: M0 KM4TZ security error
8'b1101????: M8 KM4NS security error
8'b1111????: M10 OTPC/SIC access error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_2_ADR0_S</name>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <description>Error log addrress register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR0_S</name>
              <description>Address[31:0] of the error request.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_2_ADR1_S</name>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <description>Error log addrress register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR1_S</name>
              <description>Address[63:32] of the error request.</description>
              <bitRange>[63:32]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_2_CODE_S</name>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <description>Error code register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_CODE_S</name>
              <description>The error code of error request, if it's 0, indicates that there is no error request. 
8'h00: No error
8'h02: Secure fault error</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_2_INTR_CLR_S</name>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <description>Error log clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_INTR_CLR_S</name>
              <description>Error log interrupt clear. Writing 1'b1 to the register will trigger a 1-cycle pulse interrupt clear. It has to write 1'b1 to this register every time when the error exception occurs.
Note that this register is write-only, the return value of reading this register is meaningless.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
