Ameba-AIoT/ameba-rtos/tools/scripts/jlink_script/svd/RTL8720F_ips_internal.svd
        <register>
          <name>SLOT_CTRL</name>
          <addressOffset>0x00001000</addressOffset>
          <size>32</size>
          <description>Slot control of weighted round-robin for SRAM</description>
          <resetValue>0x49244924</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AW_SLOT_0</name>
              <description>Control value of write slot 0</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_SLOT_1</name>
              <description>Control value of write slot 1</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_SLOT_2</name>
              <description>Control value of write slot 2</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_SLOT_3</name>
              <description>Control value of write slot 3</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_SLOT_4</name>
              <description>Control value of write slot 4</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_SLOT_5</name>
              <description>Control value of write slot 5</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_SLOT_6</name>
              <description>Control value of write slot 6</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_SLOT_7</name>
              <description>Control value of write slot 7</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_SLOT_0</name>
              <description>Control value of read slot 0</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_SLOT_1</name>
              <description>Control value of read slot 1</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_SLOT_2</name>
              <description>Control value of read slot 2</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_SLOT_3</name>
              <description>Control value of read slot 3</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_SLOT_4</name>
              <description>Control value of read slot 4</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_SLOT_5</name>
              <description>Control value of read slot 5</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_SLOT_6</name>
              <description>Control value of read slot 6</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_SLOT_7</name>
              <description>Control value of read slot 7</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_PLD0</name>
          <addressOffset>0x00001100</addressOffset>
          <size>32</size>
          <description>Error log payload register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_BSTINDEX</name>
              <description>Burst index of the error request.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTLEN</name>
              <description>Burst Length of the error request.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTTYPE</name>
              <description>BurstSeq of the error request.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CMD</name>
              <description>CMD of the error request.
0x1: Write command
0x2: Read command</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SRC</name>
              <description>Error source of the error request.
0x00: km4ns or otpc address hole default slave                                                                                                                                              0x24: wifi or aes_sha address hole default slave</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_PLD1</name>
          <addressOffset>0x00001104</addressOffset>
          <size>32</size>
          <description>Error log payload register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_LOCK</name>
              <description>AxLock of the error request.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CACHE</name>
              <description>AxCache of the error request.</description>
              <bitRange>[29:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ElR_PROT</name>
              <description>AxProt of the error request.</description>
              <bitRange>[25:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SIZE</name>
              <description>Size of the error request.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_ID</name>
          <addressOffset>0x00001148</addressOffset>
          <size>32</size>
          <description>Error log ID information register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ID</name>
              <description>Tagid of the error request.
8'b0000????: M0 KM4TZaccess error
8'b1101????: M8 KM4NS access error
8'b1111????: M10 OTPC/SIC access error
8'b101?????: M11 AES_SHA access error
8'b1110????: M9 WIFI access error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_ADR0</name>
          <addressOffset>0x0000110C</addressOffset>
          <size>32</size>
          <description>Error log addrress register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR0</name>
              <description>Address[31:0] of the error request.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_ADR1</name>
          <addressOffset>0x00001110</addressOffset>
          <size>32</size>
          <description>Error log addrress register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR1</name>
              <description>Address[63:32] of the error request.</description>
              <bitRange>[63:32]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_CODE</name>
          <addressOffset>0x00001130</addressOffset>
          <size>32</size>
          <description>Error code register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_CODE</name>
              <description>The error code of error request, if it's 0, indicates that there is no error request. 
8'h00: No error
8'h01: Address hole error</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_0_INTR_CLR</name>
          <addressOffset>0x0000113C</addressOffset>
          <size>32</size>
          <description>Error log clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_INTR_CLR</name>
              <description>Error log interrupt clear. Writing 1'b1 to the register will trigger a 1-cycle pulse interrupt clear. It has to write 1'b1 to this register every time when the error exception occurs.
Note that this register is write-only, the return value of reading this register is meaningless.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_PLD0</name>
          <addressOffset>0x00001140</addressOffset>
          <size>32</size>
          <description>Error log payload register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_BSTINDEX</name>
              <description>Burst index of the error request.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTLEN</name>
              <description>Burst Length of the error request.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_BSTTYPE</name>
              <description>BurstSeq of the error request.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CMD</name>
              <description>CMD of the error request.
0x1: Write command
0x2: Read command</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SRC</name>
              <description>Error source of the error request.
0x00: km4ns or otpc address hole default slave                                                                                                                                              0x24: wifi or aes_sha address hole default slave</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_PLD1</name>
          <addressOffset>0x00001144</addressOffset>
          <size>32</size>
          <description>Error log payload register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_LOCK</name>
              <description>AxLock of the error request.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_CACHE</name>
              <description>AxCache of the error request.</description>
              <bitRange>[29:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ElR_PROT</name>
              <description>AxProt of the error request.</description>
              <bitRange>[25:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ELR_SIZE</name>
              <description>Size of the error request.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_ADR0</name>
          <addressOffset>0x0000114C</addressOffset>
          <size>32</size>
          <description>Error log addrress register0</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR0</name>
              <description>Address[31:0] of the error request.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_ADR1</name>
          <addressOffset>0x00001150</addressOffset>
          <size>32</size>
          <description>Error log addrress register1</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_ADR1</name>
              <description>Address[63:32] of the error request.</description>
              <bitRange>[63:32]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_CODE</name>
          <addressOffset>0x00001170</addressOffset>
          <size>32</size>
          <description>Error code register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_CODE</name>
              <description>The error code of error request, if it's 0, indicates that there is no error request. 
8'h00: No error
8'h01: Address hole error</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELR_1_INTR_CLR</name>
          <addressOffset>0x0000117C</addressOffset>
          <size>32</size>
          <description>Error log clear register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELR_INTR_CLR</name>
              <description>Error log interrupt clear. Writing 1'b1 to the register will trigger a 1-cycle pulse interrupt clear. It has to write 1'b1 to this register every time when the error exception occurs.
Note that this register is write-only, the return value of reading this register is meaningless.</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NAME</name>
          <addressOffset>0x00001200</addressOffset>
          <size>32</size>
          <description>RXI300 design name register</description>
          <resetValue>0x00052300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NAME</name>
              <description>The design name of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VER</name>
          <addressOffset>0x00001204</addressOffset>
          <size>32</size>
          <description>RXI300 design version register</description>
          <resetValue>0x00000300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VER</name>
              <description>The design version of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RVE</name>
          <addressOffset>0x00001208</addressOffset>
          <size>32</size>
          <description>RXI300 design reversion register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REV</name>
              <description>The design reversion of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INST</name>
          <addressOffset>0x0000120C</addressOffset>
          <size>32</size>
          <description>RXI300 design instance number register</description>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INST</name>
              <description>The design instance number of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMPL_Y</name>
          <addressOffset>0x00001210</addressOffset>
          <size>32</size>
          <description>RXI300 implementation year register</description>
          <resetValue>0x00002025</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMPL_Y</name>
              <description>The implementatin year of RXI-300.
Reset value depends on implementation date.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMPL_D</name>
          <addressOffset>0x00001214</addressOffset>
          <size>32</size>
          <description>RXI300 implementation date register</description>
          <resetValue>0x03131449</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMPL_D</name>
              <description>The implementatin date of RXI-300.
Reset value depends on implementation date.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV</name>
          <addressOffset>0x00001218</addressOffset>
          <size>32</size>
          <description>RXI300 developer register</description>
          <resetValue>0x00522734</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEV</name>
              <description>The developer of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_NUM</name>
          <addressOffset>0x0000121C</addressOffset>
          <size>32</size>
          <description>RXI300 project number register</description>
          <resetValue>0x00006955</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRO_NUM</name>
              <description>The project number of RXI-300.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
